{"id": 48255, "wybug_id": "wooyun-2014-083704", "wybug_title": "中山医院某办公系统弱口令（已破解出358个员工账号）", "wybug_corp": "中山医院", "wybug_author": "depycode", "wybug_date": "2014-11-18 12:43", "wybug_open_date": "2015-01-02 12:44", "wybug_type": "后台弱口令", "wybug_level": "高", "wybug_rank_0": "20", "wybug_status": "已交由第三方合作机构(cncert国家互联网应急中心)处理", "wybug_from": "http://www.wooyun.org", "wybug_tags": ["弱口令"], "wybug_detail": "漏洞详情 披露状态：   \t\t\t\t\t\t\t\t\t2014-11-18：\t细节已通知厂商并且等待厂商处理中\t\t\t\t\t\t\t\t\t2014-11-21：\t厂商已经确认，细节仅向厂商公开\t\t\t\t\t\t\t\t\t2014-12-01：\t细节向核心白帽子及相关领域专家公开\t\t\t\t\t\t\t\t\t2014-12-11：\t细节向普通白帽子公开\t\t\t\t\t\t\t\t\t2014-12-21：\t细节向实习白帽子公开\t\t\t\t\t\t\t\t\t2015-01-02：\t细节向公众公开  简要描述： RT 详细说明：  http://gys.zs-hospital.sh.cn:8002/  职工入口随便猜的一个账号  00001:123456  登录进去可以做各种操作，供应商 黑名单 药品 啥的。\n\n\n杨念钦\t12506\t一般员工,admin\t是 金彩凤\t21286\t一般员工\t是 朱燕萍\t21424\t一般员工\t是 高丽萍\t20287\t一般员工\t是 孙培\t12648\t一般员工\t是 唐利明\t55543\t一般员工\t是 郑贤胤\t40215\t一般员工\t是 陈亚莉\t20506\t一般员工\t是 刘寒\t12253\t一般员工\t是 马易群\t12772\t一般员工\t是 叶骏\t31600\t一般员工\t是 周梅英\t30547\t一般员工\t是 程中明\t30577\t一般员工\t是 张荃\t10752\t一般员工\t是 刘玮\t20542\t一般员工\t是 王静\t55357\t一般员工\t是 林淼\t55447\t一般员工\t是 张晓怡\t20744\t一般员工\t是 白英楠\t12666\t一般员工\t是 胡佳倩\t60910139\t一般员工\t是 张均睿\t31505\t一般员工\t是 张悦\t22067\t一般员工\t是 严梦茜\t21480\t一般员工\t是 火莉丽\t21627\t一般员工\t是 阎敏\t21167\t一般员工\t是 陶涵彦\t31605\t一般员工\t是 张芳\t21220\t一般员工\t是 余情\t12269\t一般员工\t是 老东辉\t31603\t一般员工\t是 周小吉\t20976\t一般员工\t是 曾琳雯\t21987\t一般员工\t是 褚冬晶\t21295\t一般员工\t是 徐小旦\t21485\t一般员工\t是 乔燕\t20555\t一般员工\t是 李文翔\t55572\t一般员工\t是 张立\t10395\t一般员工\t是 於亚辉\t40198\t一般员工\t是 王雪飞\t21710\t一般员工\t是 施健红\t20746\t一般员工\t是 金磊\t50338\t一般员工\t是 罗忆泓\t55575\t一般员工\t是 葛宁花\t10376\t一般员工\t是 郑博豪\t55566\t一般员工\t是 董智旻\t55360\t一般员工\t是 吴超能\t12727\t一般员工\t是 钟春玖\t10798\t一般员工\t是 陆培华\t20821\t一般员工\t是 纪宗斐\t12751\t一般员工\t是 朱博群\t55450\t一般员工\t是 何国栋\t12319\t一般员工\t是 张晓玲\t21700\t一般员工\t是 胡国祥\t12650\t一般员工\t是 贾亦臣\t12776\t一般员工\t是 黄晓春\t10533\t一般员工\t是 朱加明\t12302\t一般员工\t是 陆明\t10444\t一般员工\t是 杨晓梅\t12207\t一般员工\t是 马慧\t12174\t一般员工\t是 朱骞\t40261\t法务部 (基础功能)\t一般员工\t是 冯潇婧\t21702\t一般员工\t是 叶尘宇\t12397\t一般员工\t是 邬静晔\t20775\t一般员工\t是 杜楚源\t40240\t党委办公室 (三重一大)/党委办公室 (基础功能)\t三重一大审核岗,信访登记管理岗,三重一大管理岗\t是 钱国涌\t50190\t监察审计室 (基础功能)\t一般员工\t是 许华\t12533\t一般员工\t是 吴杰\t12208\t一般员工\t是 崔一忻\t20864\t一般员工\t是 何琴\t22108\t一般员工\t是 章雯珺\t21358\t一般员工\t是 徐毅云\t21093\t一般员工\t是 翟晓峰\t21502\t一般员工\t是 余婕\t21484\t一般员工\t是 朱晓菲\t22137\t一般员工\t是 梅婕\t22116\t一般员工\t是 王燕\t20981\t一般员工\t是 诸贤珏\t21549\t一般员工\t是 姜鹤\t12818\t一般员工\t是 杨凌彦\t21107\t一般员工\t是 朱梁\t12148\t一般员工\t是 张蕾\t12914\t一般员工\t是 周波\t12409\t一般员工\t是 陈静\t12635\t一般员工\t是 王亚男\t12842\t一般员工\t是 王琳\t20667\t一般员工\t是 陈慧勇\t10704\t一般员工\t是 庄亚敏\t12262\t一般员工\t是 常桂林\t12378\t一般员工\t是 庞暘\t12843\t一般员工\t是 徐庆玥\t12690\t一般员工\t是 徐竹静\t21161\t一般员工\t是 黄浙勇\t12596\t一般员工\t是 杨平\t12292\t一般员工\t是 汪媛媛\t21922\t一般员工\t是 沈勤军\t12434\t一般员工\t是 王晓燕\t21943\t一般员工\t是 陈妍洁\t55513\t一般员工\t是 陈学颖\t12562\t一般员工\t是 辛崇美\t12726\t一般员工\t是 孙惠川\t10559\t一般员工\t是 杨愔寂\t21743\t一般员工\t是 蒋晶晶\t12753\t一般员工\t是 黄晨旭\t21207\t一般员工\t是 沈波\t12348\t一般员工\t是 刘清欣\t10615\t一般员工\t是 周正君\t31002\t一般员工\t是 杨缨\t20473\t一般员工\t是 郜红阳\t55546\t一般员工\t是 沈赟\t20990\t一般员工\t是 方家桢\t21567\t一般员工\t是 卢燕华\t21336\t一般员工\t是 宋春晓\t21847\t一般员工\t是 杨懿静\t55587\t一般员工\t是 龚林美\t40228\t医务处 (基础功能)\t信访登记管理岗\t是 何辅成\t40279\t门急诊部 (基础功能)\t信访登记管理岗\t是 陈惠芬\t40235\t门急诊部 (基础功能)\t信访登记管理岗\t是 柯杨\t12343\t一般员工\t是 黄成\t12420\t一般员工\t是 徐萍倩\t21171\t一般员工\t是 李笑笑\t55424\t一般员工\t是 华蓓玲\t21767\t一般员工\t是 赵雯静\t21488\t一般员工\t是 朱峥\t21174\t一般员工\t是 陆振宁\t21938\t一般员工\t是 黄丽琴\t21461\t一般员工\t是 沈黎\t21900\t一般员工\t是 徐凡\t22016\t一般员工\t是 赵芳\t55553\t一般员工\t是 严琳\t21503\t一般员工\t是 金妮\t21889\t一般员工\t是 陆婷婷\t21790\t一般员工\t是 赵海燕\t21128\t一般员工\t是 周爱骏\t21791\t一般员工\t是 赵文彦\t21842\t一般员工\t是 路颖晨\t21978\t一般员工\t是 李娜\t21888\t一般员工\t是 诸琰\t21883\t一般员工\t是 徐艳\t21147\t一般员工\t是 王怡靓\t21658\t一般员工\t是 李晓蓉\t20539\t一般员工\t是 岑怡\t21294\t一般员工\t是 吴文婷\t21454\t一般员工\t是 吴燕萍\t21419\t一般员工\t是 孙雪莹\t21872\t一般员工\t是 吴洁妍\t21036\t一般员工\t是 诸馥琼\t21837\t一般员工\t是 唐莲瑛\t21149\t一般员工\t是 成玉珠\t21988\t一般员工\t是 施东伟\t10667\t一般员工\t是 陈晔\t31520\t一般员工\t是 鲍容\t30755\t一般员工\t是 彭晓白\t55302\t一般员工\t是 朱成玉\t55541\t一般员工\t是 陈伶俐\t12806\t一般员工\t是 谢烨卿\t55268\t一般员工\t是 秦文政\t12548\t一般员工\t是 何佳丽\t22082\t一般员工\t是 黄婷婷\t40304\t一般员工\t是 章静怡\t20589\t一般员工\t是 李玮\t21189\t一般员工\t是 江怡琏\t20818\t一般员工\t是 沈悦霖\t21953\t一般员工\t是 刘瑾\t20875\t一般员工\t是 周俭\t10514\t分管院长(科研合同) (基础功能)\t一般员工\t是 赵维鹏\t12582\t一般员工\t是 贺泓琰\t21402\t一般员工\t是 方敏\t21191\t一般员工\t是 唐晓燕\t21401\t一般员工\t是 郭剑明\t12260\t一般员工\t是 王丽\t55412\t一般员工\t是 吴文川\t12384\t一般员工\t是 李宛璇\t55602\t一般员工\t是 周平红\t10553\t一般员工\t是 邢晓蕾\t21479\t一般员工\t是 廖海霞\t55549\t一般员工\t是 胡沁\t12488\t一般员工\t是 郭怡菁\t75182\t一般员工\t是 李豪杰\t12765\t一般员工\t是 施洁芸\t21210\t一般员工\t是 陈盛\t21280\t一般员工\t是 仲倩\t21396\t一般员工\t是 戴维\t12196\t一般员工\t是 沈军\t20767\t一般员工\t是 郭雪华\t12198\t一般员工\t是 肖骏\t20826\t一般员工\t是 马婷艳\t21143\t一般员工\t是 李曼\t55181\t一般员工\t是 涂传涛\t12415\t一般员工\t是 周建平\t10318\t一般员工\t是 卜丽萍\t10565\t一般员工\t是 庞怡\t21153\t一般员工\t是 胡国华\t10332\t一般员工\t是 张磊\t12551\t一般员工\t是 奚秋磊\t55568\t一般员工\t是 谢迪杨\t12867\t一般员工\t是 诸骏仁\t10008\t一般员工\t是 蔡定芳\t12296\t一般员工\t是 顾虹艳\t20616\t一般员工\t是 姚康\t12496\t一般员工\t是 西雁\t10474\t一般员工\t是 孙晓欧\t20625\t一般员工\t是 胡昕婴\t12322\t一般员工\t是 程宽\t12446\t一般员工\t是 张新\t10502\t一般员工\t是 励雯静\t21084\t一般员工\t是 宋振举\t12317\t一般员工\t是 黄冰清\t12476\t一般员工\t是 王群\t10949\t一般员工\t是 金冬芸\t21575\t一般员工\t是 顾佳伟\t12682\t一般员工\t是 杨梦婕\t30847\t伦理委员会 (基础功能)\t一般员工\t是 吴赤\t55370\t一般员工\t是 竺挺\t12276\t一般员工\t是 颜竹芸\t55466\t一般员工\t是 齐青\t10576\t一般员工\t是 凌志青\t12035\t一般员工\t是 潘力\t21884\t一般员工\t是 林寰东\t10835\t一般员工\t是 甘炜\t20469\t一般员工\t是 杨琴\t21957\t一般员工\t是 周春妹\t30179\t一般员工\t是 王萍\t20750\t一般员工\t是 刘骏桢\t12241\t一般员工\t是 陆琛萱\t20413\t一般员工\t是 徐晓莺\t21539\t一般员工\t是 张颖\t20617\t一般员工\t是 李岑\t21683\t一般员工\t是 虞泽星\t55413\t一般员工\t是 祝英\t20648\t一般员工\t是 李晓牧\t12325\t一般员工\t是 熊万霞\t55509\t一般员工\t是 孙太伟\t12809\t一般员工\t是 花佩\t20983\t一般员工\t是 任卫英\t12219\t一般员工\t是 方深红\t20872\t一般员工\t是 田培\t20822\t一般员工\t是 李秋平\t10570\t一般员工\t是 黄备建\t10611\t一般员工\t是 张建中\t30543\t(北)制剂室 (供应商)\t供应商管理岗\t是 伍大权\t12862\t一般员工\t是 王赟\t20713\t一般员工\t是 宁一纯\t55533\t一般员工\t是 李熙雷\t12160\t一般员工\t是 薛琴\t55547\t一般员工\t是 李思\t55551\t一般员工\t是 朱芬\t55536\t一般员工\t是 唐颖嘉\t21114\t一般员工\t是 施征玮\t20730\t一般员工\t是 潘亭\t22070\t一般员工\t是 徐仁德\t12904\t一般员工\t是 沈天皓\t55603\t一般员工\t是 陈婷\t21399\t一般员工\t是 朱晓玲\t20897\t一般员工\t是 罗菁\t20772\t一般员工\t是 钱海宁\t20833\t一般员工\t是 顾云靓\t21904\t一般员工\t是 邹佳雯\t22125\t一般员工\t是 宋卓菁\t21887\t一般员工\t是 陈慧\t20416\t一般员工\t是 徐鹏举\t12464\t一般员工\t是 付明强\t55383\t一般员工\t是 陈菲菲\t55534\t一般员工\t是 黄新生\t12155\t一般员工\t是 张肖晶\t21878\t一般员工\t是 韩奕\t12758\t一般员工\t是 罗剑钧\t12315\t一般员工\t是 胡炯\t8130397\t一般员工\t是 杨达伟\t12878\t一般员工\t是 江孙芳\t10714\t一般员工\t是 张明兰\t10728\t一般员工\t是 杨洋\t22053\t一般员工\t是 胡亚男\t31536\t一般员工\t是 胡佳琦\t30724\t一般员工\t是 吴轶喆\t12748\t一般员工\t是 周慧\t20470\t一般员工\t是 孙伟\t20584\t一般员工\t是 吕越昌\t55371\t一般员工\t是 王传福\t50298\t一般员工\t是 凌云龙\t55537\t一般员工\t是 陆汇文\t22001\t一般员工\t是 陈凌\t55432\t一般员工\t是 程羽菲\t60810044\t一般员工\t是 丁小军\t12225\t一般员工\t是 方金忠\t8140520\t一般员工\t是 许青\t31509\t一般员工\t是 张瑾\t12238\t一般员工\t是 张韵华\t10612\t一般员工\t是 刘旭\t12339\t一般员工\t是 徐治国\t40234\t工会 (基础功能)\t一般员工,信访登记管理岗\t是 王志聪\t55597\t一般员工\t是 黄荣南\t61016003\t一般员工\t是 伍秋宁\t60910177\t一般员工\t是 耿悦\t55463\t一般员工\t是 董继宏\t10646\t一般员工\t是 高鹏程\t22151\t一般员工\t是 朱文青\t10530\t一般员工\t是 胡冉\t60910181\t一般员工\t是 赵美玲\t50222\t一般员工\t是 曾文正\t55538\t一般员工\t是 刘立\t12857\t一般员工\t是 金淳\t55227\t一般员工\t是 陆彦炯\t30244\t一般员工\t是 赵一鸣\t12822\t一般员工\t是 李本昌\t8140412\t一般员工\t是 余平波\t12798\t一般员工\t是 俞婷\t55353\t一般员工\t是 丁羽立\t22052\t一般员工\t是 许诺\t55521\t一般员工\t是 刘晓文\t30994\t一般员工\t是 张卓君\t12752\t一般员工\t是 沈月红\t20796\t一般员工\t是 马莉辉\t21202\t一般员工\t是 魏黎\t20757\t一般员工\t是 王晓丹\t12324\t一般员工\t是 徐礁\t20636\t一般员工\t是 乐真真\t21103\t一般员工\t是 郭常安\t12311\t一般员工\t是 徐蓓莉\t12677\t一般员工\t是 叶青海\t10513\t一般员工\t是 郭磊\t12871\t一般员工\t是 孙仁勤\t50001645\t一般员工\t是 刘晓烨\t21570\t一般员工\t是 周倩琳\t60910161\t一般员工\t是 宋菲儿\t61010197\t一般员工\t是 莫非\t60910123\t一般员工\t是 肖红叶\t55285\t一般员工\t是 陶祥元\t40178\t一般员工\t是 仇琼\t20877\t一般员工\t是 蔡洁茹\t55532\t一般员工\t是 张博恒\t10436\t一般员工\t是 潘思梦\t55229\t一般员工\t是 陈庆兴\t12902\t一般员工\t是 陈斐颖\t21933\t一般员工\t是 阮宏\t12197\t一般员工\t是 王芸濛\t22095\t一般员工\t是 李蝶\t21959\t一般员工\t是 孙艳云\t21017\t一般员工\t是 葛艺\t21942\t一般员工\t是 陆晶晶\t21270\t一般员工\t是 卢芳\t20657\t一般员工\t是 姚瑶\t21608\t一般员工\t是 李文昌\t12398\t一般员工\t是 牛金全\t8140063\t一般员工\t是 潘忠军\t8140062\t一般员工\t是 吕艳娥\t8140061\t一般员工\t是 潘紫雯\t22117\t一般员工\t是 东莉\t20641\t一般员工\t是 张平\t20358\t一般员工\t是 葛晨\t21645\t一般员工\t是 张明\t55584\t一般员工\t是 叶秋莹\t55585\t一般员工\t是 顾晓明\t31543\t一般员工\t是 戚亚文\t21049\t一般员工\t是 徐鏐烨\t21465\t一般员工\t是 冯婷\t21846\t一般员工\t是 张薇\t21409\t一般员工\t是 孙庆晏\t21233\t一般员工\t是 汤敏\t12102\t一般员工\t是 范凡\t55529\t一般员工\t是 侯英勇\t12267\t一般员工\t是 沈继平\t12379\t一般员工\t是 裘兴骏\t50343\t一般员工\t是 孙绮蛮\t12387\t一般员工\t是 张帆\t12869\t一般员工\t是 唐燕\t22072\t一般员工\t是 欧玉凤\t20621\t一般员工\t是 董天庚\t55428\t一般员工\t是 王寅\t55361\t一般员工\t是 李文伟\t12500\t一般员工\t是 薛明明\t55232\t一般员工\t是 刘光华\t12883\t一般员工\t是 唐红敏\t10515\t院长办公室 (供应商)\t供应商管理岗\t是 黄雨婷\t22065\t一般员工\t是 梁义秀\t12844\t一般员工\t是 沈盛\t12685\t心血管药理研究所 (供应商)\t供应商管理岗\t是 杨晔\t12847\t一般员工\t是 计顺意\t20574\t一般员工\t是 余岚\t20407\t一般员工\t是 侯君谊\t55506\t一般员工\t是 杜芸芸\t21360\t一般员工\t是 张禕\t21674\t一般员工\t是 崔晓通\t55526\t一般员工\t是 陈佳\t21707\t一般员工\t是 王滢晨\t22083\t一般员工\t是 薛张纲\t10398\t一般员工\t是 山崎\t21753\t一般员工\t是 杜施霖\t12425\t一般员工\t是 沈蓓雯\t22043\t一般员工\t是 叶芳\t12240\t一般员工\t是 王毓琳\t12905\t一般员工\t是 楼文晖\t10554\t一般员工\t是 顾宇彤\t10501\t一般员工\t是 郑吉莉\t20862\t一般员工\t是 夏光\t55138\t一般员工\t是 陈波\t21359\t一般员工\t是 陈世耀\t10434\t一般员工\t是 符伟国\t10301\t一般员工\t是 王佳瑜\t22145\t一般员工\t是 戎瑞明\t10628\t一般员工\t是 姚晨玲\t10417\t一般员工\t是 蔡良\t30778\t一般员工\t是 武睿毅\t12422\t一般员工\t是 丁伟\t21913\t一般员工\t是 屠蕊沁\t10290\t一般员工\t是 姜林娣\t10431\t一般员工\t是 孙丹诞\t21654\t一般员工\t是 徐圣怡\t21932\t一般员工\t是 姚利\t21139\t一般员工\t是 诸妍\t21893\t一般员工\t是 薛渊\t12288\t一般员工\t是 高燕\t22142\t一般员工\t是 陈辰\t55539\t一般员工\t是 赵巧英\t20352\t一般员工\t是 陈苗\t21971\t一般员工\t是 於雷\t12821\t一般员工\t是 邵静仁\t21356\t一般员工\t是 齐飚\t59998\t一般员工\t是 刘豪\t30246\t一般员工\t是 李芃芃\t40311\t一般员工\t是 薛同春\t12576\t一般员工\t是 齐建超\t59995\t一般员工\t是 杨子昂\t10625\t一般员工\t是 陆雅萍\t21723\t一般员工\t是 王晨\t55593\t一般员工\t是 赵懿\t20464\t一般员工\t是 单明敏\t21536\t一般员工\t是 孙崇璟\t55576\t一般员工\t是 朱利靖\t55581\t一般员工\t是 周梅玲\t12584\t一般员工\t是 刘卫仁\t12856\t一般员工\t是 赵梦\t55362\t一般员工\t是 吴琳\t12081\t一般员工\t是 纪元\t12411\t一般员工\t是 胡敏\t20572\t一般员工\t是 李光伟\t55287\t一般员工\t是 韩姣\t21331\t一般员工\t是 吴海燕\t31607\t一般员工\t是 朱冬\t55569\t一般员工\t是 胡继红\t55346\t一般员工\t是 李洁\t21020\t一般员工\t是 倪佳\t21991\t一般员工\t是 沈海云\t55592\t一般员工\t是 丁文军\t10958\t一般员工\t是 孙勇新\t12390\t一般员工\t是 倪思康\t22062\t一般员工\t是 赵丽莉\t20759\t一般员工\t是 杨橙\t55427\t一般员工\t是 王祝玮\t22045\t一般员工\t是 张巍\t12882\t一般员工\t是 张晓彪\t12254\t一般员工\t是 潘向欧\t12808\t一般员工\t是 余卓\t55468\t一般员工\t是 潘夏楠\t22122\t一般员工\t是 朱玥婷\t22081\t一般员工\t是 丁明\t12316\t一般员工\t是 顾晓惠\t22128\t一般员工\t是 黄安琪\t21969\t一般员工\t是 刘睿艳\t20991\t一般员工\t是 高露娟\t12832\t一般员工\t是 张嘉雯\t21605\t一般员工\t是 胡捷\t55435\t一般员工\t是 张磊\t12901\t一般员工\t是 阿拉努尔·穆合塔尔\t55473\t一般员工\t是 张琼\t20650\t一般员工\t是 张华文\t21822\t一般员工\t是 陈弘\t12889\t一般员工\t是 马琳琳\t55296\t一般员工\t是 潘琼\t20729\t一般员工\t是 刘盛东\t40278\t一般员工\t是 吴薇薇\t20868\t一般员工\t是 李慧\t12380\t一般员工\t是 朱德祥\t55433\t一般员工\t是 唐晓红\t20718\t一般员工\t是 唐敏倩\t20694\t一般员工\t是 李明辉\t55384\t一般员工\t是 杨震\t12134\t一般员工\t是 蒋兰芝\t22143\t一般员工\t是 顾云逸\t22088\t一般员工\t是 荣英\t21349\t一般员工\t是 谢天妮\t22069\t一般员工\t是 顾沈燕\t21928\t一般员工\t是 杨建伟\t10665\t一般员工\t是 步路标\t30568\t一般员工\t是 叶菁\t21019\t一般员工\t是 龚燕妮\t22041\t一般员工\t是 纪如媛\t21201\t一般员工\t是 张玮\t22063\t一般员工\t是 刘毅\t55255\t一般员工\t是 奚俊杰\t12909\t一般员工\t是 王国骅\t12038\t一般员工\t是 赵刚\t12802\t一般员工\t是 林生力\t55438\t一般员工\t是 黄雅琴\t55344\t一般员工\t是 丁小强\t10522\t一般员工\t是 居彩霞\t20396\t一般员工\t是 余优成\t12009\t一般员工\t是 龚剑\t12191\t一般员工\t是 吕雅韵\t22131\t一般员工\t是 缪秋琛\t21858\t一般员工\t是 雷海燕\t55548\t一般员工\t是 王箴\t12304\t一般员工\t是 熊怡泓\t22119\t一般员工\t是 鲍卫华\t30197\t一般员工\t是 刘海蕾\t20831\t一般员工\t是 顾睿予\t21934\t一般员工\t是 杨敏华\t21087\t一般员工\t是 陈颐\t12034\t一般员工\t是 陈晓姗\t55591\t一般员工\t是 顾彦秋\t22111\t一般员工\t是 施佳怡\t22059\t一般员工\t是 喻薇\t21059\t一般员工\t是 黄佩新\t12866\t一般员工\t是 施伟斌\t30185\t体检中心 (供应商)\t供应商管理岗\t是 吴佳庆\t21092\t一般员工\t是 邹静怀\t12362\t一般员工\t是 程志祥\t10662\t一般员工\t是 张潇伊\t12375\t一般员工\t是 徐敏\t20816\t一般员工\t是 宣丽真\t12700\t一般员工\t是 郑业伟\t20295\t一般员工\t是 郭宝磊\t55376\t一般员工\t是 陈虹\t59992\t一般员工\t是 黄麒\t20673\t一般员工\t是 周云\t10607\t一般员工\t是 黄婷\t22074\t一般员工\t是 陈东旭\t55233\t一般员工\t是 陈玮\t55472\t一般员工\t是 隗祎\t10644\t一般员工\t是 陈佳超\t55522\t一般员工\t是 张宁萍\t12338\t一般员工\t是 朱丽\t21181\t一般员工\t是 胡燕\t20978\t一般员工\t是 汪沁缘\t22135\t一般员工\t是 杜敏\t55482\t一般员工\t是 王培林\t55485\t一般员工\t是 唐文斌\t12251\t一般员工\t是 龚昱达\t55329\t一般员工\t是 罗雪梅\t10641\t一般员工\t是 王葆青\t10584\t分部 (三重一大)\t一般员工,三重一大管理岗\t是 宋凯\t10477\t一般员工\t是 金莺莺\t21831\t一般员工\t是 唐颐\t20600\t一般员工\t是 姜帅\t12335\t一般员工\t是 顾思忆\t22129\t一般员工\t是 徐磊\t22153\t一般员工\t是 沈雳\t12579\t一般员工\t是 何义舟\t12512\t一般员工\t是 于明香\t12299\t一般员工\t是 胡骁轶\t12462\t一般员工\t是 刘黎黎\t12632\t一般员工\t是 姚翔\t20809\t一般员工\t是 顾众慧\t21556\t一般员工\t是 顾济平\t21054\t一般员工\t是 杨永怡\t21041\t一般员工\t是 刘红\t10966\t一般员工\t是 沈小静\t55478\t一般员工\t是 王琴\t12880\t一般员工\t是 俞青\t21769\t一般员工\t是 李骥\t55486\t一般员工\t是 杨萍\t55341\t一般员工\t是 秦凤花\t55354\t一般员工\t是 任萍\t21720\t一般员工\t是 刘嫣\t40219\t院长办公室 (三重一大)\t三重一大审核岗\t是 张鑫叶\t22068\t一般员工\t是 范虹\t10690\t一般员工\t是 张博\t55573\t一般员工\t是 单艳\t12341\t一般员工\t是 丁玥\t55414\t一般员工\t是 姜惠芬\t22105\t一般员工\t是 孙健\t12355\t一般员工\t是 陶力\t10616\t一般员工\t是 凌佳倩\t55578\t一般员工\t是 陆清\t12483\t一般员工\t是 徐世坤\t12323\t一般员工\t是 卲雨婷\t40290\t一般员工\t是 杨昌生\t10781\t一般员工\t是 付亮\t55570\t一般员工\t是 林贻梅\t10635\t一般员工\t是 张岚\t12125\t一般员工\t是 马东芹\t55223\t一般员工\t是 李权\t12907\t一般员工\t是 时强\t12891\t一般员工\t是 费腾\t55305\t一般员工\t是 娄逸\t55516\t一般员工\t是 张琳\t22107\t一般员工\t是 吴卫文\t660035\t一般员工\t是 黄振\t12836\t一般员工\t是 薛宁\t12340\t一般员工\t是 陈晨\t12910\t一般员工\t是 周浩\t10649\t一般员工\t是 郑林文\t59989\t一般员工\t是 张庆\t55402\t一般员工\t是 朱蓁蓁\t40303\t科研处 (供应商)/科研处 (基础功能)\t供应商管理岗,一般员工\t是 马昱\t10768\t一般员工\t是 郑峥\t20642\t一般员工\t是 孙晓宁\t12418\t一般员工\t是 梅静骅\t21820\t一般员工\t是 张莺\t20812\t一般员工\t是 施杰毅\t55431\t一般员工\t是 顾俭勇\t12058\t一般员工\t是 张洲姬\t55600\t一般员工\t是 彭娟\t12474\t一般员工\t是 陈芳芳\t12804\t一般员工\t是 谢玲俐\t22057\t一般员工\t是 王晓敏\t22121\t一般员工\t是 毛枫\t10710\t一般员工\t是 姚婧\t55596\t一般员工\t是 沈洋\t20514\t一般员工\t是 祁红娣\t20266\t一般员工\t是 费琴明\t10557\t一般员工\t是 张勇\t12346\t一般员工\t是 乔玉磊\t10732\t一般员工\t是 韩晶\t55481\t一般员工\t是 王青乐\t55598\t一般员工\t是 陈蕙\t22090\t一般员工\t是 董玲\t12052\t一般员工\t是 周海英\t20655\t一般员工\t是 易嘉勇\t12274\t一般员工\t是 虞奋\t20536\t一般员工\t是 周健\t12773\t一般员工\t是 潘文志\t12663\t一般员工\t是 吴峻\t55440\t一般员工\t是 江春菲\t12646\t一般员工\t是 许雪峰\t10621\t一般员工\t是 魏征\t12233\t一般员工\t是 徐馨\t12868\t一般员工\t是 杨守国\t12165\t一般员工\t是 张震\t12769\t一般员工\t是 马婧嶔\t55460\t一般员工\t是 刘韬韬\t12218\t一般员工\t是 吴晓宇\t12439\t一般员工\t是 李希雯\t55182\t一般员工\t是 林豪杰\t12156\t一般员工\t是 高美\t55335\t一般员工\t是 项忆瑾\t55470\t一般员工\t是 刘靖正\t12831\t一般员工\t是 李思愉\t55398\t一般员工\t是 戴宇翔\t12495\t一般员工\t是 郭津生\t10547\t一般员工\t是 赵菁\t55477\t一般员工\t是 洪涛\t12004\t一般员工\t是 王庆\t12145\t一般员工\t是 王莉\t12839\t一般员工\t是 邵长周\t12369\t一般员工\t是 吴燕\t20960\t一般员工\t是 郑乐平\t22147\t一般员工\t是 乔羽飞\t55590\t一般员工\t是 陆晓茵\t22134\t一般员工\t是 沈英皓\t12268\t一般员工\t是 刘慧\t55345\t一般员工\t是 胡洁羚\t22130\t一般员工\t是 毕玮\t10764\t一般员工\t是 胡克俭\t30946\t一般员工\t是 吴东\t10568\t一般员工\t是 石虹\t12010\t一般员工\t是 陆婷婷\t21472\t一般员工\t是 毛丹\t21240\t一般员工\t是 王嘉玲\t22109\t一般员工\t是 王逸群\t21632\t一般员工\t是 杨国欢\t12127\t一般员工\t是 顾佳慧\t22047\t一般员工\t是 叶妙音\t22084\t一般员工\t是 祝晓桑\t20614\t一般员工\t是 吴敏婕\t21115\t一般员工\t是 丁光宇\t55441\t一般员工\t是 黄君龄\t12828\t一般员工\t是 刘中华\t12328\t一般员工\t是 李洁云\t55238\t一般员工\t是 龚漪娜\t21060\t一般员工\t是 马文静\t22075\t一般员工\t是 戚贵生\t12888\t一般员工\t是 孙玮\t22101\t一般员工\t是 黄越英\t55492\t一般员工\t是 李苗\t55279\t一般员工\t是 饶圣祥\t12653\t一般员工\t是 王丛菲\t59988\t一般员工\t是 惠晓玲\t30978\t一般员工\t是 孙会贞\t55356\t一般员工\t是 李明\t20825\t一般员工\t是 曹萍\t20331\t一般员工\t是 李锋\t12594\t一般员工\t是 陈佳妮\t22094\t一般员工\t是 傅修涛\t12870\t一般员工\t是 易拓\t12893\t一般员工\t是 陈嵩\t12913\t一般员工\t是 庄静丽\t12114\t一般员工\t是 李佳旻\t12571\t一般员工\t是 林红\t81085\t一般员工\t是 王洁媛\t21897\t一般员工\t是 王一梅\t12593\t一般员工\t是 杨钊\t55561\t一般员工\t是 刘海云\t59993\t一般员工\t是 张建平\t12130\t一般员工\t是 陆芳\t55475\t一般员工\t是 贾佳\t55556\t一般员工\t是 汪阳\t55557\t一般员工\t是 周佩歆\t21931\t一般员工\t是 王尹曼\t12845\t一般员工\t是 顾晓燕\t21112\t一般员工\t是 沙来买提·沙力\t55527\t一般员工\t是 黄宛玲\t59999\t一般员工\t是 赵磊\t55595\t一般员工\t是 程健\t20595\t一般员工\t是 王鹏\t12239\t一般员工\t是 吕佳\t21001\t一般员工\t是 潘东\t30700\t一般员工\t是 钱磊\t30774\t一般员工\t是 方芳\t21221\t一般员工\t是 王一惟\t55562\t一般员工\t是 李鹤\t55437\t一般员工\t是 徐磊\t30763\t一般员工\t是 鞠睿\t31007\t一般员工\t是 程洁敏\t10292\t一般员工\t是 李世超\t55310\t一般员工\t是 古杰\t55436\t一般员工\t是 周婉婷\t20776\t一般员工\t是 顾黎敏\t21802\t一般员工\t是 杨欣荣\t12705\t一般员工\t是 范晓丹\t55499\t一般员工\t是 陆莲宇\t22114\t一般员工\t是 沈锡中\t10784\t一般员工\t是 彭伟锋\t12394\t一般员工\t是 袁璐\t55558\t一般员工\t是 杨士波\t55493\t一般员工\t是 征雪英\t8140194\t一般员工\t是 李政\t55456\t一般员工\t是 张佳晶\t21192\t一般员工\t是 项方方\t55518\t一般员工\t是 蒋鹏瑶\t55474\t一般员工\t是 何凡\t50135\t一般员工\t是 刘艺\t55494\t一般员工\t是 李静怡\t20969\t一般员工\t是 翟长文\t55348\t一般员工\t是 李国平\t12147\t一般员工\t是 盛卫忠\t12053\t一般员工\t是 蒋旭\t55408\t一般员工\t是 曹蕾\t21882\t一般员工\t是 祁俏然\t55586\t一般员工\t是 贺宏勇\t55448\t一般员工\t是 李权\t55115\t一般员工\t是 孙菁\t12033\t一般员工\t是 朱小东\t12823\t一般员工\t是 吴冰洁\t55519\t一般员工\t是 刘利民\t10415\t一般员工\t是 王婷\t12356\t一般员工\t是 张键\t12005\t一般员工\t是 周洁白\t55514\t一般员工\t是 戴鲁筠\t55511\t一般员工\t是 杜丹峰\t55588\t一般员工\t是 方颖\t55262\t一般员工\t是 马玉燕\t55512\t一般员工\t是 吴志峰\t12858\t一般员工\t是 潘程玮\t55284\t一般员工\t是 刘琛\t12129\t一般员工\t是 汪学非\t12272\t一般员工\t是 孙益红\t10721\t一般员工\t是 许中\t55488\t一般员工\t是 张育红\t20431\t一般员工\t是 王伟敏\t55210\t一般员工\t是 姜晓幸\t10388\t一般员工\t是 程立宏\t20627\t一般员工\t是 张怡安\t55528\t一般员工\t是 杨凌丽\t21172\t一般员工\t是 甘强均\t55565\t一般员工\t是 徐旻璐\t21896\t一般员工\t是 丁红\t10445\t一般员工\t是 徐杰\t21798\t一般员工\t是 李静\t55524\t一般员工\t是 徐嫣嫣\t21160\t一般员工\t是 宋亚楠\t55520\t一般员工\t是 秦琦\t21175\t一般员工\t是 管意云\t20689\t一般员工\t是 徐凯\t12611\t一般员工\t是 陈子贤\t12505\t一般员工\t是 朱军\t20490\t一般员工\t是 虞正红\t20449\t一般员工\t是 陆树洋\t55429\t一般员工\t是 崔春晓\t55403\t一般员工\t是 贺旻\t55301\t一般员工\t是 孙颖\t55386\t一般员工\t是 奚百顺\t12096\t一般员工\t是 杨达伟\t55273\t一般员工\t是 姚雨濛\t55278\t一般员工\t是 张倩\t20888\t一般员工\t是 王天浩\t12029\t一般员工\t是 易拓\t55323\t一般员工\t是 江瀛川\t10715\t一般员工\t是 马莉莉\t12345\t一般员工\t是 陆南杭\t55313\t一般员工\t是 俞梅蓉\t40152\t监察审计室 (供应商)/监察审计室 (三重一大)/监察审计室 (基础功能)/科研处 (基础功能)/纪检监察 (基础功能)\t供应商超级管理员,三重一大审核岗,信访登记管理岗,一般员工\t是 陈晓西\t55168\t一般员工\t是 黄琦\t55416\t一般员工\t是 林晛\t55116\t一般员工\t是 袁伟\t55505\t一般员工\t是 方龙\t55490\t一般员工\t是 童华\t55487\t一般员工\t是 范围晴\t31617\t一般员工\t是 周林燕\t55545\t一般员工\t是 周少来\t55571\t一般员工\t是 余陈贵\t59991\t一般员工\t是 赵闻\t55582\t一般员工\t是 徐晨曦\t55425\t一般员工\t是 周念\t59996\t一般员工\t是 盛君\t20721\t一般员工\t是 韦素兰\t31041\t一般员工\t是 俞静娴\t20656\t一般员工\t是 杨新梅\t20635\t党委办公室 (基础功能)\t一般员工,信访登记管理岗\t是 罗哲\t12221\t一般员工\t是 姜物华\t55401\t一般员工\t是 郑健敏\t40258\t一般员工\t是 王庆萍\t30970\t一般员工\t是 白浩鸣\t40220\t教育处 (供应商)\t供应商管理岗\t是 陈伟\t10640\t一般员工\t是 戴慧萍\t20885\t一般员工\t是 郦珊珊\t12602\t一般员工\t是 臧游亚\t55421\t一般员工\t是 彭琬晴\t55405\t一般员工\t是 胡凡\t10650\t一般员工\t是 吴国豪\t10684\t一般员工\t是 朱建锋\t30665\t一般员工\t是 杨骥\t12698\t一般员工\t是 李元\t55366\t一般员工\t是 张树民\t12471\t一般员工\t是 仲昕\t12745\t一般员工\t是 卞振\t55364\t一般员工\t是 王宣传\t12680\t一般员工\t是 王春兰\t55358\t一般员工\t是 胡必杰\t10355\t一般员工\t是 陈诚\t55303\t一般员工\t是 韦岚峥\t20830\t防保科 (供应商)/防保科 (供应商)\t供应商管理岗\t是 刘文娟\t12525\t一般员工\t是 许妍艳\t20995\t一般员工\t是 过常发\t12577\t一般员工\t是 艾志龙\t10691\t一般员工\t是 赵蔼婷\t21741\t一般员工\t是 祝琳\t21064\t一般员工\t是 厉天瑜\t55469\t一般员工\t是 洪霞\t31023\t计算机网络中心 (供应商)\t供应商管理岗\t是 周朝晖\t10661\t科研处 (供应商)/科研处 (基础功能)\t供应商管理岗,三重一大管理岗,一般员工\t是 徐建鸣\t20914\t护理部 (三重一大)\t供应商管理岗,三重一大管理岗\t是 郑玉英\t40141\t教育处 (供应商)/教育处 (三重一大)\t供应商管理岗,三重一大管理岗\t是 孙湛\t10666\t医务处 (三重一大)/医务处 (基础功能)\t供应商管理岗,三重一大管理岗,信访登记管理岗\t是 魏宁\t20314\t人事处 (三重一大)\t供应商管理岗,三重一大管理岗\t是 张群仁\t40088\t总务处 (供应商)/总务处 (基础功能)\t供应商管理岗,三重一大管理岗,一般员工\t是 姜红\t12357\t科研处 (供应商)/科研处 (三重一大)/科研处 (基础功能)\t供应商管理岗,三重一大管理岗,一般员工\t是 陈刚\t30166\t设备科 (三重一大)/设备科 (供应商)/设备科 (基础功能)\t供应商管理岗,三重一大管理岗,一般员工\t是 阴忆青\t12016\t计算机网络中心 (供应商)/计算机网络中心 (三重一大)\t供应商管理岗,三重一大管理岗\t是 段静雯\t40209\t财务处 (供应商)/财务处 (三重一大)/财务处 (基础功能)\t供应商管理岗,三重一大管理岗,一般员工\t是 汪红\t30545\t药剂科 (供应商)\t供应商管理岗\t是 沈辉\t10582\t书记室 (三重一大)\t三重一大审核岗\t是 牛伟新\t10523\t书记室 (三重一大)\t三重一大审核岗\t是 秦新裕\t10186\t书记室 (三重一大)\t三重一大审核岗\t是 缪瑾\t40107\t设备科 (三重一大)/设备科 (供应商)/设备科 (基础功能)\t供应商管理岗,三重一大管理岗,一般员工\t是 秦净\t10458\t院长室 (三重一大)\t三重一大审核岗\t是 阎作勤\t10799\t院长室 (三重一大)\t三重一大审核岗\t是 朱同玉\t10723\t院长室 (三重一大)\t三重一大审核岗\t是 汪昕\t10531\t院长室 (三重一大)\t三重一大审核岗\t是 高鑫\t10362\t院长室 (三重一大)\t三重一大审核岗\t是 张志勇\t10772\t院长室 (三重一大)\t三重一大审核岗\t是 樊嘉\t10774\t院长室 (三重一大)\t三重一大审核岗\t是 丁昉\t12057\t医务二处 (三重一大)/医务二处 (供应商)\t三重一大管理岗,供应商管理岗\t是 秦嗣萃\t20288\t工会 (三重一大)/工会 (基础功能)\t三重一大管理岗,信访登记管理岗\t是 李锋\t10509\t门急诊部 (三重一大)/门急诊部 (基础功能)\t三重一大管理岗,信访登记管理岗\t是 郭莺\t40230\t医疗保险办公室 (三重一大)\t三重一大管理岗\t是 王戈红\t40075\t财务处 (三重一大)/财务处 (基础功能)/总会计师 (基础功能)\t三重一大管理岗,一般员工\t是 郭大乔\t10485\t一般员工\t是 韦龙彪\t50223\t一般员工\t是 代世摩\t12664\t一般员工\t是 丁博闻\t55351\t一般员工\t是 颜红梅\t12428\t一般员工\t是 黄晏平\t30695\t一般员工\t是 吴静峰\t30987\t一般员工\t是 王倩如\t21807\t一般员工\t是 程蕾蕾\t12071\t一般员工\t是 刘邦忠\t10493\t一般员工\t是 杨位霞\t661576\t一般员工\t是 张英\t20646\t一般员工\t是 夏庆\t10427\t一般员工\t是 刘嵘\t12263\t一般员工\t是 陈淑靖\t12672\t一般员工\t是 杨为戈\t12308\t一般员工\t是 仓静\t10495\t一般员工\t是 张弛\t10699\t一般员工\t是 杨成\t12255\t一般员工\t是 朱延军\t12320\t一般员工\t是 张冬菊\t8140200\t一般员工\t是 胡敏悦\t21761\t一般员工\t是 吴群\t50304\t总务处 (供应商)/总务处 (基础功能)\t供应商管理岗,一般员工\t是 郦梦南\t40291\t供应商管理岗\t是 王灏\t30165\t物流中心 (供应商)/物流中心 (基础功能)\t供应商管理岗,一般员工\t是 孙剑勇\t10542\t一般员工\t是 袁俊\t40212\t监察审计室 (三重一大)/监察审计室 (基础功能)/科研处 (基础功能)\t供应商超级管理员,三重一大审核岗,信访登记管理岗,一般员工\t是 邱网妹\t40179\t保卫处 (供应商)/保卫处 (保卫处)\t供应商管理岗,保卫处监控岗\t是 李雪宁\t30540\t药物临床试验机构 (供应商)/伦理委员会 (基础功能)\t供应商管理岗,一般员工\t是 王明亮\t12811\t一般员工\t是 吕迁洲\t31510\t药剂科 (供应商)/药剂科 (基础功能)\t供应商管理岗,一般员工\t是 顾建英\t10672\t院长办公室 (三重一大)\t三重一大审核岗\t是 李耘\t40172\t党委办公室 (三重一大)/党委办公室 (基础功能)/院长办公室 (三重一大)\t三重一大审核岗,信访登记管理岗,三重一大管理岗\t是 统一用户Admin(非统一用户)\t1\t供应商超级管理员,三重一大审核岗\t是 Admin(非统一用户)\t999991\t供应商超级管理员\t是\n这里我写了一个脚本来匹配出员工登录号码\n<?php/*  * To change this license header, choose License Headers in Project Properties. * To change this template file, choose Tools | Templates * and open the template in the editor. */$content = file_get_contents('test1.txt');$preg = \"/\\d*/im\";preg_match_all($preg, $content, $arr);//echo \"<pre>\";//print_r($arr);foreach($arr as $value){    if(is_array($value)){        foreach($value as $v){            if($v!==''){                $v = $v.\"\\n\";                file_put_contents(\"test.txt\", $v, FILE_APPEND);            }        }    }}\n脚本写的复杂了，正则改为$preg = \"/\\d+/im\";这样会简单不好，只要能用就行放到burp里面爆破 密码设置为 123456爆破出358个密码为123456的用户\n12506\t120287\t155543\t112253\t131600\t130547\t130577\t110752\t120542\t155357\t160910139\t131603\t121987\t155572\t140198\t150338\t155360\t112727\t110798\t112319\t110533\t112302\t110444\t112207\t140261\t112397\t112533\t120864\t122116\t121549\t112818\t112148\t112914\t112409\t112842\t120667\t110704\t112843\t112690\t121161\t112596\t112292\t121922\t112434\t121943\t155513\t112562\t112726\t110559\t121743\t112753\t121207\t155546\t121336\t155587\t140228\t140279\t112343\t112420\t121900\t155553\t121503\t121889\t121842\t121872\t121837\t155541\t121953\t110514\t112582\t121401\t155412\t155602\t110553\t175182\t121210\t112196\t112198\t112415\t110332\t112551\t155568\t110008\t112296\t112496\t110474\t112322\t112446\t110502\t110949\t112276\t110576\t112035\t120469\t121957\t130179\t120750\t120617\t120648\t112325\t155509\t110611\t130543\t112862\t155551\t120730\t122070\t121399\t120772\t120416\t121878\t112758\t112315\t18130397\t110728\t120584\t155371\t150298\t155537\t122001\t160810044\t112225\t112238\t155597\t161016003\t160910177\t122151\t160910181\t155538\t155227\t130244\t112822\t155353\t122052\t155521\t130994\t112311\t112677\t110513\t112871\t150001645\t121570\t160910161\t161010197\t160910123\t155285\t140178\t112197\t122095\t121959\t120657\t18140063\t18140062\t18140061\t120641\t120358\t155585\t131543\t121049\t150343\t112869\t112500\t122065\t120574\t155506\t121674\t122083\t112425\t110554\t110501\t121359\t110417\t110290\t110431\t121654\t140311\t112576\t159995\t110625\t155593\t121536\t155362\t112081\t155287\t112882\t112316\t121969\t155435\t121822\t155296\t120729\t112380\t120718\t120694\t112134\t122069\t110665\t130568\t122041\t155255\t112802\t110522\t120396\t112009\t112191\t121858\t155548\t112304\t122119\t130197\t120831\t121934\t121087\t155591\t122111\t121059\t112362\t110662\t112375\t112700\t120295\t120673\t110607\t122074\t155233\t110644\t122135\t155482\t112251\t110477\t120600\t112335\t122153\t112579\t112512\t112462\t110966\t155478\t112880\t121769\t155341\t155578\t112483\t112323\t140290\t110635\t112907\t1660035\t110649\t159989\t112418\t155431\t112058\t112804\t122121\t110710\t155596\t120266\t110557\t110732\t155481\t155598\t112052\t112274\t112646\t155460\t155477\t112004\t120960\t130946\t121472\t122109\t122084\t130978\t120825\t120331\t112114\t155475\t155556\t121112\t159999\t155595\t120595\t121001\t130774\t131007\t110292\t121802\t112705\t155499\t122114\t110784\t155474\t150135\t155348\t112053\t112033\t155519\t110415\t112005\t155284\t112272\t155488\t110388\t120627\t121896\t110445\t121798\t155520\t112611\t120490\t155301\t112345\t155168\t155545\t159991\t120721\t131041\t112221\t130970\t140220\t112602\t155405\t110684\t112471\t110355\t155303\t120830\t112525\t120995\t121741\t121064\t140088\t112016\t140107\t110723\t110531\t110362\t140075\t150223\t112664\t130695\t130987\t121807\t1661576\t110427\t112263\t112672\t112308\t110495\t112320\t18140200\t121761\t150304\t140291\t130165\t140179\t11\t1\n里面有大部分账号可以登录其他管理系统，危害还是很大的。# 信息收集https://oa.zs-hospital.sh.cn/DocManagement/Login.aspx  复旦大学中山医院文档资料管理系统\n\n   漏洞证明：  破解出的账号 \n\n   修复方案：  改密码，所有系统不要使用类似123456这样的弱口令   版权声明：转载请注明来源 depycode@乌云\n ", "wybug_reply": "漏洞回应  厂商回应： 危害等级：高 漏洞Rank：12  确认时间：2014-11-21 16:15 厂商回复：   最新状态： 暂无  ", "replys": "漏洞评价：\n评论\n     2014-11-18 13:43 |    \t\t茜茜公主 \t\t\t( 普通白帽子  |\t\t\t        Rank:2360 漏洞数:406        | 家里二宝出生，这几个月忙着把屎把尿...忒...)\t\t \n  什么地区的中山医院哈，好想看    \n     2014-11-18 14:49 |    \t\tLeon \t\t\t( 路人 |\t\t\t        Rank:25 漏洞数:6        | 永无宁日啊)\t\t \n  目测上海交大附属中山医院    \n     2014-11-18 15:22 |    \t\tpx1624 \t\t\t( 普通白帽子  |\t\t\t        Rank:1036 漏洞数:175        | px1624)\t\t \n  好叼。。    \n  \n\n\n", "wybug_level_fromcorp": "高", "wybug_rank_fromcorp": 12, "Ranks": null}