{"id": 3257, "wybug_id": "wooyun-2014-060752", "wybug_title": "中国联通某站后台弱口令", "wybug_corp": "中国联通", "wybug_author": "刘海哥", "wybug_date": "2014-05-14 22:12", "wybug_open_date": "2014-06-28 22:13", "wybug_type": "后台弱口令", "wybug_level": "高", "wybug_rank_0": "20", "wybug_status": "已交由第三方合作机构(cncert国家互联网应急中心)处理", "wybug_from": "http://www.wooyun.org", "wybug_tags": ["弱口令", "后台管理地址对外"], "wybug_detail": "漏洞详情 披露状态：   \t\t\t\t\t\t\t\t\t2014-05-14：\t细节已通知厂商并且等待厂商处理中\t\t\t\t\t\t\t\t\t2014-05-17：\t厂商已经确认，细节仅向厂商公开\t\t\t\t\t\t\t\t\t2014-05-27：\t细节向核心白帽子及相关领域专家公开\t\t\t\t\t\t\t\t\t2014-06-06：\t细节向普通白帽子公开\t\t\t\t\t\t\t\t\t2014-06-16：\t细节向实习白帽子公开\t\t\t\t\t\t\t\t\t2014-06-28：\t细节向公众公开  简要描述： 由于手抖进入的！能怪我？！ 详细说明：  我就不详细说了直接上图片可好！http://m.17wo.cn/smctest 密码test123\n\n   漏洞证明：  \n\n   修复方案：  求礼物！   版权声明：转载请注明来源 刘海哥@乌云\n ", "wybug_reply": "漏洞回应  厂商回应： 危害等级：中 漏洞Rank：8  确认时间：2014-05-17 20:28 厂商回复： CNVD确认并复现所述情况，已经转由CNCERT协调中国联合网络通信集团有限公司通报处置。 最新状态： 暂无  ", "replys": "漏洞评价：\n评论\n     2014-05-15 09:18 |    \t\tDebug0man \t\t\t( 路人 |\t\t\t        Rank:8 漏洞数:1        | 叽叽呗呗...)\t\t \n  手抖...好经典的借口.    \n     2014-05-15 09:42 |    \t\t刘海哥 \t\t\t( 普通白帽子  |\t\t\t        Rank:114 漏洞数:28        | 索要联系方式但不送礼物的厂商定义为无良厂...)\t\t \n  @Debug0man 经常手抖没办法，特别看到电脑的时候就手很抖。    \n     2014-05-17 23:39 |    \t\t麻花藤 \t\t\t( 路人 |\t\t\t        Rank:15 漏洞数:1        | ด้้้้้็็็็็้้้้้็็็็...)\t\t \n  这些电信运营商都是搞网络的，应该注重安全的，怎么老爆弱口令呢 ด้้้้้็็็็็้้้้้็็็็็้้้้้้้้็็็็็้้้้้็็็็็้้้้้้้้็็็็็้้้้้็็็็็้้้้้้ด้้้้้็็็็็้้้้้็็็็็้้้้้้้้็็็็็้้้้้็็็็็้้้้้้้้็็็็็้้้้้็็็็็้้้้้้ด้้้้้็็็็็้้้้้็็็็็้้้้้้้้็็็็็้้้้้็็็็ ด้้้้้็็็็็้้้้้็็็็็้้้้้้้้็็็็็้้้้้็็็็็้้้้้้้้็็็็็้้้้้็็็็็้้้้้้ด้้้้้็็็็็้้้้้็็็็็้้้้้้้้็็็็็้้้้้็็็็็้้้้้้้้็็็็็้้้้้็็็็็้้้้้้ด้้้้้็็็็็้้้้้็็็็็้้้้้้้้็็็็็้้้้้็็็็ ด้้้้้็็็็็้้้้้็็็็็้้้้้้้้็็็็็้้้้้็็็็็้้้้้้้้็็็็็้้้้้็็็็็้้้้้้ด้้้้้็็็็็้้้้้็็็็็้้้้้้้้็็็็็้้้้้็็็็็้้้้้้้้็็็็็้้้้้็็็็็้้้้้้ด้้้้้็็็็็้้้้้็็็็็้้้้้้้้็็็็็้้้้้็็็็ ด้้้้้็็็็็้้้้้็็็็็้้้้้้้้็็็็็้้้้้็็็็็้้้้้้้้็็็็็้้้้้็็็็็้้้้้้ด้้้้้็็็็็้้้้้็็็็็้้้้้้้้็็็็็้้้้้็็็็็้้้้้้้้็็็็็้้้้้็็็็็้้้้้้ด้้้้้็็็็็้้้้้็็็็็้้้้้้้้็็็็็้้้้้็็็็ ด้้้้้็็็็็้้้้้็็็็็้้้้้้้้็็็็็้้้้้็็็็็้้้้้้้้็็็็็้้้้้็็็็็้้้้้้ด้้้้้็็็็็้้้้้็็็็็้้้้้้้้็็็็็้้้้้็็็็็้้้้้้้้็็็็็้้้้้็็็็็้้้้้้ด้้้้้็็็็็้้้้้็็็็็้้้้้้้้็็็็็้้้้้็็็็ ด้้้้้็็็็็้้้้้็็็็็้้้้้้้้็็็็็้้้้้็็็็็้้้้้้้้็็็็็้้้้้็็็็็้้้้้้ด้้้้้็็็็็้้้้้็็็็็้้้้้้้้็็็็็้้้้้็็็็็้้้้้้้้็็็็็้้้้้็็็็็้้้้้้ด้้้้้็็็็็้้้้้็็็็็้้้้้้้้็็็็็้้้้้็็็็ ด้้้้้็็็็็้้้้้็็็็็้้้้้้้้็็็็็้้้้้็็็็็้้้้้้้้็็็็็้้้้้็็็็็้้้้้้ด้้้้้็็็็็้้้้้็็็็็้้้้้้้้็็็็็้้้้้็็็็็้้้้้้้้็็็็็้้้้้็็็็็้้้้้้ด้้้้้็็็็็้้้้้็็็็็้้้้้้้้็็็็็้้้้้็็็็ ด้้้้้็็็็็้้้้้็็็็็้้้้้้้้็็็็็้้้้้็็็็็้้้้้้้้็็็็็้้้้้็็็็็้้้้้้ด้้้้้็็็็็้้้้้็็็็็้้้้้้้้็็็็็้้้้้็็็็็้้้้้้้้็็็็็้้้้้็็็็็้้้้้้ด้้้้้็็็็็้้้้้็็็็็้้้้้้้้็็็็็้้้้้็็็็    \n     2014-05-17 23:47 |    \t\t刘海哥 \t\t\t( 普通白帽子  |\t\t\t        Rank:114 漏洞数:28        | 索要联系方式但不送礼物的厂商定义为无良厂...)\t\t \n  @麻花藤 .    \n     2014-07-02 11:38 |    \t\t人生turning point \t\t\t( 路人 |\t\t\t        Rank:10 漏洞数:4        )\t\t \n  @麻花藤 系统太多，这是无法避免的    \n  \n\n\n", "wybug_level_fromcorp": "中", "wybug_rank_fromcorp": 8, "Ranks": null}