{"id": 77345, "wybug_id": "wooyun-2015-0162718", "wybug_title": "古井集团某系统远程代码执行漏洞导致服务器被入侵", "wybug_corp": "古井集团", "wybug_author": "路人甲", "wybug_date": "2015-12-26 22:50", "wybug_open_date": "2016-02-06 10:45", "wybug_type": "命令执行", "wybug_level": "高", "wybug_rank_0": "20", "wybug_status": "已交由第三方合作机构(cncert国家互联网应急中心)处理", "wybug_from": "http://www.wooyun.org", "wybug_tags": "", "wybug_detail": "漏洞详情 披露状态：   \t\t\t\t\t\t\t\t\t2015-12-26：\t细节已通知厂商并且等待厂商处理中\t\t\t\t\t\t\t\t\t2015-12-30：\t厂商已经确认，细节仅向厂商公开\t\t\t\t\t\t\t\t\t2016-01-09：\t细节向核心白帽子及相关领域专家公开\t\t\t\t\t\t\t\t\t2016-01-19：\t细节向普通白帽子公开\t\t\t\t\t\t\t\t\t2016-01-29：\t细节向实习白帽子公开\t\t\t\t\t\t\t\t\t2016-02-06：\t细节向公众公开  简要描述： RT 详细说明：  古井集团是中国老八大名酒企业，是中国第一家同时发行A、B两支股票的白酒类上市公司安徽古井贡酒股份有限公司的母公司，坐落在历史名人曹操与华佗故里――安徽省亳州市。公司的前身为起源于明代正德十年（公元1515年）的公兴槽坊，1959年转制为省营亳县古井酒厂，1992年集团公司成立，1996年古井贡股票上市，2008年古井酒文化博览园成为中国白酒业第一家AAAA景区，2013年古井贡酒酿造遗址荣列全国重点文物单位。古井集团秉承“做真人，酿美酒，善其身，济天下”的核心价值观，目前拥有正式员工10000多名，是国家大型一档企业，致力于打造以白酒主业为核心的“制造业平台”，以地产、商旅、农产品深加工为主的“实业平台”，以金融集团为主的“金融平台”和以酒文化、酒生态、酒产业、酒旅游为核心的“文旅平台”。2015年9月，在“华樽杯”第七届中国酒类品牌价值评议活动中，“古井贡”以375.55亿元的品牌价值位列安徽省酒企第一名，中国白酒第五名，成为中国浓香型白酒的杰出代表。古井贡酒是集团的主导产品，其渊源始于公元196年曹操将家乡亳州产的“九酝春酒”和酿造方法进献给汉献帝刘协，自此一直作为皇室贡品；曹操也被史学界命名为古井贡“酒神”；古井贡酒以“色清如水晶、香纯似幽兰、入口甘美醇和、回味经久不息”的独特风格，四次蝉联全国白酒评比金奖，是巴黎第十三届国际食品博览会上唯一获金奖的中国名酒，先后获得中国驰名商标、中国地理标志产品、国家重点文物保护单位、国家非物质文化遗产保护项目、安徽省政府质量奖、全国质量标杆等荣誉，被世人誉为“酒中牡丹”、“中华第一贡”。目前公司主打产品古井贡酒“年份原浆”，以“桃花曲、无极水、九酝酒法、明代窖池”的优良品质，先后成为“上海世博会安徽馆战略合作伙伴唯一指定用酒、2010中国—东盟博览会合作伙伴唯一指定用酒、2012年韩国丽水世博会中国馆“全球合作伙伴”、2015年米兰世博会中国馆专用高档白酒”，并于2011-2013年度连续三年总冠名CCTV“感动中国”人物评选活动。安徽古井贡酒股份有限公司多年来一直位列中国白酒企业前十强。2008年10月，古井酒文化博览园被国家旅游局批准为AAAA级旅游景区，这也是中国白酒业第一家AAAA景区；2013年5月，古井贡酒酿造遗址荣登“国保”，在中国白酒行业首屈一指，国家级文物最多、体量最大、历史最为悠久；2014年1月和12月，古井贡全球巡礼活动分别走进美国和法国，开启了中国白酒全球对话的新高度。商旅业以安徽瑞景商旅集团为主体，位居中国旅游饭店业前20强。其下属的合肥古井假日酒店是安徽省内第一家五星级酒店，委托国际著名酒店管理品牌洲际集团进行经营管理；上海古井假日酒店是四星级酒店，曾被评选为假日品牌在亚太区的样板酒店，现已成为安徽企业在上海的形象和窗口；亳州宾馆是亳州市首家五星级酒店，2011年成为“世界金钥匙酒店联盟”成员酒店。下属古井酒店管理公司管理着“城市之家”、“君莱”、“古井”三个酒店品牌，目前自营与托管的酒店已有七十多家，确立了省内龙头地位。古井“祥记”餐饮业近年来拓展较快。古井房地产集团多年来相继在亳州和合肥开发了丹华山庄、丰水源、百花大厦等一批经典项目，是古井未来发展的重要增长极。目前在建项目有瑞景嘉园、府南花园、古井城市广场和亳州西一环292亩“上善名郡”项目等。安徽瑞福祥食品有限公司是集食用酒精和无水酒精、DDGS饲料、胚芽粕饲料、小麦DDG、谷朊粉、面粉等产品为主的现代化粮食深加工企业，通过了ISO9001:2000质量管理体系认证，荣获“国家星火计划项目”，2011年荣膺“农业产业化国家级重点龙头企业”，并荣获“安徽省质量奖”，2013年成为中国小麦粉加工50强和国家高新技术企业。2014年再次荣膺“农业产业化国家重点龙头企业”，并被国家科技部认定为“国家火炬计划重点高新技术企业”。瑞能热电公司是亳州市唯一一家热电联产企业，主要用于城市供热职能，2011年实现了并网发电，2013年实现扭亏为盈，2014年外部市场建设取得成效。类金融业包括近年来陆续成立的典当公司、小额贷款公司、融资租赁公司等。 2014年，成立亳州市首家金融控股平台安徽汇信金融投资（集团）有限责任公司，集众信租赁、安信小贷、恒信典当、瑞信典当、友信担保、力信电商等为一体。目前经营发展稳健，产融互动效果初显。中华酒谷，是古井文旅平台的经营定位。它以大中原酒谷文化旅游开发有限公司为主体，规划建设古井质量科技园、酒神广场、张集生态酿造基地、古井贡酒酿造遗址公园、古井乐土家园，精心打造中国白酒博物馆、中国白酒科普馆、中国白酒艺术馆，落地中原乡土文化，弘扬中国酒文化，发展体验式消费和快乐游购服务。目前各项建设稳步推进。2010年以来，古井集团大力推进跨越式发展战略，各项经营指标连创历史最好水平。公司的发展规划是2017年实现营业收入100亿元，重新回到中国白酒第一方阵。2014年，古井集团实现营业收入60.75亿元，同比增长9%，上缴税收18.08亿元，同比增长12%，总资产达到111.82亿元。http://**.**.**.**:7001/defaultroot/login.jsp\n\n   漏洞证明：  \n\n   修复方案：     版权声明：转载请注明来源 路人甲@乌云\n ", "wybug_reply": "漏洞回应  厂商回应： 危害等级：中 漏洞Rank：10  确认时间：2015-12-30 18:44 厂商回复： CNVD未直接复现所述情况，暂未建立与网站管理单位的直接处置渠道，待认领。 最新状态： 暂无  ", "replys": "漏洞评价：\n评价\n  \n\n\n", "wybug_level_fromcorp": "中", "wybug_rank_fromcorp": 10, "Ranks": null}