{"id": 87042, "wybug_id": "wooyun-2016-0192967", "wybug_title": "某漏洞导致全国各省市服务热线系统沦陷（影响政府/金融/教育/新闻/媒体/保险/电视台机构）", "wybug_corp": "cncert国家互联网应急中心", "wybug_author": "Aasron", "wybug_date": "2016-04-06 14:20", "wybug_open_date": "2016-05-23 11:30", "wybug_type": "SQL注射漏洞", "wybug_level": "高", "wybug_rank_0": "20", "wybug_status": "已交由第三方合作机构(cncert国家互联网应急中心)处理", "wybug_from": "http://www.wooyun.org", "wybug_tags": ["通用漏洞", "资料大量泄漏"], "wybug_detail": "漏洞详情 披露状态：   \t\t\t\t\t\t\t\t\t2016-04-06：\t细节已通知厂商并且等待厂商处理中\t\t\t\t\t\t\t\t\t2016-04-08：\t厂商已经确认，细节仅向厂商公开\t\t\t\t\t\t\t\t\t2016-04-18：\t细节向核心白帽子及相关领域专家公开\t\t\t\t\t\t\t\t\t2016-04-28：\t细节向普通白帽子公开\t\t\t\t\t\t\t\t\t2016-05-08：\t细节向实习白帽子公开\t\t\t\t\t\t\t\t\t2016-05-23：\t细节向公众公开  简要描述： 这个漏洞影响包括的机构名单大致如下中国各省市银行，中国各省市政府机构，教育机构，新闻媒体，保险，电视台（写这个挺雷的，求个精华和刀） 详细说明：  #1 前言市面上大概能利用的搜索引擎也就是sodan，baidu,google这几个，当然还有一些引擎，就不一一列举了，对于sodan引擎，我一直比较喜欢，因为搜索引擎里面他对与公网设备的检索比较厉害，原因在于它是以截获端口以及一些通信。关键在于你如何利用搜索引擎。#2 第三方应用这个第三方应用，我也不知道叫什么名字...不过是通用的，这是可以肯定的。例举几个市的系统界面\n\n\n\n\n\n\n\n\n\n这里系统能做的事情还真不小，我这里有个简单的统计及分析\n自动短信反馈自动电话反馈自动邮件发反馈自动网站反馈\n\n双屏支撑 \t同步来电历史信息查询 \t政策法规查询政策法规查询 \t常用电话查询即时消息系统 \t公告发布系统\n\n科学的统计分类体系智能化统计报表系统丰富的、完善的报表体系\n这是他的基本所有功能，还是比较强大的，当然使用量也是相当大的，全国各省市都是这套系统涵盖（政府机构/金融机构/媒体机构/教育机构）#3 漏洞是什么？漏洞很简单，没想象的那么厉害，不过就这漏洞，就可以让全国的这套系统报废了\nPOST /index.aspx/personfindname HTTP/1.1Content-Type: application/jsonContent-Length: 56X-Requested-With: XMLHttpRequestReferer: **.**.**.**:443/Cookie: ASP.NET_SessionId=nvs1dcfgvmewncfmxmfczw55Host: **.**.**.**Connection: Keep-aliveAccept-Encoding: gzip,deflateUser-Agent: Mozilla/5.0 (Windows NT 6.1; WOW64) AppleWebKit/537.21 (KHTML, like Gecko) Chrome/41.0.2228.0 Safari/537.21Accept: */*{\"PersonAccount\":\"-1 \"}\n\n注入参数#PersonAccount\n这里存在一个SQL盲注，但是前期发现有简单的过滤，使用\nspace2comment\n脚本能绕过\n\n\n\n\n\n使用这套系统的机构，并且每个市，每个机构各有一个单独的帐号\n\n\n\n\n\n\n\n\n\n\n\n每个地市的机构管理员有细微差别，但大致都是这些\n\n\n当前数据库：DSLX_CC_BD961890\n每个表大概都是几千条数据\n\n证明一下危害就好，不深入。\n\n估计拿到密码，里面简直就是另一片天地了，进入各个机构发布假公告，这危害就大了   漏洞证明：  具体影响机构名单：\n保定市长热线\t\t保定市长热线\t展开 话务中心\t\t话务中心\t展开 话务管理\t\t话务管理\t展开 办公室\t\t办公室\t展开 综合管理\t\t综合管理\t\t\t保定市长热线管理员 各区(县)人民政府\t\t各区(县)人民政府\t莲池区政府北片\t\t莲池区政府北片\t莲池区政府南片\t\t莲池区政府南片\t竞秀区政府\t\t竞秀区政府\t高新区管委会\t\t高新区管委会\t白沟新城管委会\t\t白沟新城管委会\t徐水区政府\t\t徐水区政府\t清苑区政府\t\t清苑区政府\t满城区政府\t\t满城区政府\t涿州市政府\t\t涿州市政府\t安国市政府\t\t安国市政府\t高碑店市政府\t\t高碑店市政府\t易县政府\t\t易县政府\t涞源县政府\t\t涞源县政府\t定兴县政府\t\t定兴县政府\t顺平县政府\t\t顺平县政府\t唐县政府\t\t唐县政府\t望都县政府\t\t望都县政府\t涞水县政府\t\t涞水县政府\t高阳县政府\t\t高阳县政府\t安新县政府\t\t安新县政府\t雄县政府\t\t雄县政府\t容城县政府\t\t容城县政府\t曲阳县政府\t\t曲阳县政府\t阜平县政府\t\t阜平县政府\t博野县政府\t\t博野县政府\t蠡县政府\t\t蠡县政府\t河北涿州新兴产业示范区\t\t河北涿州新兴产业示范区 市政府各个部门\t\t市政府各个部门\t市发展和改革委员会\t\t市发展和改革委员会\t市教育局\t\t市教育局\t市科学技术局\t\t市科学技术局\t市工业和信息化局\t\t市工业和信息化局\t市民族宗教事务局\t\t市民族宗教事务局\t市公安局\t\t市公安局\t市监察局\t\t市监察局\t市民政局\t\t市民政局\t市司法局\t\t市司法局\t市财政局\t\t市财政局\t市人力资源和社会保障局\t\t市人力资源和社会保障局\t市国土资源局\t\t市国土资源局\t市环境保护局\t\t市环境保护局\t市城乡规划管理局\t\t市城乡规划管理局\t市住房和城乡建设局\t\t市住房和城乡建设局\t市城市管理行政执法局\t\t市城市管理行政执法局\t市交通运输局\t\t市交通运输局\t市水利局\t\t市水利局\t市农业局\t\t市农业局\t市林业局\t\t市林业局\t市商务局\t\t市商务局\t市文化广电新闻出版局\t\t市文化广电新闻出版局\t市卫生局\t\t市卫生局\t市体育局\t\t市体育局\t市人口和计划生育委员会\t\t市人口和计划生育委员会\t市政府研究室\t\t市政府研究室\t市政府外事办公室\t\t市政府外事办公室\t市审计局\t\t市审计局\t市国有资产监督管理委员会\t\t市国有资产监督管理委员会\t市安全生产监督管理局\t\t市安全生产监督管理局\t市统计局\t\t市统计局\t市粮食局\t\t市粮食局\t市政府法制办公室\t\t市政府法制办公室\t市人民防空办公室\t\t市人民防空办公室\t市质量技术监督局\t\t市质量技术监督局\t市国税局\t\t市国税局\t市保定海关\t\t市保定海关\t市保定检验检疫局\t\t市保定检验检疫局\t市公用事业局\t\t市公用事业局\t市邮政局\t\t市邮政局\t市无线电管理局\t\t市无线电管理局\t市工商局\t\t市工商局\t市教育考试院\t\t市教育考试院\t市地税局\t\t市地税局\t市供热办\t\t市供热办\t市物价局\t\t市物价局\t市住房公积金管理中心\t\t市住房公积金管理中心\t市市场建设管理办公室\t\t市市场建设管理办公室\t市信访局\t\t市信访局\t市旅游局\t\t市旅游局\t市南水北调办公室\t\t市南水北调办公室\t市扶贫开发办公室\t\t市扶贫开发办公室\t市气象局\t\t市气象局\t市供销社\t\t市供销社\t市档案局\t\t市档案局\t市园林局\t\t市园林局\t市烟草专卖局\t\t市烟草专卖局\t市总工会\t\t市总工会\t市团市委\t\t市团市委\t市地震局\t\t市地震局\t市文物局\t\t市文物局\t食品药品监督管理局\t\t食品药品监督管理局\t市银监分局\t\t市银监分局\t市畜牧水产局\t\t市畜牧水产局\t市场监督管理局\t\t市场监督管理局\t市邮政管理局\t\t市邮政管理局 各个窗口单位\t\t各个窗口单位\t供电总公司\t\t供电总公司\t移动公司\t\t移动公司\t电信公司\t\t电信公司\t联通公司\t\t联通公司\t保运集团\t\t保运集团\t公交公司\t\t公交公司\t火车站\t\t火车站\t广播电视台\t\t广播电视台\t石油公司\t\t石油公司\t人行\t\t人行\t中国银行\t\t中国银行\t行政服务中心\t\t行政服务中心\t规划设计院\t\t规划设计院\t建筑设计院\t\t建筑设计院\t河北广电网络集团保定有限公司\t\t河北广电网络集团保定有限公司 群众团体\t\t群众团体\t妇联\t\t妇联\t科协\t\t科协\t文联\t\t文联\t侨联\t\t侨联\t工商联\t\t工商联\t社科联\t\t社科联\t残联\t\t残联\t计生协\t\t计生协 金融系统\t\t金融系统\t工商银行\t\t工商银行\t农业银行\t\t农业银行\t农业发展银行\t\t农业发展银行\t中信银行\t\t中信银行\t华夏银行\t\t华夏银行\t建设银行\t\t建设银行\t保定银行\t\t保定银行\t省农村信用联社保定办事处\t\t省农村信用联社保定办事处\t人保财险公司\t\t人保财险公司\t人寿保险公司\t\t人寿保险公司\t太平洋保险公司\t\t太平洋保险公司\t太平洋人寿保险公司\t\t太平洋人寿保险公司\t人保寿险公司\t\t人保寿险公司 新闻单位\t\t新闻单位\t保定报社\t\t保定报社\t河北日报驻保记者站\t\t河北日报驻保记者站\t河北经济日报驻保记者站\t\t河北经济日报驻保记者站\t燕赵都市报驻保记者站\t\t燕赵都市报驻保记者站\t河北电视台驻保记者站\t\t河北电视台驻保记者站\t河北人民广播电台驻保记者站\t\t河北人民广播电台驻保记者站\t测试单位001\t\t测试单位001\n几个案例，太多市了，复制粘贴都操作不过来\n**.**.**.**/  邯郸市**.**.**.**/    衡水市**.**.**.**/   保定市**.**.**.**/   秦皇岛市**.**.**.**/ 定州市**.**.**.**/  承德市\n   修复方案：  过滤，转义   版权声明：转载请注明来源 Aasron@乌云\n ", "wybug_reply": "漏洞回应  厂商回应： 危害等级：高 漏洞Rank：14  确认时间：2016-04-08 11:26 厂商回复： CNVD确认并复现所述情况，已由CNVD通过软件生产厂商公开联系渠道向其邮件通报，由其后续提供解决方案并协调相关用户单位处置。 最新状态： 暂无  ", "replys": "漏洞评价：\n评价\n     2016-04-06 16:46 |    \t\t小红猪 \t\t\t( 普通白帽子  |\t\t\t        Rank:322 漏洞数:58        | little red pig!)\t\t \n  不明觉厉    \n     2016-05-23 11:45 |    \t\tTon7BrEak \t\t\t( 普通白帽子  |\t\t\t        Rank:306 漏洞数:67        | 我要继续努力！)\t\t \n  可是 sodan 你都拼错了··不过漏洞还是很牛逼的！攒一个~    \n  \n\n\n", "wybug_level_fromcorp": "高", "wybug_rank_fromcorp": 14, "Ranks": null}