{"id": 735, "wybug_id": "wooyun-2014-076060", "wybug_title": "淘宝购物信息泄漏导致的诈骗实例（受害者被骗一万元）", "wybug_corp": "支付宝", "wybug_author": "路人甲", "wybug_date": "2014-10-07 21:14", "wybug_open_date": "2014-10-13 09:42", "wybug_type": "钓鱼欺诈信息", "wybug_level": "中", "wybug_rank_0": "5", "wybug_status": "漏洞已经通知厂商但是厂商忽略漏洞", "wybug_from": "http://www.wooyun.org", "wybug_tags": ["淘宝购物"], "wybug_detail": "漏洞详情 披露状态：   \t\t\t\t\t\t\t\t\t2014-10-07：\t细节已通知厂商并且等待厂商处理中\t\t\t\t\t\t\t\t\t2014-10-13：\t厂商已经主动忽略漏洞，细节向公众公开  简要描述： 订单信息泄露  +  电话欺骗 + 钓鱼 + 360浏览器没提示 + 然后被骗1W。各个方面投诉一直未能得到解决。 详细说明：     淘宝网作为中国最大的电商平台，每天成就无数买卖，但同时也存在巨大的网络诈骗风险。   我从未在淘宝网进行过任何交易，一则是我没有什么购物需求，日常用品在超市购买也感觉不到比网络贵多少；二则是担心网络支付的安全性。但我妻子却不定期的在网上购物。她在淘宝网上注册了“豆XXXy”用户名，设置相应的密码，同时将我的银行信用卡绑定到该用户名上。  我妻子在淘宝网上进行了若干次的网上购物。虽然从媒体上了解相关网络诈骗的新闻，可总感觉这些事情不会发生在自己身上。但2014年9月5日，不幸降临到的我们身上。2014年9月5日下午15点30分左右，她在淘宝网上浏览到位于江苏南通的百丝思家家纺专柜有产品促销。如图1，她选中了价格为39.33元的床单被套三件套。\n\n图1 选择价格为39.33元的床单被套三件套如图2，生成订单并提交。\n\n图2 生成订单并提交如图3，支付宝关联的是我招商银行尾号1962的信用卡。\n\n图3 支付宝关联的是我招商银行尾号1962的信用卡如图4，订单信息。从中可以看出，成交时间是2014-09-05日的15:38分。\n\n图4 订单信息   订单成交后，噩梦开始：   2014-09-05日，下午17:00左右，我妻子王欣139的手机接到来自浙江杭州的手机号为18257111901第一个骗子的电话：“你是聂XXXX吗？你在淘宝上购买百丝思家家纺的订单出问题了，我们将取消该订单并将你支付的款项退回到你的银行卡上”。   我妻子王欣因有事便忽略了该电话。   晚饭后，约19:30分左右，我妻子王欣139的手机再次接到来自浙江杭州的手机号为15906621294第二个骗子的电话：“你是聂XXXX吗？你在淘宝上购买百丝思家家纺的订单出问题了，我们将取消该订单并将你支付的款项退回到你的银行卡上”。此时，我妻子王欣心里未免有些紧张，对方既然知道她下的订单，又知道买了家纺，而且知道关联的银行卡是我聂XXXX的姓名，也就没有多想，把骗子当成了淘宝工作人员。手机号为15906621294第二个骗子建议我妻子王欣利用QQ联系。如图5在QQ上与对方联系起来。   我那天真善良的妻子，在骗子的诱导中便进入了http://tui8980-.rygit.com的钓鱼网站，如图6。\n\n图5 在QQ上与对方联系\n\n图6 冒充淘宝的钓鱼网站   大家看看，这个钓鱼网站是不是很像淘宝。冲着对淘宝的信任，我的妻子王欣上钩了。点击图6网页中的“开始操作”，进入到如图7的页面。骗子此时通过手机对我妻子进行电话指导，说需要进行银行账户验证。如图8，选择银行。\n\n图7 登录验证账户\n\n图8 选择银行   选择银行后，进入图9，骗子开始套取银行卡信息，并开始转账。\n\n图9 套取银行卡信息并进行银行卡转账   此时，我妻子向我要招商银行信用卡及查询密码和支付密码。我怨恨我自己，我没有太关心我妻子在干什么。她向我要密码，我当然要给。此时我丧失了第一次自卫的机会。当验证码发送到我137的手机上时，我又丧失了阻断受骗的机会。我来到我妻子身边，把第一个验证码告诉了我妻子，并看看她在干什么？   当我看到图9的画面时，一时间我还是没有反应过来。我怨恨我自己反应迟钝。当骗子说银行卡验证不成功需要第二个验证码的时候，我居然还帮忙把我137手机收到的验证码输入到图9的效验码栏中并按确认提交。我怨恨：“我是帮着骗子骗自己。”   紧接着我便收招商银行的8000元的支付信息，一下子我便惊醒了过来。这是诈骗！我立马利用固话拨打4008205555电话到招商银行信用卡中心进行确认。招行客服确认，已经有两笔支付已经发生，一笔8000元，一笔2000元，并建议我立即冻结账户。我同意立即冻结账户，但一股无名之火涌上心头。   我开始抱怨我妻子，通过淘宝买了一个40元不到的家纺，却被骗了一万元。我恨死了骗子，也恨死了淘宝。我承认我的无知导致我最终受骗，但我更相信这个骗子肯定不止骗我一家，你淘宝怎么就不立案调查呢？谁将对我的损失负责任？谁将对这些无辜受骗用户负责任？你淘宝就能洗得干净吗？   漏洞证明：     是谁知道我招商银行信用卡与我妻子的淘宝账号关联在一起呢？并知道我的姓名，还在两小时不到的时间内，知道我妻子有一笔购买家纺的订单呢？   我怀疑的对象就是淘宝的支付宝。我招商银行信用卡与我妻子淘宝账号的关联信息最清楚的就是你支付宝。而且我妻子的订单支付信息也是你支付宝最清楚。信息泄露你罪责难逃！   修复方案：  支付宝   版权声明：转载请注明来源 路人甲@乌云\n ", "wybug_reply": "漏洞回应  厂商回应： 危害等级：无影响厂商忽略 忽略时间：2014-10-13 09:42 厂商回复：  最新状态： 暂无  ", "replys": "漏洞评价：\n评论\n     2014-09-15 14:44 |    \t\t浩天  \t\t\t( 普通白帽子  |\t\t\t        Rank:915 漏洞数:79        | 度假中...)\t\t \n  这个多方面责任造成的案例，应该如何分担后果    \n     2014-09-16 16:05 |    \t\t革命往事 \t\t\t( 路人 |\t\t\t        Rank:17 漏洞数:2        | 革命已成往事)\t\t \n  卖家号被盗了吧，泄露订单信息。或者是卖家和骗子合谋。防不胜防啊，现在傻子太多骗子不够用。    \n     2014-09-16 16:19 |    \t\t革命往事 \t\t\t( 路人 |\t\t\t        Rank:17 漏洞数:2        | 革命已成往事)\t\t \n  还有，用QQ聊，不是用旺旺么。摆明了骗子。人傻钱多    \n     2014-09-17 22:06 |    \t\tsuperbing \t\t\t( 普通白帽子  |\t\t\t        Rank:174 漏洞数:29        | 常羡古时儿女怀，嘻戏千山好自在。)\t\t \n  聊天认准旺旺，货款 不论是任何操作都只走支付宝！估计只有马云能骗你！    \n     2014-10-13 10:10 |    \t\t咖啡 \t\t\t( 实习白帽子  |\t\t\t        Rank:48 漏洞数:20        )\t\t \n  主要责任还是在你们自己    \n     2014-10-13 10:27 |    \t\tchar \t\t\t( 路人 |\t\t\t        Rank:13 漏洞数:3        | 中国平安，不只保险这么简单。)\t\t \n  个人账户资金损失保险（个人名下所有银行卡、网银账户、第三方账户全保障！）http://www.4008000000.com/zaixiangoumai/baoxian/gerenzijinsunshibaoxian.shtml我只说这么多，中国平安，不只保险这么简单。    \n     2014-10-13 10:31 |    \t\t浮世浮城 \t\t\t( 普通白帽子  |\t\t\t        Rank:284 漏洞数:60        | 我存于这俗世烟火的浮世，我爱这时光倒影的...)\t\t \n  @char 机智的推销员    \n     2014-11-10 20:47 |    \t\twefgod \t\t\t( 普通白帽子  |\t\t\t        Rank:1807 漏洞数:179        | 力不从心)\t\t \n  支付宝似乎最近都是忽略？    \n  \n\n\n", "wybug_level_fromcorp": "无影响厂商忽略", "wybug_rank_fromcorp": 0, "Ranks": null}