{"id": 56023, "wybug_id": "wooyun-2014-059211", "wybug_title": "金山毒霸拒绝服务和授权绕过通用漏洞", "wybug_corp": "金山毒霸", "wybug_author": "abaddon", "wybug_date": "2014-05-04 14:23", "wybug_open_date": "2014-08-02 14:24", "wybug_type": "拒绝服务", "wybug_level": "中", "wybug_rank_0": "9", "wybug_status": "厂商已经确认", "wybug_from": "http://www.wooyun.org", "wybug_tags": ["客户端程序设计错误", "拒绝服务", "客户端安全", "权鉴绕过"], "wybug_detail": "漏洞详情 披露状态：   \t\t\t\t\t\t\t\t\t2014-05-04：\t细节已通知厂商并且等待厂商处理中\t\t\t\t\t\t\t\t\t2014-05-04：\t厂商已经确认，细节仅向厂商公开\t\t\t\t\t\t\t\t\t2014-05-07：\t细节向第三方安全合作伙伴开放\t\t\t\t\t\t\t\t\t2014-06-28：\t细节向核心白帽子及相关领域专家公开\t\t\t\t\t\t\t\t\t2014-07-08：\t细节向普通白帽子公开\t\t\t\t\t\t\t\t\t2014-07-18：\t细节向实习白帽子公开\t\t\t\t\t\t\t\t\t2014-08-02：\t细节向公众公开  简要描述： 漏洞描述：介于金山毒霸是国内最大的杀毒软件厂商，此异常信息影响范围可能极广，而企业版主要被应用于政府，企业和学校，危害程度应该大于新毒霸（悟空）。金山毒霸企业版由于设计逻辑错误退出密码形同虚设，可被利用发动拒绝服务攻击（目前仅限本地 因此没有报高危），拒绝服务后，可进一步卸载金山毒霸企业版，卸载密码形同虚设。两个漏洞和二唯一报送，以节省乌云资源。恶意用户可以此在内联网绕过杀毒软件散步病毒木马！恶意第三方竞争对手的单机版杀毒软件可进一步挖掘此问题来拒绝服务金山毒霸（此问题或许已经发生），使网络中心丧失对网络病毒感染情况的监控与控制。介于4月30日递交的报告被忽略，重新整理更为详尽的报告重新报送！ 详细说明：  -查看详情     漏洞描述： 金山毒霸企业版由于设计逻辑错误退出密码形同虚设，可悲利用发动拒绝服务攻击（目前仅限本地 因此没有报高危），拒绝服务后，可进一步卸载金山毒霸企业版，卸载密码形同虚设。两个漏洞和二唯一报送，以节省乌云资源。  漏洞内容： 测试环境为WIN7 32位 windows xp 32位 其他 64位 WIN XP WIN7 WIN8 未测试名称：金山毒霸退出权限绕过异常或问题描述：通过取消勾选开机启动可绕过退出密码涉及范围：金山毒霸企业版2013 异常解决措施：官方补丁异常验证测试记录：通过验证攻击代码：完整代码(或无需代码）攻击途径：本地攻击复杂度：低认证：不需要机密性：部分地完整性：部分的可用性：完全地 名称：金山毒霸拒绝服务异常或问题描述：禁止启动可发动拒绝服务攻击涉及范围：金山毒霸企业版2013 异常解决措施：官方补丁异常验证测试记录：通过验证攻击代码：完整代码(或无需代码）攻击途径：本地攻击复杂度：低认证：不需要机密性：部分地完整性：部分的可用性：完全地 名称：金山毒霸卸载密码绕过异常或问题描述：通过两种途径的覆盖安装可以绕过卸载密码涉及范围：金山毒霸企业版2013 异常解决措施：官方补丁异常验证测试记录：通过验证攻击代码：完整代码(或无需代码）攻击途径：本地攻击复杂度：中认证：不需要机密性：部分地完整性：完全地可用性：完全地名称：金山毒霸可非授权卸载金山毒霸卸载密码绕过异常或问题描述：通过两种途径的覆盖安装可以卸载软件涉及范围：金山毒霸企业版2013 异常解决措施：官方补丁异常验证测试记录：通过验证攻击代码：完整代码(或无需代码）攻击途径：本地攻击复杂度：中认证：需要机密性：部分地完整性：完全地可用性：完全地 在WIN7测试用例中 先是绕过退出密码验证 然后关闭服务 在安全模式下 通过管理员权限删除毒霸企业版的部分文件 然后用私自假设毒霸服务器的客户端覆盖安装，卸载和退出密码即被修改为默认： admin.用此密码可卸载毒霸！在XP测试用例中 最后一步采用不给客户端传递服务器地址端口号的安装客户端 则直接绕过了 卸载密码！此问题可以导致别有用心的用户用来部署非法而已的攻击软件木马，也可能被不良厂商利用对企业版金山的毒霸发动拒绝服务攻击，强制安装自己的单机版杀毒软件，从而导致网络中心失去对客户端的病毒防御监控！危机整个网络安全。     漏洞证明：  \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n   修复方案：  异常解决措施：官方补丁解决开机启动反勾选时的认证绕过问题 是解决问题的关键同时腾讯电脑管家对这种拒绝服务的做法值得借鉴，可建立互斥进程，监控第三方恶意单机杀毒软件对金山毒霸企业版发动拒绝服务，而使杀毒软件服务器失去对病毒情况的监控。   版权声明：转载请注明来源 abaddon@乌云\n ", "wybug_reply": "漏洞回应  厂商回应： 危害等级：高 漏洞Rank：15  确认时间：2014-05-04 18:15 厂商回复： 多个安全风险漏洞一并提交，且图文描述的很详细。非感谢。风险等级为低、中。所以分数为15。 最新状态： 暂无  ", "replys": "漏洞评价：\n评论\n     2014-05-06 12:20 |    \t\tabaddon \t\t\t( 实习白帽子  |\t\t\t        Rank:37 漏洞数:8        | 我叫什么名字)\t\t \n  这个中低危风险漏洞居然算小厂商  金山毒霸呀 。。。感谢金山迅速的反应速度，一如既往的支持金山    \n     2014-10-30 22:08 |    \t\t老和尚 \t\t\t( 普通白帽子  |\t\t\t        Rank:223 漏洞数:37        | 总有一天，我会骑着雨牛@'雨。踩着一哥@jan...)\t\t \n  还以为是fuzz出来的呢..........    \n  \n\n\n", "wybug_level_fromcorp": "高", "wybug_rank_fromcorp": 15, "Ranks": null}