{"id": 76809, "wybug_id": "wooyun-2015-0163956", "wybug_title": "成都银河教育中心存储型盲打XSS漏洞（已打到cookie）", "wybug_corp": "成都银河教育中心", "wybug_author": "`  Z4lx", "wybug_date": "2015-12-25 20:48", "wybug_open_date": "2016-02-09 23:29", "wybug_type": "XSS 跨站脚本攻击", "wybug_level": "高", "wybug_rank_0": "11", "wybug_status": "已交由第三方合作机构(cncert国家互联网应急中心)处理", "wybug_from": "http://www.wooyun.org", "wybug_tags": ["持久型", "存储型"], "wybug_detail": "漏洞详情 披露状态：   \t\t\t\t\t\t\t\t\t2015-12-25：\t细节已通知厂商并且等待厂商处理中\t\t\t\t\t\t\t\t\t2015-12-29：\t厂商已经确认，细节仅向厂商公开\t\t\t\t\t\t\t\t\t2016-01-08：\t细节向核心白帽子及相关领域专家公开\t\t\t\t\t\t\t\t\t2016-01-18：\t细节向普通白帽子公开\t\t\t\t\t\t\t\t\t2016-01-28：\t细节向实习白帽子公开\t\t\t\t\t\t\t\t\t2016-02-09：\t细节向公众公开  简要描述： 成都银河教育中心存在存储型XSS漏洞（已打到cookie） 详细说明：  成都银河教育中心是国内较早成立的民办高等职业教育学校。旗下高等专修学院（博才学院）成立于80年代，旗下职业培训学校（银河教育）成立于2000年。银河教育是从事计算机专业化、系统化、职业化的著名教育机构，其主要教育项目有：一、以IT和艺术设计为主的职业技能培训；二、与高校合作的学历教育；三、企业管理及专业技术的定制培训。     经过多年的发展，成都银河教育中心已经成为西南地区大型职业教育示范基地，是中国计算机教育最具影响力的品牌之一。并且，结合自身人才汇聚点的优势，银河教育先后成立了职业介绍所、广告与装饰公司、信息技术公司。为学员提供学习，实习，就业全方位服务。     银河以教育为本，精耕细作，纵向发展，已成为集人才培养，人才输送、项目实施的复合型教育企业。包括旗下职业培训学校：成都银河教育中心、成都银河信息技术学校、重庆银河职业培训学校；包含红星路九环校区、红星国际校区、锦天国际校区、重庆观音桥校区；包括旗下高等教育学院（成都博才专修学院），与高校联办职业与学历教育：信息工程学院龙泉校区、信息工程学院青羊校区、川师龙泉驿校区、川师金堂校区；包括旗下创新设计中心：成都精英银河建筑设计有限公司、成都精英银河广告设计有限公司；包括旗下信息技术公司：四川博讯通广信息技术有限公司。包括旗下职业介绍所：景盛银河职业介绍所。    成都银河教育中心现有教学面积50000多平米，教学微机1000多台，建立了包括思科CCIE、华三网络实验室、华为网络实验室、远程网络实验室、网络与信息安全实验室、微软红帽系统工程实验室、SUN、IBM、DELL服务器实验室、艺术视频设计室、艺术画室、装修材料室、淘宝电子商务实训室、专业摄影室等的多个专业实训室。银河现有员工200多人 ，拥有业内知名的专职金牌讲师团队，其中教授/副教授/高工20余名，微软、思科（CISCO）、甲骨文（oracle）、红帽（redhat）、华三（H3C)、惠普(HP)、adobe、淘宝等国际国内厂商授权讲师20余人；室内设计、平面设计、摄影专家及讲师20余人。     银河教育拥有众多培训授权资质，是国家设立的全国信息技术人才培训基地、四川地区国家信息化计算机教育认证指定合作院校、是中国电子教育学会继续教育分会理事单位、是成都市民办教育协会及成都民办职业技能培训协会的理事单位、是成都市中高级技能就业培训定点机构；中心并与全球顶尖的IT厂商、协会以及国内知名企业建立了良好的战略合作伙伴关系：是思科授权培训合作伙伴（CLSP）、oracle（甲骨文）授权培训及考试中心（WDP）、HP（惠普）授权培训及考试中心、华为授权培训及考试中心、华三授权培训及考试中心、Adobe（奥多比）授权培训及考试中心、Red hat（红帽子）授权培训中心及考试中心、Corel数字创意设计联盟鉴定中心、全球最大的教育考试认证机构美国 Prometric 公司授权考试中心、美国 vue 授权考试中心、国际建筑装饰室内设计协会特许培训中心（ICDA）、中国室内装饰协会授权培训及考试中心（CIDA）、淘宝网授权淘宝大学。     学校至今已为Cisco、IBM、HP、联想、腾讯、赛门铁克，箭牌糖果、成都银行、四川电信、四川移动、国航、重庆长安等中外著名企业和公安部、教育部、建行、民生银行、四川交通厅、四川人寿、四川公安厅、成都市教育局等政府机构开办多次集中培训或上门培训，赢得了客户们的一致好评。     目前为止，在银河培训的学员已达5万人以上，学员广泛分布到全国各地、各领域当中，他们的绝大部分成为其单位、公司的技术专家。银河教育本着“以人为本”的理念，致力于国家职业技术人才的培养和推广，立志成为中国著名的职业教育服务提供商，全力打造新型的高级技术人才，为中国职业教育的发展做出更大的贡献！ 官网：http://**.**.**.**/漏洞url：http://**.**.**.**/about/58.html\n\n然后提交......我已经打到cookies了\n\n收到了3条，就是这样了------------------------------------------------------------------------------------   漏洞证明：  \n\n   修复方案：  过滤字符   版权声明：转载请注明来源 `  Z4lx@乌云\n ", "wybug_reply": "漏洞回应  厂商回应： 危害等级：中 漏洞Rank：5  确认时间：2015-12-29 18:01 厂商回复： CNVD未直接复现所述情况，已由CNVD通过网站管理方公开联系渠道向其邮件通报，由其后续提供解决方案。 最新状态： 暂无  ", "replys": "漏洞评价：\n评价\n  \n\n\n", "wybug_level_fromcorp": "中", "wybug_rank_fromcorp": 5, "Ranks": null}