{"id": 49702, "wybug_id": "wooyun-2014-080375", "wybug_title": "社工技巧重置某教师账号密码获取考试题", "wybug_corp": "ulearning.cn", "wybug_author": "YyY", "wybug_date": "2014-10-22 17:21", "wybug_open_date": "2014-12-06 17:22", "wybug_type": "账户体系控制不严", "wybug_level": "高", "wybug_rank_0": "20", "wybug_status": "厂商已经确认", "wybug_from": "http://www.wooyun.org", "wybug_tags": "", "wybug_detail": "漏洞详情 披露状态：   \t\t\t\t\t\t\t\t\t2014-10-22：\t细节已通知厂商并且等待厂商处理中\t\t\t\t\t\t\t\t\t2014-10-23：\t厂商已经确认，细节仅向厂商公开\t\t\t\t\t\t\t\t\t2014-11-02：\t细节向核心白帽子及相关领域专家公开\t\t\t\t\t\t\t\t\t2014-11-12：\t细节向普通白帽子公开\t\t\t\t\t\t\t\t\t2014-11-22：\t细节向实习白帽子公开\t\t\t\t\t\t\t\t\t2014-12-06：\t细节向公众公开  简要描述： 本次事件由一系列的爱情故事产生：小伙伴，其实我是爱你的，不过我现在已经有了新的小伙伴了，我爱她，她也爱我，我们在一起了。你还记得上一次我帮你作弊的情形吗？我一直记得，那时的你，是最美丽的。你很高，完全是我心中的女神。但作为屌丝的我，除了在网络考试时帮你提前弄一份答案之外，我就再也没有其他的机会联系你。故事就这样开始了...... 详细说明：  关注朗文交互英语很长时间了，扫了很多次的目录，注入点测试了很多次，弱口令试了又试。但最终都是失败了的！难道是姿势不对？因为明天就要考试了，英语的期中考试，是通过网络的形式，在朗文交互英语上考。抓紧时间，一次次的测试，漏洞还是没有发现，没有任何的进展。就在绝望之时，在乌云看了下之前的漏洞，都是13年之前的洞了。看到 寂寞的瘦子大哥之前提交的这个 WooYun: 朗文交互式英语重置任意用户密码 受到了启发。我也去试试用户密码的重置！......但是找回密码的方式没有通过修改手机找回了！这样虽然是防止了爆破的可能性。但是，这次破天荒的设置了密码重置的方法。去试试.....果然可以！上面的这四点信息很容易就找到的，因为朗文交互英语的成绩会和学分有关系，在注册账号时老师要求用学号来注册，不知道你们是不是这样，反正我们是这样的！重置了一个用户的密码！果然很爽！在通过加入任意一个班级，在发送消息哪里可以获取到任何人的这些信息。重置密码变得很简单。算是成功了，但貌似目的还没有达到，明天的期中考试卷子啊！这时，目标转移到了老师的那里，理论上，老师的密码也是可以重置的，但是我没有找到老师的学号！不知道老师有没有学号，测试了老师的工号，不可以。......既然你们网站的程序做的很好，去看看你们客服的安全意思怎么样！大牛们都说，人才是最大的漏洞！加了客服的QQ后，一共没有说10句话，就帮我把老师的密码修改成为了123456！哎，客服大大，一定是个妹子！好吧，顺利完成！试卷已经打包下载！明天的考试就不愁了。那会儿兴奋的给女神发了条短信：我拿到了明天期中考试的卷子，你来吧。......   漏洞证明：  \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n   修复方案：  我一定还会回来的！厂商回复：同学，你真是我们前进的动力。顺便说一下，state猜的不对哦:-) 我们准备改改验证码，其他同学要是觉得用起来麻烦，都是你的错哦！   版权声明：转载请注明来源 YyY@乌云\n ", "wybug_reply": "漏洞回应  厂商回应： 危害等级：中 漏洞Rank：5  确认时间：2014-10-23 17:25 厂商回复： 问题已确认，我们会尽快完善！ 感谢！ 最新状态： 暂无  ", "replys": "漏洞评价：\n评论\n     2014-10-22 18:47 |    \t\tYyY \t\t\t( 路人 |\t\t\t        Rank:11 漏洞数:4        | YyY)\t\t \n  社工只是一个辅助！任意重置用户的密码，这才是关键的！    \n  \n\n\n", "wybug_level_fromcorp": "中", "wybug_rank_fromcorp": 5, "Ranks": null}