{"id": 273, "wybug_id": "wooyun-2014-070939", "wybug_title": "云全oa系统多处存储持久xss 可导致越权操作！（你懂得，指哪个用户打哪个用户）", "wybug_corp": "杭州云全信息技术有限公司", "wybug_author": "风情万种", "wybug_date": "2014-08-04 12:27", "wybug_open_date": "2014-11-02 12:28", "wybug_type": "xss跨站脚本攻击", "wybug_level": "中", "wybug_rank_0": "10", "wybug_status": "已交由第三方合作机构(cncert国家互联网应急中心)处理", "wybug_from": "http://www.wooyun.org", "wybug_tags": ["持久型", "存储型"], "wybug_detail": "漏洞详情 披露状态：   \t\t\t\t\t\t\t\t\t2014-08-04：\t细节已通知厂商并且等待厂商处理中\t\t\t\t\t\t\t\t\t2014-08-09：\t厂商已经确认，细节仅向厂商公开\t\t\t\t\t\t\t\t\t2014-08-12：\t细节向第三方安全合作伙伴开放\t\t\t\t\t\t\t\t\t2014-10-03：\t细节向核心白帽子及相关领域专家公开\t\t\t\t\t\t\t\t\t2014-10-13：\t细节向普通白帽子公开\t\t\t\t\t\t\t\t\t2014-10-23：\t细节向实习白帽子公开\t\t\t\t\t\t\t\t\t2014-11-02：\t细节向公众公开  简要描述： 云全oa系统多处存储持久xss 可导致越权操作！（你懂得，指哪个用户打哪个用户）互联网实例上海申昆混凝土集团有限公司博大建设有限公司浙江中装建筑装饰有限公司杭州铭鹏装饰工程有限公司金华恒远建设有限公司浙江振冲岩土工程有限公司浙江一诚工程咨询有限公司湖北襄阳巨型机械海南兴源绿化工程公司温州迈利发服饰有限公司浙江铭炎实业有限公司永康新时代实业有限公司上海中弘国际集团浙江吉安木业有限公司杭州美辰纸业技术有限公司浙江中佳科技有限公司江苏振华工业集团襄阳丰鑫钢铁熔料上海康可尔压缩机有限公司上海九图建设科技有限公司杭州市园林工程有限公司兖矿东华建设有限公司上海分公司浙江国丰集团有限公司赛丽控股集团有限公司中国安防城南京捷茹广告有限公司南京曼卡特上海奇正房地产销售策划有限公司盘锦建丰房地产开发有限公司慈溪市颐高电子有限公司常州市晋陵投资建设有限公司天津申通快递南星桥申通快递浙江尊龙物流有限公司上海慧全国际物流有限公司浙江森迪电气化工程有限公司武汉江浙智能科技有限公司西安瑞祥物业管理有限公司千岛湖建国润和度假酒店舟山励智（酒店OA）长兴广泰酒店物业管理有限公司浙江严州府管理有限公司南京卓冉奥莱商业管理有限公司浙江瑞阳环保科技有限公司浙江中义达能源浙江润丰能源工程有限公司浙江环保厅评估中心陕西华盛兴勇商贸有限公司居优乐电器有限公司浙江秀维科技有限公司上海林邦工贸有限公司杭州钢汇控股有限公司杭州犸凯奴户外用品有限公司杭州诺嘉医疗设备有限公司山东海斯摩尔信息科技有限公司上海大丰投资有限公司上海火石陶瓷科技有限公司聚人人力资源有限公司大地保险有限公司深圳市网科技术有限公司西安瑞祥物业管理有限公司台州黄岩农村信用社中国安防城赛丽控股集团有限公司温州迈利发服饰有限公司浙江中装建筑装饰有限公司杭州裕达食品有限公司慈溪市附海镇五春电器厂杭州天裕科技产品销售有限公司浙江现太电器销售有限公司杭州碧溪贸易有限公司博大建设有限公司陕西华盛兴勇商贸有限公司武汉江浙智能科技有限公司杭州铭鹏装饰工程有限公司无锡旭能光热电能源有限公司杭州潮人文化创意有限公司杰居品电器有限公司浙江瑞阳环保科技有限公司庆商投资咨询有限公司浙江中义达能源有限公司浙江灵汇捷创智能科技有限公司浙江润丰能源工程有限公司浙江环保厅评估中心杭州网通OA办公系统合作提供商浙江铭炎实业有限公司浙江秀维科技有限公司舟山励智技术有限公司四川易泰多科技有限公司杭州宇通建设有限公司临安科星电子有限公司杭州兰菱弹簧制造有限公司杭州怡莲货运代理有限公司杭州群网科技有限公司浙江省公文交换系统建德卫生局建德组织部桐庐卫生局建德社保UT斯达康杭州有限公司聚光科技杭州股份有限公司杭州远石科技有限公司浙江城建建设集团四川吉选商业投资有限公司浙江绿晶香精有限公司耶鲁机械杭州有限公司黑龙江杜蒙县委组织部镇江华晨华通路面机械有限公司浙江鲲鹏建设有限公司杭州欣联贸易有限公司安顺市房产管理局浙江蓝天制衣有限公司杭州鼎盛服装有限公司海得尔企业有限公司杭州代表处杭州新艺服装有限公司杭州天缘药业有限公司杭州华东钢结构制造有限公司杭州华阳通电子制造有限公司浙江宝硕管材有限公司杭州中仑科技有限公司杭州萧山网络传媒有限公司宁波海联物流有限公司杭州越扬科技有限公司浙江森阳家用纺织品有限公司宁波经济技术开发区鼎力网络服务有限公司杭州圣林服饰有限公司杭州金日汽车零部件有限公司杭州野生动物世界有限公司杭州康联信息技术有限公司浙江天杰实业有限公司浙江省中国旅行社杭州坤达科技有限公司杭州汇诚生命科学研究有限公司优比速包裹运送(广东)有限公司宁波分公司杭州恒会达实业有限公司杭州牛尾节能设备有限公司杭州丝美线业有限公司浙皖农贸城浙江华兴集团杭州余杭旺盛织造厂杭州风尚美克纺织品有限公司杭州网天通信工程有限公司杭州中兴医院有限公司富阳国通保险代理有限公司杭州通惠信息技术有限公司慈溪市城市排水有限公司杭州人文专修学校浙江百利威玩具有限公司宁波海曙友益联合会计师事务所杭州金色能源科技有限公司杭州华威药业有限公司杭州弘盛药业有限公司人保财产富阳支公司浒山晨阳网络通讯设备经营部宁波科技园区北宇科技有限公司慈溪安达通信设备有限公司保德安保安制品有限公司浙江金火机床有限公司杭州融合通讯服务有限公司 详细说明：  云全oa系统多处xss 可导致越权操作！（你懂得，指哪个用户打哪个用户） 地址：http://www.yqinfo.cn/ demo 地址：http://oa.yunquanoa.com:8800/ 在发任务 ----发邮件-----等多个地方可以xss 导致低级用户可获取高级用户cookie 从而越权操作 如发任务地方！ 任务名称未做xss 过滤！ 发送任务名称带xss的任务给指定用户 即可使对放触发xss 无需查看也可触发 如：\n有关OA使用重申通知<img onerror=alert(/xss/) src=#>\n \n\n 发送后在对方的 oa系统首页可触发xss \n\n \n\n 如果是对方查看的话 就跟不用说了 比如查阅 \n\n \n\n   漏洞证明：  .....   修复方案：  .....   版权声明：转载请注明来源 风情万种@乌云\n ", "wybug_reply": "漏洞回应  厂商回应： 危害等级：高 漏洞Rank：11  确认时间：2014-08-09 09:39 厂商回复：   最新状态： 暂无  ", "replys": "漏洞评价：\n评论\n     2014-08-04 12:41 |    \t\tdsiden \t\t\t( 实习白帽子  |\t\t\t        Rank:41 漏洞数:10        )\t\t \n  抢个前排    \n     2014-11-02 13:22 |    \t\taNsSe \t\t\t( 路人 |\t\t\t        Rank:0 漏洞数:2        | 独自一人走天下)\t\t \n  路过！！    \n  \n\n\n", "wybug_level_fromcorp": "高", "wybug_rank_fromcorp": 11, "Ranks": null}