{"id": 72214, "wybug_id": "wooyun-2015-0151960", "wybug_title": "青客OA系统服务器可被入侵（3.6W+租户信息泄露）智能家居真的好吗", "wybug_corp": "qk365.com", "wybug_author": "路人甲", "wybug_date": "2015-11-06 12:57", "wybug_open_date": "2015-12-21 18:58", "wybug_type": "SQL注射漏洞", "wybug_level": "高", "wybug_rank_0": "20", "wybug_status": "厂商已经确认", "wybug_from": "http://www.wooyun.org", "wybug_tags": "", "wybug_detail": "漏洞详情 披露状态：   \t\t\t\t\t\t\t\t\t2015-11-06：\t细节已通知厂商并且等待厂商处理中\t\t\t\t\t\t\t\t\t2015-11-06：\t厂商已经确认，细节仅向厂商公开\t\t\t\t\t\t\t\t\t2015-11-16：\t细节向核心白帽子及相关领域专家公开\t\t\t\t\t\t\t\t\t2015-11-26：\t细节向普通白帽子公开\t\t\t\t\t\t\t\t\t2015-12-06：\t细节向实习白帽子公开\t\t\t\t\t\t\t\t\t2015-12-21：\t细节向公众公开  简要描述： 昨天看到了301转发的xiao.k的青客漏洞。这个开门危害太大了~智能家居真的好吗？什么都不想说了，我感觉我住的地方都没有门！没有门！没有门！故事背景：青客员工：我们的OA系统是我们老总自己写的。我：。。。（自己写的OA系统，好吧，绝笔有漏洞！），你们老总挺厉害的！青客员工：我们老总吧啦 吧啦~~，走带你去签合同。。。然后在我眼皮底下，青客某员工登录了他的OA~《亮点在详细说明中》 详细说明：  00x01 入侵背景刚刚来上海的时候，公司说和青客有合作，租房有优惠，其实没有什么优惠，都是青客自己的优惠。青客租房还是比较方便的。在某业务员的带领下，去了他们一个分部去办理合同。他熟练的登录了OA系统，我当时就仔细看了下，是不是不常见的子域名，OK，原来站点就是\nhttp://oa.qk365.com/\n然后发现该业务员输入的账号是自己的中文名。中文名，有意思~00x02 进入OA系统，获取最高权限登录页面\n\n手动检测下，是否有POST注入或万能密码\n\n那么就直接试试admin的账户，构造万能密码  \nadmin' or '1'='1\n成功登录\n\n通过这个截图可以发现，用户admin的权限并没有我们所想的那么多，admin应该是一个权限控制的账号。在权限调整的地方，发现可以利用的用户了\n\n用\n林聪' or '1'='1\n去登录吧。权限够大！\n\n在林聪的光环下，全部注册会员36299条记录完全泄露，泄露信息包括但不限于 \n真实姓名  电话  身份证（正反面图片）\n\n\n查询房间信息，可以查询开门密码。（智能家居真的好吗？）\n\n00x03 拿下服务器上传的地方如此之多，随意找了处上传，上传菜刀马，提权拿服务器。\n\n\n\n   漏洞证明：  林聪的管理权限如下\n装饰预算装饰预算单元管理房间管理单价管理预算管理新建毛坯墙石膏线安装墙体粉刷给水管铺设排水管铺设强电铺设弱电铺设地板铺设踢脚线安装地面水泥找平地砖铺设墙砖铺设吊顶安装大理石铺设大理石挡水玻璃制作橱柜制作卫浴设备电器设备软装家具安装窗帘软装套装门安装签证项目股东管理股东管理股东列表股份管理工程进度管理系统工程进度管理系统项目列表待办列表误工列表未采购列表等待领料列表领料完毕列表未提交审批列表主管审批列表未付款列表已付款列表用料列表施工人员列表价格列表供应商列表未提交审批列表材料主管审批列表材料未付款列表材料已付款列表材料驿家物业管理系统驿家物业管理系统托管合同录入会员合同录入杂费支出录入杂费开列账单电费开列账单调试用电开列账单补偿赠电开列账单水费开列账单托管合同导入待标房间列表托管合同列表会员合同列表房东列表会员列表单元列表房间列表房间列表新房间订价列表转租房间列表会员情况表房间定价比率账单列表房间账单列表托收租金列表使用费列表收银日记账支出列表收费列表居易通门锁重置使用费催收杂费催收单元实际收益统计实际总收益统计均价统计毛利率统计绩效列表人力成本列表短信群发公告管理网上报修电表调试通讯盒列表采集器列表对账单缴费通知书催缴通知退房结算单用电清单月度催账表申请银行分期列银行分期未成功列银行分期使用费列托收租金单元托收租金月份付款清单单元付款清单月份收款纪录房间收款纪录月份收款纪录方式门锁水电表维护网络故障维护通讯盒故障维护旧采集器故障维护门锁电池维护门锁故障维护电表故障维护水表故障维护新采集器故障维护杂费支出录入房间订价列表会员预订列表订单列表网上机广告列表预期现金流统计预期收益统计租金付款计划工程进度管理系统新工程进度管理系统未开工项目开工中项目验收中项目已完工项目普通采购日志特殊采购日志补料采购日志未采购列表已采购列表待提交工资列表补料列表未发货列表已发货列表施工人员列表工序列表价格列表供应商列表用料列表待结算列表地址待结算列表批次待初审列表待复审列表待付款列表已付款列表备货申请备货采购备货初审备货复审备货付款备货已付款系数配置列表待结算列表新地址待结算列表新批次待初审列表新待复审列表新待付款列表新已付款列表新备货申请列表待初审备货列表待复审备货列表待付款备货列表已付款未入库列表已付款已入库列表已终止备货列表决算管理预算管理工程付款一览表预算配置待审批工资列表待付款工资列表已付工资列表房源采购系统房源采购系统申报房源上传房源图片待评分房源服务中心审批房源分公司审批房源待谈判房源分公司复审房源待签约房源签约成功房源放弃采购房源已交付房源采购进度列表交付进度列表板块管理地铁线路管理办公选项房东批量付款公共事业费批量付款统计报表统计报表房间报表会员报表销售管理系统销售管理系统当月销售员排行榜服务中心业务费用统计服务中心业务费用年终统计表房间管理员业务费用统计服务中心管家业务费用统计服务中心经理月度销售报服务中心房管员月度销售报房间信息填报服务中心审核市场部审核满房预退列表装修中房间列表合同评分列表销售线索会员满意度调查结果装机量报表安装未入住报表已推荐房间列表待推荐房间列表当月服务中心排行榜当月分公司排行榜当月销售带看排行榜服务中心待租房间排行榜分公司待租房间数排行榜服务中心满房报表分公司满房报表服务中心利润报表分公司利润报表满房房间列表待租房间列表带看准备列表待批带看列表历史带看列表预订房间列表转租房间列表报修列表人力列表税收列表管理列表人员数据报表货款分期管理系统货款分期管理系统会员登记新易贷申请列表人人分期申请列表人人分期待审批列表人人分期待放款列表人人分期已拒绝列表人人分期二次申请列表人人分期已放款列表民生贷款申请列表民生贷款待审批列表民生贷款待放款列表民生贷款已拒绝列表民生贷款二次申请列表民生贷款已放款列表新易贷待审批列表新易贷待放款列表新易贷已拒绝列表新易贷二次申请列表新易贷已放款列表新易贷收款列表新易贷未登记收款列表新易贷放款终止列表人人分期放款终止列表民生贷款放款终止列表松江民生贷款申请列表松江民生贷款待审批列表松江民生贷款待放款列表松江民生贷款已拒绝列表松江民生贷款二次申请列表松江民生贷款已放款列表松江民生贷款放款终止列表人人分期收款列表话务工单系统话务工单系统工单科目待实施列表已分拣列表派单结算申报待派单列表待回访列表已办结列表申报记录工单结算实施人工单结算派单人工单结算回访人实施人公共事业费缴费系统公共事业费缴费系统新建出账机构出账机构列表账单基础信息设置账单基础信息查询账单数据列表显示手工付费账单列表差错付费账单列表付费通批量销账智能平台智能平台验收维修审计故障前台签约系统前台签约系统会员注册预定入住退房换房收款开账租务退款电费充值水费充值快速注册交易查询财务对账续租中介提成列表淘宝预定报表管理系统报表管理系统服务中心销售月报间夜服务中心销售年报间夜房管员当月实际销售额报表房管员累计销售额报表销售房管员销售提成报表服务中心绩效展示房间月份维度报表服务中心绩效展示房间维度报表服务中心绩效展示单元月份维报表地主房管员管理提成报表服务中心当月毛利报表分公司当月净利报表服务中心房管员维度绩效报表服务中心所选区间绩效报表分公司所选区间绩效报表房管员提成计算报表服务中心分红计算报表服务中心费用登记房管员人力成本导入单元保洁费导入房间利润情况表服务中心经理提成计算报表非服务中心办公费用表服务中心经理每日销售报表房管员每日销售报表电商后台管理电商后台管理概要统计订阅量统计预约量统计预定量统计签约量统计评论审核房屋托管用户留言审核房东未审核房东审核通过房东审核不通过租客未审核租客审核通过租客审核不通过消息推送房源未审核房源审核通过房源审核不通过数据纠正系统数据纠正系统房间定价服务中心纠正房管员纠正股份管理系统股份管理系统股东管理股份管理总股本管理新股发售管理配送管理配售管理期权管理新股发行二手交易股份平移配售交易期权交易公告管理董事会档案管理股东会档案管理系统预定录入订单订单大客户订单手工回访录入预订管理待定订单带看订单订单查询订单回访任务列表回访记录手工回访回访记录导出会员管理新增会员会员查询会员客历用户设置修改密码保安后台管理保安后台管理保安异常情况审核保安单元列表保安月巡逻列表保安房源分配保安员管理保安排班管理保洁后台管理保洁单元月度统计保洁公司月度统计保洁公司管理保洁公司房源分配保洁员管理保洁员房源分配保洁员排班管理保洁单元列表运营报表管理系统考勤系统考勤规则法定节假日排班计划导入排班计划查询设备下发配置每日考勤每日考勤查询考勤报告人事考勤总表下载月统计考勤年统计考勤总经理查询任务管理系统管理系统应用应用列表管理应用模块管理应用操作管理权限调整部门管理用户组管理用户管理角色管理公司管理行政级别管理职务管理\n1、通过这些权限，可以知道青客委托收租的价格，也知道了他们到底赚了租客多少钱。2、知道了曾经在租客租房的信息，这些信息危害太大3、开门 开门 开门！4、修改租房价格~其他就不赘述了！   修复方案：  什么也不想说，住的地方就没有门！什么也不想说，住的地方就没有门！什么也不想说，住的地方就没有门！什么也不想说，住的地方就没有门！什么也不想说，住的地方就没有门！   版权声明：转载请注明来源 路人甲@乌云\n ", "wybug_reply": "漏洞回应  厂商回应： 危害等级：高 漏洞Rank：10  确认时间：2015-11-06 18:57 厂商回复： 非常感谢，已经安排紧急修复 最新状态： 暂无  ", "replys": "漏洞评价：\n评论\n     2015-11-05 12:58 |    \t\tzeracker  \t\t\t( 核心白帽子 |\t\t\t        Rank:1077 漏洞数:139        | 多乌云、多机会!微信公众号: id:a301zls   ...)\t\t \n  你真是个好人    \n     2015-11-05 13:09 |    \t\tOurgame简单 \t\t\t( 实习白帽子  |\t\t\t        Rank:55 漏洞数:13        | 来打酱油.)\t\t \n  算是社工...    \n     2015-11-05 13:26 |    \t\txiao.k \t\t\t( 普通白帽子  |\t\t\t        Rank:153 漏洞数:15        | 纳威网络安全导航 navisec.it)\t\t \n  ........小伙子，要不要住一起啊    \n     2015-11-06 13:00 |    \t\t天地不仁 以万物为刍狗 \t\t\t( 普通白帽子  |\t\t\t        Rank:1084 漏洞数:300        | 当你迷茫、失望、浮躁、悲伤、绝望的时候，...)\t\t \n  该名员工系临时工····    \n     2015-11-06 13:06 |    \t\tgetshell1993 \t\t\t( 普通白帽子  |\t\t\t        Rank:738 漏洞数:81        | ~！@#￥%……&*)\t\t \n  昨天刚注册.....    共 22 条记录, 2 页   1 2    \n     2015-11-06 13:19 |    \t\thecate \t\t\t( 普通白帽子  |\t\t\t        Rank:573 漏洞数:90        | ®高级安全工程师 | WooYun认证√)\t\t \n  刚提交一个青客的洞结果重复,被你们刷爆了    \n     2015-11-06 13:49 |    \t\tYsql404 \t\t\t( 普通白帽子  |\t\t\t        Rank:309 漏洞数:59        | 碧海情天)\t\t \n  2天被刷了好多漏洞    \n     2015-11-06 14:09 |    \t\tHackBraid  \t\t\t( 核心白帽子 |\t\t\t        Rank:1763 漏洞数:282        | ...........................................)\t\t \n  来个众测吧    \n     2015-11-06 16:02 |    \t\tmissy \t\t\t( 普通白帽子  |\t\t\t        Rank:816 漏洞数:219        | .....-3-3-3-3-3-3-3-3-3-3-3-3-3)\t\t \n  刷了10个,没走一个大厂商,这才是最郁闷的.    \n  \n\n\n", "wybug_level_fromcorp": "高", "wybug_rank_fromcorp": 10, "Ranks": null}