{"id": 76371, "wybug_id": "wooyun-2015-0165086", "wybug_title": "中国科学院人事局某平台系统沦陷内部信息泄露", "wybug_corp": "cncert国家互联网应急中心", "wybug_author": "朱元璋", "wybug_date": "2015-12-30 00:20", "wybug_open_date": "2016-02-12 18:49", "wybug_type": "后台弱口令", "wybug_level": "高", "wybug_rank_0": "15", "wybug_status": "已交由第三方合作机构(cncert国家互联网应急中心)处理", "wybug_from": "http://www.wooyun.org", "wybug_tags": "", "wybug_detail": "漏洞详情 披露状态：   \t\t\t\t\t\t\t\t\t2015-12-30：\t细节已通知厂商并且等待厂商处理中\t\t\t\t\t\t\t\t\t2016-01-06：\t厂商已经确认，细节仅向厂商公开\t\t\t\t\t\t\t\t\t2016-01-16：\t细节向核心白帽子及相关领域专家公开\t\t\t\t\t\t\t\t\t2016-01-26：\t细节向普通白帽子公开\t\t\t\t\t\t\t\t\t2016-02-05：\t细节向实习白帽子公开\t\t\t\t\t\t\t\t\t2016-02-12：\t细节向公众公开  简要描述： RT 详细说明：  中国科学院人事局局务平台**.**.**.**:8080/RSJ/newIndex.jsp\n\n用户名：祝昊泉祝昊泉谢彪宋琦陈光李洪伟张放王庆迪陈光李和风侯秋菊宋琦张燕郭明亮庞维张婷张萌密码均为123456以上账号不行的话，试试  用户名：张飞  密码：123456\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n   漏洞证明：  \n院 局 领 导 重 要 批 示2015（4）综合处                             2015年10月30日1. 白春礼院长8月3日在人才处报送的《关于特聘研究员计划实施情况说明的请示》上批示：可在实践中不断总结，完善。使该计划真正有利于稳定优秀人才，聚焦重大产出。詹文龙副院长8月4日批示：四类机构的人才构成、比例不同，目前可抓紧调研，推出典型示范，“特聘研究员”项目有实效。王恩哥副院长8月10日批示：认真落实白院长指示，抓好细节，做到每人情况如实。李和风局长8月11日批示：请伟锋并人才处阅，可再做些调研，争取在首次申报后，就有关情况和问题，再上次会。董伟锋副局长8月11日批示：请人才处落实领导批示，做好相关调研。2. 白春礼院长8月27日在国家领导人批示上海市采取办法为高校青年教师解决住房问题的有关材料上批示：请仲礼、恩哥阅。我们可否学习借鉴？王恩哥副院长8月28日批示：这个方式可以研究学习，请和风、建国提出建议，我们深入细化，再报白院长。李和风局长9月6日批示：建议对我院的做法也进行一些梳理，再借鉴上海做法，形成符合我院特点的方案。请人才处阅研，我们积极配合条财局制定方案。3. 白春礼院长9月13日在中央人才工作协调小组办公室《审议文件：关于加强新形势下外国人才引进工作的意见（送审稿）》上批示：请文龙、恩哥和人事局提出意见。詹文龙副院长9月15日批示：注重按需引进，追求实效，避免为“引进而引进”，对引进掌握关键核心技术的人才团队，需要厘清知识产权以避免专利纠纷等。王恩哥副院长9月15日批示：应注意政策的可行性，即政策配套；政策的稳定性，即可持续。建议国家加大力度尽快实施这一《意见》。请和风阅研并提出建议。李和风局长9月16日批示：请人才处阅，会同相关部门提出修改建议。4. 白春礼院长9月18日在中国科协科技人才有关调研报告上批示：请恩哥着重研究，结合我院实际的人才培养和激励改革。王恩哥副院长9月22日批示：人才工作是我院核心工作，涉及长远发展，要深入调研，比较国内外情况，改进完善工作，时时走在前面。请和风、伟锋研究，我们做一次讨论。李和风局长10月28日批示：请人才处结合我院的实际，在冬季党组会上提出我院工作的理念与举措。之前讨论1-2次。5. 白春礼院长10月23日在机构处报送的《关于调整上海生科院等7个单位事业编制的请示》上批示：如果近期还将有调整，可等调整后一起上报。如没有，即可上报。中编办批复后，院里可等相应四类机构确定后再下发调增的文件。李和风局长10月29日批示：请苗鸿阅，机构处办理。6. 詹文龙副院长8月24日在中国科协科技工作者心理健康状况有关调研报告上批示：人事局，可在院里做个类似的调查，特别在工作价值感方面，以提高政策制定的效益。7. 李和风局长10月10日在机构处报送的《关于“联合资助优秀博士后项目”相关事项的请示》上批示：同意，若要进行宣传，还需对此次改革的意义和预期成效进行提炼归纳。8. 李和风局长10月28日在继续教育处报送的《关于重庆院中层干部竞聘相关问题的第三次汇报》上批示：请与分院党组一起，做好重庆院主要领导的工作，对干部工作要从严把握。\n   修复方案：  加强安全意识   版权声明：转载请注明来源 朱元璋@乌云\n ", "wybug_reply": "漏洞回应  厂商回应： 危害等级：中 漏洞Rank：10  确认时间：2016-01-06 15:49 厂商回复： CNVD确认并复现所述情况,已经转由CNCERT向中科院上级主管部门通报,由其后续协调网站管理单位处置. 最新状态： 暂无  ", "replys": "漏洞评价：\n评价\n  \n\n\n", "wybug_level_fromcorp": "中", "wybug_rank_fromcorp": 10, "Ranks": null}