{"id": 77344, "wybug_id": "wooyun-2015-0162720", "wybug_title": "湖南运达实业集团有限公司某系统远程代码执行漏洞导致服务器被入侵", "wybug_corp": "湖南运达实业集团有限公司", "wybug_author": "路人甲", "wybug_date": "2015-12-25 10:50", "wybug_open_date": "2016-02-06 10:45", "wybug_type": "命令执行", "wybug_level": "高", "wybug_rank_0": "20", "wybug_status": "已交由第三方合作机构(cncert国家互联网应急中心)处理", "wybug_from": "http://www.wooyun.org", "wybug_tags": "", "wybug_detail": "漏洞详情 披露状态：   \t\t\t\t\t\t\t\t\t2015-12-25：\t细节已通知厂商并且等待厂商处理中\t\t\t\t\t\t\t\t\t2015-12-29：\t厂商已经确认，细节仅向厂商公开\t\t\t\t\t\t\t\t\t2016-01-08：\t细节向核心白帽子及相关领域专家公开\t\t\t\t\t\t\t\t\t2016-01-18：\t细节向普通白帽子公开\t\t\t\t\t\t\t\t\t2016-01-28：\t细节向实习白帽子公开\t\t\t\t\t\t\t\t\t2016-02-06：\t细节向公众公开  简要描述： RT 详细说明：  湖南运达实业集团有限公司成立于1996年5月。经过20年的艰苦创业，已成长为一家拥有房地产、酒店、贸易、工业四大核心板块的企业集团。目前，公司总资产超百亿元，拥有员工6000多人。运达集团从纸箱包装起步，以钢材贸易立足，从房产开发壮大，以酒店经营和国际名品贸易扬名，目前正以移动互联网为平台推进新一轮创业创新转型。　　运达是高端产品的缔造者和高端生活的引领者,公司在涉足的多个产业和领域创造了众多市内第一、省内第一、乃至国内第一湖南第一家国际5A写字楼、第一家国际五星级酒店、第一家奢侈品商场均由运达投资建设并运营管理，堪称业界奇迹，也被湖南媒体多次报道为“运达现象”。　　集团成员企业包括：湖南运达房地产开发有限公司、湖南运达酒店管理有限公司、湖南运达贸易有限公司、湖南运达绿色包装股份有限公司、湖南运达装饰工程有限公司、湖南运达园林景观工程有限公司、湖南运达汽车销售有限公司、湖南水清木华物业管理有限公司、湖南运达机电科技股份有限公司9家公司，以及长沙运达喜来登酒店、常德运达瑞高酒店、长沙瑞吉酒店（在建）、长沙W酒店（在建）4家国际五星级酒店。　　公司在房地产开发、装饰装修、物业管理领域实力雄厚，三家公司均具有国家一级资质，拥有一支经验丰富、技术拔尖、管理规范的创业团队。运达房产公司率先在长沙开发建成的高端城市综合体——运达国际广场被评为“长沙市十大城市地标名片”，并荣膺中国建筑工程质量最高奖项——“鲁班奖”。正在开发建设的运达中央广场是当代高品质城市综合体的杰出代表，涵盖了双国际白金五星级酒店、国际5A写字楼、国际名品商场、国际名品步行街、国际酒店式公寓和钻石华宅等多种高端物业形态。项目一期亮相后，便赢得了社会各界的一致肯定和高度评价，先后获得了“长沙十大新商业地标”、“湖湘十大地铁新地标”等多项业界殊荣。该项目预计于2017年底全面竣工、全面开业。运达装饰公司和运达园林景观公司在高星级酒店、行政商务、高端商场、别墅寓所、银行证券、园林景观等高端装修领域卓有建树，是湖南公用建筑装饰工程领域的一颗耀眼的明星。水清木华物业公司系长沙市物业协会副会长单位，顺应住宅物业专业化、国际化的管理趋势，先后为浦发银行、农业银行、美美国际名品商场等十多个高端物业提供了优质的物业服务。　　在酒店运营与管理领域，运达集团与世界500强企业美国喜达屋集团结成战略同盟，长沙首家真正意义的国际五星酒店_运达喜来登酒店的开业营运成为长沙迈向国际化的里程碑大事件，开业八年来，先后获得了国内外高端酒店业诸多殊荣，行业地位至今无可撼动。公司自营品牌运达瑞高酒店是目前湘西北地区最高档的五星级商务酒店。即将于2016年亮相的长沙瑞吉酒店和长沙W酒店开业后将填补长沙最奢华酒店和最具时尚个性酒店的空白。公司旗下四家高端酒店将充分利用客户资源和物流资源，优势互补、联营联动，共同开创美好的未来。　　运达贸易公司与香港俊思集团合作经营的长沙运达美美国际名品商场是湖南目前最顶级的奢侈品商场，以路易威登(LV)为首的60多家国际一线品牌齐聚店内，销售业绩骄人，运达美美商场的品牌高度、时尚魅力和生活品味受到高端消费者喜爱和青睐。即将开业的运达中央广场购物中心，是一座集吃喝玩乐购为一体的智慧化大型商城，其高端、丰富、便捷、时尚的消费体验必将受到消费者喜爱，成为行业翘首。　　在当今中国制造全面崛起的大背景下，公司旗下的包装公司和机电公司也已完成全新升级扩建。包装公司是中国中部地区最大的综合型纸制品包装生产企业，也是中国包装联合会授予的“中国包装优秀企业”称号的20家包装公司之一。机电公司则是以生产汽车制动器为主的机电一体化制造企业，被国家有关部门认定为“高新技术企业”。目前两家工业企业都已具备了快速发展的综合能力。　　为了顺应互联网+的大趋势，公司正在全面整合旗下各业态的资源，探索和打造跨行业、多渠道、多层次的智慧生活场景和互联网线上线下融合电商（O2O)平台——运达云桃，在智慧商城、智慧餐饮及娱乐、智慧社区、智慧写字楼、智慧停车场等领域锐意创新。通过这一全渠道运营体系的建立和推广，公司将成为湖南省首家跨业态智慧生活提供商。不久的未来，公司将完成互联网转型和升级，以全新的姿态缔造新的辉煌。http://**.**.**.**:7001/defaultroot/login.jsp\n\n   漏洞证明：  \n\n   修复方案：     版权声明：转载请注明来源 路人甲@乌云\n ", "wybug_reply": "漏洞回应  厂商回应： 危害等级：高 漏洞Rank：10  确认时间：2015-12-29 18:15 厂商回复： CNVD确认并复现所述情况，已经由CNVD通过网站公开联系方式向网站管理单位通报。  最新状态： 暂无  ", "replys": "漏洞评价：\n评价\n  \n\n\n", "wybug_level_fromcorp": "高", "wybug_rank_fromcorp": 10, "Ranks": null}