{"id": 73993, "wybug_id": "wooyun-2015-0165423", "wybug_title": "安徽省某市旅馆入住记录系统漏洞（泄露全市开房信息/泄露大量在住人身份信息/查房系统实时查看/泄露近千个旅馆信息）", "wybug_corp": "center", "wybug_author": "路人甲", "wybug_date": "2015-12-28 16:45", "wybug_open_date": "2016-02-09 23:29", "wybug_type": "命令执行", "wybug_level": "高", "wybug_rank_0": "20", "wybug_status": "已交由第三方合作机构(公安部一所)处理", "wybug_from": "http://www.wooyun.org", "wybug_tags": "", "wybug_detail": "漏洞详情 披露状态：   \t\t\t\t\t\t\t\t\t2015-12-28：\t细节已通知厂商并且等待厂商处理中\t\t\t\t\t\t\t\t\t2015-12-29：\t厂商已经确认，细节仅向厂商公开\t\t\t\t\t\t\t\t\t2016-01-08：\t细节向核心白帽子及相关领域专家公开\t\t\t\t\t\t\t\t\t2016-01-18：\t细节向普通白帽子公开\t\t\t\t\t\t\t\t\t2016-01-28：\t细节向实习白帽子公开\t\t\t\t\t\t\t\t\t2016-02-09：\t细节向公众公开  简要描述： 去过安徽某市的表哥，要被查房了~~ 详细说明：  \n\nmask 区域\n*****.*******\n\n 安徽省滁州市警用旅馆管理系统，存在命令执行，通过写提权配置数据量发现大量数据，可实时管理全市所有旅馆的治安和入住情况，用户采用编号形式，一个旅馆一个编号，然后密码都是123456  粗略算了下有996个旅馆。查看了下，一般入住10-20人。有的学院附近的有50人之多，信息泄露就是，你去开房的信息！！！身份信息数据量太多，截图只是部分数据，   漏洞证明：  \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\njdbc.driverClass=oracle.jdbc.driver.OracleDriverjdbc.url=jdbc:oracle:thin:@**.**.**.**:1521:lgyjdbc.user=hoteljdbc.password=czhotelshjc3411!\n数据库配置\nQuery#0 : select * from \"JDR\"IDVARCHAR2\tLGBMVARCHAR2\tXMVARCHAR25a976c853d765a78013d82bc65c602ad\t3411020038\t4565a976c853d765a78013d9035973e0775\t3411810150\t何培芳5a976c853df79f4d013dfe0b05ca01ae\t3411020025\t李朝阳5a976c8540813fef014112b48b814f40\t3411810269\t闵先生5a976c853df79f4d013e0312e4cc0224\t3411240111\t李广萍5a976c853e083973013e15c1936904d5\t3411240188\t王云5a976c853e083973013e15c469ea04dd\t3411240188\t郭维娜5a976c853e16f688013e1ff0c5bc0ce4\t3411240190\t许高翠5a976c853e16f688013e212a53721667\t3411810200\t石怀玉5a976c853e16f688013e214110fb1702\t3411820060\tl刘汉堂5a976c853e16f688013e2f58b9873464\t3411810275\t王巧云5a976c853e16f688013e2f753806354f\t3411810264\t林静5a976c853e16f688013e2fb9422c3759\t3411810271\t王玉礼5a976c853e16f688013e30a262fc39a0\t3411220042\t张叶勤5a976c853e16f688013e2fb95508375a\t3411810271\t王玉礼5a976c853e16f688013e30a77b6639bf\t3411810182\t柳平英5a976c853e16f688013e30a830ec39c6\t3411810182\t单宗莉5a976c853e16f688013e30a9408939d2\t3411250230\t陈浩5a976c853e16f688013e347cf6554307\t3411810183\t曹开兵5a976c853e16f688013e30b167043a08\t3411810246\t傅玉祥5a976c853e16f688013e35f916474bfa\t3411240038\t阮怀义5a976c853e16f688013e34c0dbd24518\t3411260169\t陈元志5a976c853e16f688013e35f8b9c04bf3\t3411240038\t陈复英5a976c853e16f688013e39c5f5c254b8\t3411240031\t冯金梅5a976c853e16f688013e39c92ba854d6\t3411260129\t郑艳5a976c853e16f688013e39cde83e54f3\t3411820103\t无5a976c853e16f688013e492ee7080404\t3411030040\t孙伯玲5a976c853e16f688013e4941a0cb047f\t3411810077\t何萍5a976c853e16f688013e495420160522\t3411810077\t毛玉梅5a976c853e16f688013e49547af70529\t3411820017\t王自荣5a976c853e16f688013e496e22a70617\t3411030059\t黄翠华5a976c853e16f688013e6514ab835fa1\t3411240210\t杨慧5a976c853e16f688013e4e43b84f1577\t3411020138\t姚广军5a976c8540813fef014081dc806000b3\t3411010027\t散客5a976c853e16f688013e79cea09c08e5\t3411010015\t15a976c853e7dac0a013e8832c2d01b3f\t3411810059\t王继芳5a976c853eacb2dc013eb48a6c6e1303\t3411020168\t陆昂5a976c853eb72371013ebfc1ad44145d\t3411220029\t姚正跃5a976c853eb72371013ebfd78f7f149e\t3411220027\t徐玉红5a976c853eb72371013ec238e1491d1d\t3411240215\t刘国栋5a976c853eb72371013ec5e583b72352\t3411820094\t方新国5a976c853eb72371013ec675b2d924ce\t3411020059\t胡厚颖5a976c853eb72371013ec6afe7aa25cc\t3411250068\t汽车试验厂5a976c853eb72371013ec9ab90302c15\t3411820046\t顾云5a976c853eb72371013ecc5bdde0348a\t3411010027\t康迈斯5a976c853eb72371013ecf3963bc3a4f\t3411820046\t殷沿海5a976c853eb72371013ed05873f54497\t3411810187\t陈张娣5a976c853eb72371013ed0c71781474a\t3411010027\t宝利嘉5a976c853eb72371013ed157c5b64a54\t3411810151\t朱良科\n给出部分验证信息，编号为登录名，密码为123456 登录后会跳转到一个404.手动输入index.jsp 就可以看到首页   修复方案：     版权声明：转载请注明来源 路人甲@乌云\n ", "wybug_reply": "漏洞回应  厂商回应： 危害等级：高 漏洞Rank：10  确认时间：2015-12-29 16:32 厂商回复： 验证确认所描述的问题，已通知其修复。 最新状态： 暂无  ", "replys": "漏洞评价：\n评价\n     2015-12-28 16:55 |    \t\t独臂刀王 \t\t\t( 普通白帽子  |\t\t\t        Rank:323 漏洞数:88        | 提交一个漏洞就可以买个柚子~~好爽~)\t\t \n  @DNS    \n     2015-12-28 16:56 |    \t\t路人毛 \t\t\t( 实习白帽子  |\t\t\t        Rank:64 漏洞数:25        | ../)\t\t \n  我猜是java反序列化命令执行    \n     2015-12-28 17:34 |    \t\tDNS \t\t\t( 普通白帽子  |\t\t\t        Rank:711 漏洞数:73        | root@qisec.com)\t\t \n  @路人毛 不用猜,就是    \n     2015-12-28 17:38 |    \t\t萨瓦迪卡 \t\t\t( 实习白帽子  |\t\t\t        Rank:98 漏洞数:14        | 黑太子)\t\t \n  没在安徽开房的飘过。。。。。。。    \n     2015-12-29 02:06 |    \t\t喜羊羊 \t\t\t( 路人 |\t\t\t        Rank:12 漏洞数:3        | 信息安全新手，请大神、师兄多多关照，谢谢...)\t\t \n  是Weblogic Java反序列化，我也测到了，楼主比我早几个小时。 ：（    \n  \n\n\n", "wybug_level_fromcorp": "高", "wybug_rank_fromcorp": 10, "Ranks": null}