{"id": 65635, "wybug_id": "wooyun-2015-0136427", "wybug_title": "海康威视以及部分其他网络摄像头大范围IP段可扫描监控", "wybug_corp": "海康威视", "wybug_author": "路人甲", "wybug_date": "2015-08-24 08:23", "wybug_open_date": "2015-10-08 09:06", "wybug_type": "应用配置错误", "wybug_level": "高", "wybug_rank_0": "20", "wybug_status": "厂商已经确认", "wybug_from": "http://www.wooyun.org", "wybug_tags": ["弱口令", "管理后台对外", "默认口令"], "wybug_detail": "漏洞详情 披露状态：   \t\t\t\t\t\t\t\t\t2015-08-24：\t细节已通知厂商并且等待厂商处理中\t\t\t\t\t\t\t\t\t2015-08-24：\t厂商已经确认，细节仅向厂商公开\t\t\t\t\t\t\t\t\t2015-09-03：\t细节向核心白帽子及相关领域专家公开\t\t\t\t\t\t\t\t\t2015-09-13：\t细节向普通白帽子公开\t\t\t\t\t\t\t\t\t2015-09-23：\t细节向实习白帽子公开\t\t\t\t\t\t\t\t\t2015-10-08：\t细节向公众公开  简要描述： 很多人都知道，海康威视大量admin帐号存在弱口令12345，配合端口扫描器，扫描任意IP段的相应端口，只要你提供了外网可达的IP段，该IP段的海康威视管理后台存在弱口令，理论上就能对该IP段设备拍摄内容进行查看，监控学校，监控住宅，监控宾馆等等都可能做到！ 详细说明：  怕被查水表，所以可耻的匿了本篇的技术难度不高，也许里面的技巧各位早就玩腻了，但还是提一提吧，如果和以前的漏洞重了请轻喷哈首先，解释下标题，大范围IP段监控海康威视的弱口令问题存在很久了，许多小伙伴做的更多的是利用搜索引擎，直接搜海康威视管理后台，然后拿弱口令一个个尝试，这样的话，第一个就是找到的后台管理地址不多，第二个就是一个个尝试，费时费力端口扫描器很多人都用过，一般都拿来扫指定IP段的3389，1433等等这些端口号，如果我们用它来扫描指定IP段的海康威视常用端口号，是不是就比我们上网搜来的方便？（而且，如果你知道某IP段内有你想看的监控，你还不一定能在网上搜到）通过一些调查，我们发现81号端口，海康威视的设备比较多（欢迎各位补充海康威视常用端口号），于是制定IP段开扫\n\n然后把扫描结果保存为TXT\n\n当然，这些结果有很多不是海康威视后台管理地址，而且有一些也不是弱口令，那怎么办呢？总不能一个个尝试吧，这时我们就可以借助某程序验证了将上一步保存的TXT导入某程序，让它带着帐号admin密码12345去一一尝试，效率自然很高\n\n然后，随便找个登一下（不过也有部分打不开）\n\n激动人心的时刻啊\n\n之前还有人能截到这样的，这TM摄像头装哪呢？\n以下该摄像头非海康威视··是其他摄像头。\n\n\n这样的\n\n还有这样的，亮点自寻\n\n真是醉晕了如此一来，只要指定了IP段和常用端口（我用的是81），就很有可能发现其中的海康威视设备，那么，你要做的就只有提供IP段就可能查看该段监控啦，那么想看什么地方，都可以碰碰运气了，医院，宾馆，学校等等确实危害较大，之前看过报道，部分海康威视设备被境外间谍组织监控，可能其中有部分组织用的就是该方式，可能还加了别的常用端口号，以及爆破admin帐号的密码，因为木有验证码，所以确实危险性很高，这些设备随时可能成为他人窥探我们的眼睛顺便一提，此方式亦可用于大华公司的监控设备，它的常用端口号也是81，帐号admin弱口令admin   漏洞证明：  上方图片可证，确实可登可看   修复方案：  1.个人想说此类监控的后台管理地址其实不应面向外网，甚至内网都不能完全面向，最好是内网中指定MAC设备才有权限访问，但考虑到这么做极其不方便，就不提了2.弱口令问题，admin和12345作为初始密码确实可以，但应该附加上“用户第一次登陆后，系统强行要求用户修改密码，否则无法进行下一步操作”，这样，弱口令就减少了3.大范围通知用户修改密码应该不可能了，但是涉及国家秘密的敏感用户最好通知到4.常用端口号能否经常变一变，无规律一些5.后台管理功能增加一个异地登录提醒，对于不常见IP地址登录，及时记录和反馈欢迎各位补充，大牛求轻喷   版权声明：转载请注明来源 路人甲@乌云\n ", "wybug_reply": "漏洞回应  厂商回应： 危害等级：低 漏洞Rank：1  确认时间：2015-08-24 09:05 厂商回复： 目前海康威视全线产品密码机制已经更改为首次使用强制更改密码，且有密码复杂度限制。涉及重要系统的设备通常有专门的网络维护人员定期修改密码，且不会映射到公网。 最新状态： 暂无  ", "replys": "漏洞评价：\n评论\n  \n\n\n", "wybug_level_fromcorp": "低", "wybug_rank_fromcorp": 1, "Ranks": null}