{"id": 31606, "wybug_id": "wooyun-2015-0113565", "wybug_title": "某大型期刊采编系统写信功能存储型跨站#ke可打管理cookie", "wybug_corp": "三才期刊", "wybug_author": "幻老头儿", "wybug_date": "2015-05-12 11:42", "wybug_open_date": "2015-08-13 18:38", "wybug_type": "xss跨站脚本攻击", "wybug_level": "高", "wybug_rank_0": "15", "wybug_status": "已交由第三方合作机构(cncert国家互联网应急中心)处理", "wybug_from": "http://www.wooyun.org", "wybug_tags": ["持久型", "打管理员"], "wybug_detail": "漏洞详情 披露状态：   \t\t\t\t\t\t\t\t\t2015-05-12：\t细节已通知厂商并且等待厂商处理中\t\t\t\t\t\t\t\t\t2015-05-15：\t厂商已经确认，细节仅向厂商公开\t\t\t\t\t\t\t\t\t2015-05-18：\t细节向第三方安全合作伙伴开放\t\t\t\t\t\t\t\t\t2015-07-09：\t细节向核心白帽子及相关领域专家公开\t\t\t\t\t\t\t\t\t2015-07-19：\t细节向普通白帽子公开\t\t\t\t\t\t\t\t\t2015-07-29：\t细节向实习白帽子公开\t\t\t\t\t\t\t\t\t2015-08-13：\t细节向公众公开  简要描述： 某大型期刊采编系统写信功能存储型跨站#ke可打管理cookie  详细说明：  三才期刊采编系统写信处，主题及正文存在存储型跨站http://www.samsoncn.com/   漏洞证明：  注册用户后进入投稿系统写信\n\n主题及正文加入xss脚本，收件人写管理员\n\n提交以后，xss脚本被解析\n\n\n\nxss平台上可接收到管理员的cookie\n\n国内多家高校及权威报刊受影响写信地址：Author/ZhZsendInfo.aspx?sid=信件读取地址manage/Readmessage.aspx?mid=清华大学学报(自科版) \t中国卫生经济中国科技大学学报 \t中国药理学通报西安交通大学学报(自科版) \t中国医院管理西安交通大学学报(医学版)　 \t中国初级卫生保健西安交通大学学报(社科版) \t中华神经外科疾病研究西安工业大学学报 \t中国修复重建外科杂志哈尔滨工程大学学报 \t中国普外基础与临床杂志　哈尔滨理工大学学报 \t中国呼吸与危重监护杂志哈尔滨医科大学学报 \t中国胸心血管外科临床杂志　中国安全生产科学技术 \t中国中医科学院中医药信息研究所弹道学报 \t中国医学文摘-中医中国病毒病杂志 \t国际中医中药杂志中国预防兽医学报 \t中国卫生统计黑龙江科技学院学报 \t创伤外科黑龙江畜牧兽医 \t临床小儿外科福州大学学报（自然版） \t应用科技东北林业大学学报　 \t医学分子生物学西北林学院学报 　 \t华西医学南京林业大学学报(自科版) \t心脏杂志南京林业大学学报(人文版) \t免疫学杂志昆明理工大学学报(理工版) \t生物医学工程学杂志昆明理工大学学报(社科版) \t现代检验医学杂志深圳大学学报（理工版）　 \t新疆农垦科技上海海洋大学学报 \t复旦大学浙江理工大学 \t郑州大学医学版浙江教育学院 \t郑州大学工学版浙江科技学院 \t燃烧科学与技术浙江海洋学院学报 \t浙江水利水电专科学校学报浙江海洋学院学报(人文社会版) \t上海金融学院学报浙江海洋学院学报（自然科学版） \t江西理工大学学报浙江水利科技 \t组织工程与重建外科杂志苏州教育学院学报 \t浙江电力苏州市职业大学学报　 \t江西电力杭州师范大学期刊中心 \t热力发电杭州师范大学学报(社科版) \t黑龙江电力杭州师范大学学报(自科版) \t内蒙古电力技术健康研究 \t内蒙古大学学报（自然科学版）美育学刊 \t内蒙古大学学报（社会科学版）南京林业大学学报（自科版） \t内蒙古财经学院学报西南林学院 \t现代预防医学中南林业科技大学学报 \t现代肿瘤医学南方医科大学学报 \t爆破器材大地构造与成矿学 \t陕西电力路基工程 \t仪表技术与传感器长安大学（交通运输工程学报） \t石油钻采工艺重庆师范大学学报(自学版) \t石油钻探技术四川师范大学学报(自科版) \t石油机械水文地质工程地质 \t焊管　燕山大学学报　 \t大庆石油地质与开发燕山大学学报(哲社版) \t断块油气田　燕山大学学报(教学研究) \t复杂油气藏船舶与海洋工程学报 \t鱼雷技术电机与控制学报 \t火炸药学报　武汉工程大学学报 \t弹箭与制导学报华中科技大学学报(医学版) \t固体火箭技术华中科技大学学报(英德文版) \t宇航学报山东体育学院学报 \t分子科学学报山东体育科技 \t江苏广播电视大学学报山东建筑大学学报 \t黄冈师范大学学报解放军理工大学学报 \t邮电设计技术解放军护理杂志 \t有色金属科学与工程第四军医大学学报 \t探测与控制学报第三军医大学学报 \t中国材料进展医学研究生学报 \t轻合金加工技术宁夏医科大学学报 \t森林工程遵义医学院学报 \t中州煤炭沈阳师范大学学报(自然版) \t重型机械沈阳师范大学学报(社科版) \t情报杂志沈阳大学学报 \t工商行政管理应用力学学报 \t智能系统学报智能系统学报 \t林业科技开发湖南农业大学（社会科学版） \t中华妇幼临床医学岳阳职业技术学院学报 \t粮食加工嘉兴学院学报 \t今传媒柳州职业技术学院学报 \t当代经济科学河南大学学报自科版 \t生物加工工程心理学探新 \t东南大学学报南京工业大学学报(自然科学版) \t工业加热南京工业大学学报(社会科学版) \t介入放射学杂志南京航空航天大学 \t实用放射学杂志东华理工大学学报（社会科学版） \t油气储运东华理工大学学报期刊社 \t纯粹数学与应用数学厦门理工学院学报 \t法律科学安徽大学学报二合一 \t动物营养学报安徽大学学报（哲学社会科学版） \t野生动物安徽大学学报（自然科学版） \t工程管理学报兰州理工大学学报 \t应用与环境生物学报天津大学期刊中心 \t广西工学院学报天津大学学报(自科版) \t广西植物天津大学学报(社科版) \t宁夏医学杂志中华脑科疾病与康复杂志 \t中药与临床空间电子技术 \t贺州学院学报安徽科技学院学报 \t淮南师范学院学报灾害学 \t甘蔗糖业南京农业大学学报 \t金融评论南京理工大学学报 \t地球环境学报镇江高专学报 \t牙体牙髓牙周病学杂志中国临床神经外科杂志 \t内江师范学院学报（自然版）中华脑科疾病与康复杂志（电子版） \t内江师范学院学报（社科版）内蒙古大学学报（哲学社会科学蒙古文版） \t传染病信息中国地震局 \t山地学报世界地震工程 \t自然灾害学报地震工程与工程震动 \t起重运输机械石化与橡胶杂志社 \t东北师范大学学报（自然版）现代中小学教育 \t东北师范大学学报（社科版）高分子通报 \t南京工业职业技术学院学报福建基础教育研究 \t中国微创外科杂志中国航海 \t上海船舶运输科学研究所学报厦门大学 \t水产养殖西部中医药 \t中国中医骨伤科杂志水产养殖 \t丝绸石化技术与应用 \t合成橡胶工业青岛大学医学院 \t齐鲁医学铜仁学院学报 \t中医眼耳鼻喉杂志内蒙古社会科学 \t有色金属设计红外技术 \t西部林业科学湖南城市学院学报 \t湖南城市学院学报（自然版）新疆石油地质 \t重庆师范大学学报（社会科学版）重庆师范大学学报期刊社 \t电力安全技术南京师范大学学报(工程技术版) \t南京师范大学学报(自然版)南京师范大学社科版 \t防灾科技学院学报湖北大学学报自科版 \t湖北大学学报社科版石油工业技术监督 \t榆林学院学报西安石油大学学报(社科版) \t西安石油大学学报（自然版）生物医学工程研究 \t西安理工大学学报电力电容器与无功补偿 \t测井技术高压电器 \t电瓷避雷器长安大学学报（自然版） \t南京林业大学学报（自科版)江苏农业科学 \t中华肺部疾病杂志广西林业科学 \t常熟理工大学学报中国地质灾害与防治学报 \t   修复方案：  过滤信件主题及正文敏感字符   版权声明：转载请注明来源 幻老头儿@乌云\n ", "wybug_reply": "漏洞回应  厂商回应： 危害等级：高 漏洞Rank：10  确认时间：2015-05-15 18:36 厂商回复： CNVD未直接复现所述情况，已经由CNVD通过网站公开联系方式向软件生产厂商及赛尔教育通报。 最新状态： 暂无  ", "replys": "漏洞评价：\n评论\n  \n\n\n", "wybug_level_fromcorp": "高", "wybug_rank_fromcorp": 10, "Ranks": null}