{"id": 81692, "wybug_id": "wooyun-2015-0153064", "wybug_title": "鹏博士集团大麦商城批量用户密码重置登入", "wybug_corp": "鹏博士集团", "wybug_author": "路人甲", "wybug_date": "2015-11-09 17:06", "wybug_open_date": "2015-12-24 17:08", "wybug_type": "网络设计缺陷/逻辑错误", "wybug_level": "高", "wybug_rank_0": "15", "wybug_status": "未联系到厂商或者厂商积极忽略", "wybug_from": "http://www.wooyun.org", "wybug_tags": ["逻辑错误"], "wybug_detail": "漏洞详情 披露状态：   \t\t\t\t\t\t\t\t\t2015-11-09：\t积极联系厂商并且等待厂商认领中，细节不对外公开\t\t\t\t\t\t\t\t\t2015-12-24：\t厂商已经主动忽略漏洞，细节向公众公开  简要描述： 大麦科技成立于2014年，是鹏博士集团旗下专注于智能产品研发、制造和销售的全资子公司。公司秉承“科技诠释爱”的产品和运营理念，依托集团广泛的宽带覆盖，致力于为用户提供全方位的智能终端产品服务。目前，大麦科技品牌先后涵盖了大麦分体电视、电视盒子、路由器和超级宽带。2015年初，大麦科技宣布上线B2C电商平台——大麦商城 （www.domyshop.com）。大麦商城是大麦系列产品唯一指定互联网官方销售平台。其中商品包含大麦分体电视、大麦盒子、大麦超级宽带和大麦路由器。鹏博士电信传媒集团股份有限公司（原名成都鹏博士电信传媒集团股份有限公司、成都鹏博士科技股份有限公司、成都工益冶金股份有限公司）成立于1985年1月，1994年1月3日，公司股票在上海证券交易所挂牌上市；股票简称：鹏博士；股票代码：600804，入选“沪深300指数”、“上证180指数”、“上证民企50指数”。鹏博士是以新一代光纤通信技术为基础，以宽带互联网接入服务、智慧城市、文化创意为主营业务的全民营企业，旗下企业包括长城宽带网络服务有限公司、北京电信通电信工程有限公司、北京宽带通电信技术有限公司等知名企业，注册资本13.82亿元人民币。 电信增值业务：公司专业从事基于互联网服务业务的电信增值服务业务，主要包括互联网专线接入、电子政务、互联网数据中心（IDC）、专网构建及运营以及网络安全监控、城市监控网络增值服务，目前拥有近两万公里的城域光纤网，在高端商业客户互联网专线接入、网吧专线接入、互联网数据中心业务均占有较高的市场份额。除进一步巩固和拓展现有的优势业务高端商业客户专线接入和互联网数据中心外，公司个人宽带业务目前已快速切入全国目标城市，加速宽带接入的全国布局，从而提升公司在宽带接入市场的影响力和市场份额。  智慧城市业务：公司安防监控业务主要围绕全国范围的平安城市建设项目开展业务，围绕以自主开发产品和独家代理产品为核心的产品体系的建设、销售和运营服务。公司重点建设了“平安北京”城市安防监控网络系统项目，即配合北京市公安部门，在北京市建成城市安防监控网络系统并负责后续的运营，该监控网络系统包括对内保单位提供监控摄像头安装、线路连接、资料存储、监控中心建设、维护服务、运营服务等。目前，公司充分利用积累的技术和运营经验，作为城市安防体系框架的搭建者，继续发展其他城市的安防监控业务和专项安全防护监控项目和业务。 文化创意业务：公司目前独家代理《成都商报》、成都电视台、《明日• 快一周》杂志，以及《成都晚报》、《成都日报》、《汽车时尚报》、成都电台环球资讯广播、成都全搜索网站等媒体的部分广告业务。未来，公司将依托独有的光纤网络资源，与公司现有的网络资源、数据图像及视频分发技术和业务相整合，进行网络媒体服务和内容传输业务，为用户提供视频业务服务，快速促进公司电信增值服务业务的拓展和客户资源的扩大。 公司所从事的电信增值服务、城市安防、网络传媒都是基于IP技术的互联网服务业务。随着我国经济持续稳步增长，居民对宽带和互联网的需求逐渐刚性化，目前我国互联网的普及率已经超过了10%的临界点，进入快速增长期，公司将紧紧抓住互联网产业升级的机遇、积极参与到“三网合一”、云计算、物联网的突破发展大潮流中，把公司打造成为集平台与应用于一身的综合业务运营商。 详细说明：  http://www.domyshop.com/找回密码，顺便输入验证码http://www.domyshop.com/user/foget.html\n\n\n\n修改成正确的响应包\n\n可以遍历id批量写个用户密码\n\n   漏洞证明：  找回密码，顺便输入验证码\n\n\n\n修改成正确的响应包\n\n可以遍历id批量写个用户密码\n\n   修复方案：  不知道   版权声明：转载请注明来源 路人甲@乌云\n ", "wybug_reply": "漏洞回应  厂商回应： 未能联系到厂商或者厂商积极拒绝  ", "replys": "漏洞评价：\n评价\n  \n\n\n", "wybug_level_fromcorp": "无影响厂商忽略", "wybug_rank_fromcorp": 0, "Ranks": null}