{"id": 32489, "wybug_id": "wooyun-2015-0111095", "wybug_title": "广西壮族自治区南宁市某系统弱口令(敏感信息泄漏)", "wybug_corp": "cncert国家互联网应急中心", "wybug_author": "朱元璋", "wybug_date": "2015-05-27 12:17", "wybug_open_date": "2015-07-16 11:12", "wybug_type": "内部绝密信息泄漏", "wybug_level": "高", "wybug_rank_0": "15", "wybug_status": "已交由第三方合作机构(cncert国家互联网应急中心)处理", "wybug_from": "http://www.wooyun.org", "wybug_tags": "", "wybug_detail": "漏洞详情 披露状态：   \t\t\t\t\t\t\t\t\t2015-05-27：\t细节已通知厂商并且等待厂商处理中\t\t\t\t\t\t\t\t\t2015-06-01：\t厂商已经确认，细节仅向厂商公开\t\t\t\t\t\t\t\t\t2015-06-11：\t细节向核心白帽子及相关领域专家公开\t\t\t\t\t\t\t\t\t2015-06-21：\t细节向普通白帽子公开\t\t\t\t\t\t\t\t\t2015-07-01：\t细节向实习白帽子公开\t\t\t\t\t\t\t\t\t2015-07-16：\t细节向公众公开  简要描述： 广西壮族自治区南宁市某系统弱口令，敏感信息泄漏 详细说明：  登录地址 https://sfglnanchong.nacao.org.cn/publish/299/index.html用户名为单位名称（如南宁市城市管理局，直接就输入南宁市城市管理局全称，初始密码为6个0   漏洞证明：  具体受影响单位：南宁市城市管理局南宁市市政工程管理处南宁市城市广场管理处南宁市人力资源和社会保障局南宁市人事考试管理办公室南宁市职业技能鉴定指导中心南宁市民政局南宁市流量仪表检测有限责任公司南宁市建筑管理处南宁市森林病虫害防治站南宁市林业技术推广站南宁市园林管理局南宁市水利局南宁市邕江防洪排涝工程管理处南宁市安全生产管理协会南宁市动物卫生监督所南宁市动物疫病预防控制中心南宁市植保植检站南宁市渔政渔港监督管理站南宁市国土资源局（含市国土资源执法监察支队）南宁市环境保护监测站南宁市司法局(公证处)南宁仲裁委员会秘书处具体送审单位南宁市第三职业技术学校南宁市第四职业技术学校南宁市工业和信息化委员会南宁市相思湖新区管理委员会广西壮族自治区上林公路管理局广西壮族自治区横县公路管理局南宁市第三人民医院南宁市妇幼保健院南宁市中医医院南宁市口腔医疗中心南宁市直属机关保育院南宁市非税收入管理局（原南宁市预算外资金管理局）南宁市工商行政管理局南宁市质量技术监督局南宁市农机安全监理所南宁市机械工业技工学校广西中华会计函授学校南宁分校中国共产党南宁市委员会党校南宁市卫生局南宁市医学会南宁市疾病预防控制中心南宁市第一人民医院南宁市第二人民医院南宁市盲聋哑学校南宁吴数德举重学校南宁市体育运动学校南宁外国语学校南宁市第一中学具体送审单位南宁市第四人民医院南宁市第五人民医院南宁市第六人民医院南宁市第七人民医院南宁市第八人民医院南宁市卫生学校附属医院（原南宁市第九人民医院）南宁市第四中学南宁市第五中学南宁市第八中学南宁市第九中学南宁市第十中学南宁市第十三中学南宁市第二中学南宁市第三中学南宁市第十四中学南宁市第十五中学南宁沛鸿民族中学南宁市第十九中学南宁市公安局 (含副本）南宁市公安局交通警察支队（含副本）南宁市人民警察训练学校南宁市红十字会医院南宁市食品药品监督管理局广西壮族自治区南宁食品药品检验所南宁青秀山风景名胜旅游区管理委员会南宁市第二十中学南宁市第二十一中学南宁市第二十四中学南宁市第二十六中学南宁市第二十八中学具体送审单位中国共产党南宁市委员会宣传部南宁市旅游局南宁市档案局南宁市统计局南宁市乡镇企业红砖质量检验站南宁市第二十九中学南宁市第三十三中学南宁市第三十四中学南宁市第三十六中学南宁市公路管理处南宁市道路运输管理处广西壮族自治区桂西公路管理局广西壮族自治区南宁江南公路管理局广西壮族自治区南宁江北公路管理局南宁市第四十一中学南宁市第四十二中学南宁市第四十三中学南宁市邕宁高级中学南宁市第一职业技术学校南宁市第六职业技术学校广西壮族自治区武鸣公路管理局广西壮族自治区邕宁公路管理局广西壮族自治区隆安公路管理局广西壮族自治区马山公路管理局广西壮族自治区宾阳公路管理局南宁市环境监察支队南宁市中级人民法院南宁市教育局南宁市招生考试院南宁市中小学卫生保健中心具体送审单位南宁市房屋产权交易中心南宁市房产管理局白蚁防治所广西南宁高级技工学校南宁职业技术学院南宁市卫生学校南宁市人民防空办公室南宁市城市建设档案馆南宁市国土资源档案馆南宁市林业局南宁市水产畜牧兽医局南宁市卫生监督所南宁市房屋安全鉴定所南宁市人口和计划生育委员会南宁市地方税务局南宁市国家税务局\n\n\n\n   修复方案：  自己看着办   版权声明：转载请注明来源 朱元璋@乌云\n ", "wybug_reply": "漏洞回应  厂商回应： 危害等级：中 漏洞Rank：7  确认时间：2015-06-01 11:10 厂商回复： CNVD确认并复现所述情况，已经转由CNCERT下发给广西分中心，由其后续协调网站管理单位处置。 最新状态： 暂无  ", "replys": "漏洞评价：\n评论\n  \n\n\n", "wybug_level_fromcorp": "中", "wybug_rank_fromcorp": 7, "Ranks": null}