{"id": 49531, "wybug_id": "wooyun-2014-078310", "wybug_title": "中国电信某定位系统存在默认密码且普通用户可以随意重置任意用户密码后台存储型xss，全国大量定位信息泄漏，可跟踪各种车辆人员", "wybug_corp": "中国电信综合平台开发运营中心", "wybug_author": "kttzd", "wybug_date": "2014-10-04 18:10", "wybug_open_date": "2014-11-18 18:14", "wybug_type": "用户资料大量泄漏", "wybug_level": "高", "wybug_rank_0": "20", "wybug_status": "已交由第三方合作机构(cncert国家互联网应急中心)处理", "wybug_from": "http://www.wooyun.org", "wybug_tags": ["用户敏感信息泄漏", "用户敏感数据泄漏", "平行权限"], "wybug_detail": "漏洞详情 披露状态：   \t\t\t\t\t\t\t\t\t2014-10-04：\t细节已通知厂商并且等待厂商处理中\t\t\t\t\t\t\t\t\t2014-10-11：\t厂商已经确认，细节仅向厂商公开\t\t\t\t\t\t\t\t\t2014-10-21：\t细节向核心白帽子及相关领域专家公开\t\t\t\t\t\t\t\t\t2014-10-31：\t细节向普通白帽子公开\t\t\t\t\t\t\t\t\t2014-11-10：\t细节向实习白帽子公开\t\t\t\t\t\t\t\t\t2014-11-18：\t细节向公众公开  简要描述：                  o o      o-o          o                   o              o | |      |  o         |                         o   o   o  | |     -O-   o-o   o-O     o  o o-o o  o |      \\ / \\ / | | |      |  | |  | |  |     |  | | | |  | |       o   o  | o o      o  | o  o  o-o     o--O o-o o--o                                                 |                                                       o--o       详细说明：      登录的时候最好使用ie浏览器，其他浏览器有的功能无法查看    北京电信LBS综合定位服务系统     地址:          http://219.143.8.99/besweb/                 有位基友之前测试出了  test123  123456    根据这个账户密码成功登录，但是这个账户利用价值很小。    在之前扫目录的时候曾经扫出过这个    http://219.143.8.99/besweb/admin/index.jsp    使用test123,123456登录后同时访问这个地址，点击用户管理，然后点击查询旁边的空白条。\n\n    然后看到一堆公司单位，随便找一个，这里选址新通救援  \n\n可以修改他的信息，同时上面有重置。\n\n    之前在看过这个系统默认密码是000000，然后找个用户(xtjy-dd)，登录到 http://219.143.8.99/besweb/  试试000000密码，错误。好的。再从新用test123,123456登录，点击重置。再登录，进来了。\n\n\n\n\n\n很多功能，发短信，拦截，设置电子围栏，24小时监控.    修改处一个xss\n\n\n\n\n\n遍历下用户名字（放出点）:xtjy-hwqhqhqhalfsunnanchenhaobjbzzczkytzkyt1cscsskdjxtsmcentermkwekt tljpwl jkygxmxhrsmdhjtjmyltjmtdrhxsm ftsmzrhisense test_dlwangxuxxywb单位名字:新通救援 奇华电子 南区局测试 北京北轴轴承有限公司 中科宇图天下科技有限公司 测试 出入境检验检疫局 北京京星泰商贸有限公司 电信集成公司 北京生泰尔生物医药有限公司 新通救援备份 深圳麦克维尔空调有限公司北京分公司 铁岭市京平物流有限责任公司 北京金凯越改性材料有限公司 北京密溪华然商贸有限公司 北京鼎合金通经贸有限责任公司 北京益龙腾经贸有限责任公司 北京天地人和兴商贸有限公司 北京发特商贸有限责任公司 信息业务部 北京泽天宇混凝土有限公司 最高人民法院 北京海福鑫商贸餐饮部1部 深圳泛华联合投资集团有限公司北京咨询分公司 美誉唐酒业 蔡继军物流公司测试 北京海福鑫商贸餐饮部 北京奥利发商贸中心 北京达威伟业物流 alsa 文京盛泰五金建材有限公司 北京阿波罗卡汽车服务有限公司 北京美丽美商贸中心 百度时代网络技术（北京）有限公司 北京盛世经典博大文化发展有限公司 东区局测试 北京市京新龙医药销售有限公司 北京世纪金鹏汽车租赁有限公司 北京雅速达商贸有限公司 北京安惠汽车配件有限公司 益家陈聪（北京）商贸公司 北京海福鑫商贸有限公司 昌平营业部 玖玖叁玖网络技术有限公司 北京电信 北京蓄润同创汽车服务有限公司 上海摩恩电气股份有限公司 北京京星泰商贸有限公司-市场督导 北京京星泰商贸有限公司-市场团购 北京京星泰商贸有限公司-市场部 北京京星泰商贸有限公司-营销 北京京星泰商贸有限公司-房山 北京京星泰商贸有限公司-通州 北京京星泰商贸有限公司-烟酒 北京电信演示 北京电信网络部 北京电信系统集成部 北京电信营销管理部 tlkg 北京海福鑫商贸餐饮部2部 北京海福鑫商贸商超分公司 北京海福鑫商贸商超分公司1组 北京海福鑫商贸司商超分公司2组 北京海福鑫商贸商超分公司3组 北京海福鑫商贸物流 北京海福鑫商贸客服 北京青花瓷酒业股份有限公司 北京东林华瑞商贸有限公司 北京翔龙新程物流有限公司 北京骏马客运有限公司 北京立海萱商贸有限公司 北京京星泰商贸有限公司-市场商超 河北讯成网络科技有限公司北京信息咨询分公司 北京福禄顺达食品有限公司 VA 山东分公司 山东二区 苍山峄城台儿庄 费县罗庄 淮阴泗阳 即墨莱西莱阳 济宁市区汶上兖州 胶州平度 连云港 涟水金湖洪泽楚州 蒙阴平邑 蓬莱龙口招远莱州栖霞 邳州新沂 青岛市区 曲阜泗水邹城 日照 荣成乳山海阳 沭阳 泗洪盱眙 郯城临沭莒南 威海市区文登 宿城宿豫 徐州市区睢宁铜山 烟台市区 盐城市区射阳东台大丰 沂南沂水 枣庄 山东三区 德州市区陵县齐河平原禹城 灌南滨海响水阜宁建湖 黄岛区 济南市区1长清 聊城市区 临沂市区兰山河东 滕州 山东一区 安丘高密 滨州市区博兴广饶利津 曹县牡丹区1 昌邑寒亭坊子 成武定陶 茌平东阿 单县牡丹区2 东明鄄城 东营市区河口垦利 肥城东平平阴 丰县沛县 高青桓台邹平 高唐莘县 冠县临清 惠民无棣阳信沾化 济南市区2章丘 济阳商河临邑 金乡鱼台 巨野嘉祥 莱芜新泰 临朐青州 宁津庆云乐陵 商丘 寿光诸城 泰安市区宁阳 潍坊市区昌乐 夏津武城 阳谷台前 郓城梁山 张店周村临淄淄川博山沂源 教育一区 临沂营养教育A 临沂营养教育B-停用 临沂营养教育C 临沂营养教育D 临沂营养教育E 连云港营养教育A 连云港营养教育B 日照营养教育A 徐州营养教育D 徐州营养教育A 徐州营养教育B 徐州营养教育C 徐州营养教育D-停用 徐州营养教育E-停用 聊城营养教育A 聊城营养教育B 聊城营养教育C 济宁西营养教育A 济宁西营养教育B 枣庄营养教育A 枣庄营养教育B 菏泽营养教育A-停用 菏泽营养教育B 菏泽营养教育C 菏泽营养教育D 菏泽营养教育E 菏泽营养教育F 泰安营养教育A 泰安营养教育B 泰安营养教育C 淄博营养教育A 淄博营养教育B 德州营养教育D 德州营养教育A 德州营养教育B 德州营养教育C 济南营养教育A 济南营养教育B 济南营养教育C 青岛营养教育A 青岛营养教育B 青岛营养教育C 青岛营养教育D 青岛营养教育E 青岛营养教育F 滨州营养教育A 东营营养教育A 潍坊营养教育A 潍坊营养教育B-停用 潍坊营养教育C 潍坊营养教育D 威海营养教育A 烟台营养教育A 烟台营养教育B 烟台营养教育C-停用 烟台营养教育D-停用 盐城营养教育A 盐城营养教育B 盐城营养教育C 淮安营养教育A 淮安营养教育B 淮安营养教育C 淮安营养教育D 济南营养教育D 济宁东营养教育A 济宁东营养教育B 威海营养教育B 其他 西北分公司 西北二区 兰州片区 西安片区 西北三区 安康东区 安康西区 白银片区 洛南片区 山阳片区 西北一区 宝咸片区 韩城片区 汉中片区 陇南片区 宁夏片区 天水片区 渭北片区 武威片区 张掖片区 教育一区 兰州营养教育A 兰州营养教育B 兰州营养教育C 西宁营养教育A 商洛营养教育A 汉中营养教育A 安康营养教育A 渭南营养教育A 宝鸡营养教育A 西安市区营养教育A 咸阳营养教育A 西安营养教育B 西安营养教育C-停用 西安营养教育D 西安营养教育E 吴忠营养教育A 银川营养教育A 延安营养教育A 平庆营养教育A 榆林营养教育A 河西营养教育A 河西营养教育B 河西营养教育C 天水营养教育A 陇南营养教育B 其他 西南分公司 西南二区 巴中1 巴中2 广元 西攀 西南三区 达州 涪陵1 涪陵2 广安 泸州1 泸州2 南充1 南充2 遂宁 万州 重庆郊县 重庆市区1 重庆市区2 重庆市区3 西南一区 成都郊县1 成都郊县2 成都郊县3 成都市区1 成都市区2 德阳 乐山雅安 眉山 绵阳 内江 宜宾 昭通 资阳1 资阳2 自贡 教育一区 成都营养教育A-停用 成都营养教育B-停用 成都营养教育C 成都营养教育D 成都营养教育E 成都营养教育F 成都营养教育G 成都营养教育H 绵阳营养教育A 绵阳营养教育B-停用 绵阳营养教育C 德阳营养教育A 德阳营养教育B 资阳营养教育A 资阳营养教育C 眉山营养教育A 眉山营养教育B 雅安营养教育A 南充营养教育A 南充营养教育B 南充营养教育C 巴中营养教育A 巴中营养教育B 广元营养教育A 广元营养教育B 遂宁营养教育A 遂宁营养教育B 广安营养教育A 广安营养教育B 广安营养教育C 乐山营养教育A 乐山营养教育B-停用 乐山营养教育C-停用 重庆市区营养教育A 重庆市区营养教育B 重庆市区营养教育C 重庆郊区营养教育A 重庆郊区营养教育B-停用 重庆郊区营养教育C 万州营养教育A-停用 万州营养教育B 万州营养教育C 自贡营养教育A 自贡营养教育B 自贡营养教育C 泸州营养教育A 泸州营养教育B 泸州营养教育C 宜宾营养教育A 宜宾营养教育B 宜宾营养教育C 宜宾营养教育D 昭通营养教育A 达州营养教育A 达州营养教育B 涪陵营养教育A-停用 涪陵营养教育B 涪陵营养教育C 涪陵营养教育D 攀枝花营养教育A 凉山营养教育A 其他 云贵分公司 云贵二区 安顺片区 毕节片区 贵阳片区 昆明片区 曲靖1片区 曲靖2片区 铜仁片区 云贵一区 滇西南片区 六盘水片区 黔东南片区 黔南片区 黔西南片区 遵义1片区 遵义2片区 教育一区 昆明外县营养教育A 昆明市区营养教育A 昆明市区营养教育B 昆明市区营养教育C 曲靖营养教育C 曲靖营养教育A 曲靖营养教育B 曲靖营养教育D 大理营养教育A 玉溪营养教育A 玉溪营养教育B 玉溪营养教育C 滇西营养教育A-停用 滇西营养教育B 贵阳市区营养教育C 贵阳市区营养教育D 贵阳市区营养教育E 贵阳市区营养教育A 贵阳市区营养教育B 遵义营养教育A 遵义营养教育B 遵义营养教育C 遵义营养教育D 遵义营养教育E 遵义营养教育F 遵义营养教育G 安顺营养教育A 安顺营养教育B 黔西南营养教育A 安顺营养教育D-停用 黔西南营养教育B 黔西南营养教育C 黔西南营养教育D 黔西南营养教育E 安顺营养教育C-停用 六盘水营养教育A 毕节营养教育A 毕节营养教育B 六盘水营养教育B 毕节营养教育C 毕节营养教育D 铜仁营养教育A 铜仁营养教育B 铜仁营养教育C 贵阳外围营养教育A 贵阳外围营养教育B 贵阳外围营养教育C 其他 北京嘉和顶新科贸有限公司 北京市政交通一卡通有限公司 VB-B6 客户1（测试） 北京电信系统集成部王丽萍 北京朝龙世纪广告有限公司 北京亚核通顺基础工程有限公司 4G手机测试 北京阳光福缘家政服务有限公司 北京天勤安捷技术发展有限公司 季度测试 北京全天候保险公估有限公司 北京圣庄科技有限公司全国都有。各种.最后再证明下重置了百度的账户  bdsdwl  密码000000从这里登录，直接点推出会退到管理员登录界面      http://219.143.8.99/besweb/    漏洞证明：  \n\n\n\n可以看一个人的轨迹\n\n利用功能太多...不搞了。   修复方案：  加强防范意识   版权声明：转载请注明来源 kttzd@乌云\n ", "wybug_reply": "漏洞回应  厂商回应： 危害等级：中 漏洞Rank：10  确认时间：2014-10-11 14:45 厂商回复：   最新状态： 暂无  ", "replys": "漏洞评价：\n评论\n     2014-10-04 18:13 |    \t\t袋鼠妈妈 \t\t\t( 普通白帽子  |\t\t\t        Rank:449 漏洞数:61        | 故乡的原风景.MP3)\t\t \n  简要描述里面是什么意思啊？    \n     2014-10-04 18:14 |    \t\tkttzd \t\t\t( 普通白帽子  |\t\t\t        Rank:191 漏洞数:15        | 淡定)\t\t \n  @袋鼠妈妈 额。。本来是ascii码的图案。。我去。。变什么东西了。。。    \n     2014-10-04 18:16 |    \t\t袋鼠妈妈 \t\t\t( 普通白帽子  |\t\t\t        Rank:449 漏洞数:61        | 故乡的原风景.MP3)\t\t \n  @kttzd 哈哈 我勒个去    \n     2014-10-04 18:16 |    \t\tscanf \t\t\t( 核心白帽子 |\t\t\t        Rank:1232 漏洞数:186        | 。)\t\t \n  路过    \n     2014-10-04 18:17 |    \t\tkttzd \t\t\t( 普通白帽子  |\t\t\t        Rank:191 漏洞数:15        | 淡定)\t\t \n  @scanf 嘿嘿    \n     2014-10-04 18:27 |    \t\t雷锋 \t\t\t( 路人 |\t\t\t        Rank:12 漏洞数:2        | 承接:钻井，架工，木工，电工，水暖工，力...)\t\t \n  XXOO？？？    \n     2014-10-04 18:32 |    \t\tkttzd \t\t\t( 普通白帽子  |\t\t\t        Rank:191 漏洞数:15        | 淡定)\t\t \n  @雷锋  ....    \n     2014-10-04 18:36 |    \t\t袋鼠妈妈 \t\t\t( 普通白帽子  |\t\t\t        Rank:449 漏洞数:61        | 故乡的原风景.MP3)\t\t \n  好漂亮的数字 Rank:77 漏洞数:7    \n     2014-10-04 19:29 |    \t\tscanf \t\t\t( 核心白帽子 |\t\t\t        Rank:1232 漏洞数:186        | 。)\t\t \n  @kttzd 这不是我给你那个？干的漂亮    \n     2014-10-04 19:37 |    \t\tkttzd \t\t\t( 普通白帽子  |\t\t\t        Rank:191 漏洞数:15        | 淡定)\t\t \n  @scanf 这种后台。越挖掘漏洞越多...    \n     2014-10-04 20:12 |    \t\t老和尚 \t\t\t( 普通白帽子  |\t\t\t        Rank:223 漏洞数:45        | 总有一天，我会骑着雨牛@'雨。踩着一哥@jan...)\t\t \n  标题真长    \n  \n\n\n", "wybug_level_fromcorp": "中", "wybug_rank_fromcorp": 10, "Ranks": null}