{"id": 43959, "wybug_id": "wooyun-2014-081131", "wybug_title": "某大型数据管理系统高危SQL注射+Getshell # 涉及上千所学校", "wybug_corp": "腾凤教务资源管理网", "wybug_author": "黑暗游侠", "wybug_date": "2014-10-30 15:32", "wybug_open_date": "2014-12-14 15:34", "wybug_type": "SQL注射漏洞", "wybug_level": "高", "wybug_rank_0": "20", "wybug_status": "已交由第三方合作机构(cncert国家互联网应急中心)处理", "wybug_from": "http://www.wooyun.org", "wybug_tags": "", "wybug_detail": "漏洞详情 披露状态：   \t\t\t\t\t\t\t\t\t2014-10-30：\t细节已通知厂商并且等待厂商处理中\t\t\t\t\t\t\t\t\t2014-11-03：\t厂商已经确认，细节仅向厂商公开\t\t\t\t\t\t\t\t\t2014-11-13：\t细节向核心白帽子及相关领域专家公开\t\t\t\t\t\t\t\t\t2014-11-23：\t细节向普通白帽子公开\t\t\t\t\t\t\t\t\t2014-12-03：\t细节向实习白帽子公开\t\t\t\t\t\t\t\t\t2014-12-14：\t细节向公众公开  简要描述： 安全是一个过程，而不是一个产品。 详细说明：  腾凤教育资源数据管理系统高危SQL注射+Getshell # 涉及上千所学校    一、全部功能实现网络化操作，上网就可实现从数据录入到结果显示、打印等功能。     二、强大的数据导入、导出：教师名册、任课安排、学生学籍、考试成绩等均可由Excel文档直接导入到系统，同        时从系统查询的各种结果可导出到Excel文档中。     三、形式多样的打印输出：排课生成的班级课表、教师课表、公共教室课表和学校总课程表，学生成绩及成绩分        析报表等均可从网上直接打印输出。     四、排课条件设置方便：可对上课地点、上课教师及上课时间实现多种形式的限制，轻松实现固定课、教研活动。     五、排课过程灵活多样：自动排课与手工调整可交替进行，教师之间可在线相互换课，实现全体教师参与排课。     六、课表运用独具风格：课表可显示教师姓名或班级、上下课时间；遇教师请假可以快速方便地设置代课教师。     七、功能更强的成绩录入：多考场同时录入成绩，让数据输入更快捷，输入过程智能化(通过输入学生姓名拼音声        母，快速定位输入点，根据总分数值自动移动输入点)、全屏编辑(支持键盘光标移动键)，令您爱不释手！     八、人性化的考试管理：从考试安排、考场设置、考场布置，监考教师安排等   漏洞证明：   #1  该系统通杀DBA注射，所有版本，ver5.0\\5.5\\6.0(最新版)：\n/web/datas/asp/msg_list.asp?lb_id=1\n官网演示：\nhttp://jw.lfyz.net/web/datas/asp/msg_list.asp?lb_id=1\n163个表，可跨库\n\n涉及上千所学校，小学、初中、高中都有涉足\n四川省：内江十二中   甘肃省：甘肃省瓜州县腰站子中   陕西省：汉中市第十五中学   陕西省：汉中市第八十八中学   湖北省：来凤旧司新平小学   湖北省：来凤县旧司乡官塘坳小   湖北省：活龙坪乡初级中学   贵州省：贵州织金中学   湖北省：沙道沟镇乐坪小学   湖北省：秭归县杨林桥镇中心小   　　　　漫水明德中心小学   广西省：北海市海城区第一小学   四川省：自贡市第二十二中学校   广东省：广东信宜中学   湖北省：秭归县屈原镇新滩小学   贵州省：织金县后寨中学1   　　　　织金县后寨苗族乡中学   　　　　郑州先锋学校1   河南省：郑州先锋学校   　　　　瓯海南白象中学   河南省：范县第一中学   浙江省：学智初级中学   江苏省：锡山高级中学   湖北省：咸丰县冠达实验中学   新疆省：乌鲁木齐市69   辽宁省：营口市高级中学   江苏省：常州信息职业技术学院   江苏省：堰桥高级中学   山东省：京博希望小学   山东省：青岛市机械技术学校   湖北省：咸丰县杨泗小学   湖北省：漫水乡洗车小学   湖北省：漫水中心小学   河南省：转楼乡第一初级中学   　　　　来凤县实验小学X   甘肃省：庆城县白马初中   　　　　温州大学拜城县实验高   新疆省：温州大学拜城实验高中   安徽省：无为县六洲初级中学   　　　　正大小学校   重庆省：正大中学学校   广东省：三乡镇理工学校   云南省：五华区红旗小学   湖北省：大冶市实验高中   河南省：河南省焦作二中   河北省：承德县第二中学   内蒙古省：和林一中你就看见可点   山东省：济宁十三中   广东省：深圳市碧头文武学校   广东省：汕头市玉新中学   云南省：宣威十二中   浙江省：嘉善县天凝中学   黑龙江省：明水县第二中学   浙江省：兰溪市马涧初中   湖北省：蕲春实验高中   云南省：西畴县蚌谷小学   贵州省：道真县民族中学   浙江省：温岭市城南中学   广东省：广州市白河镇小学   湖北省：广水第二高级中学   湖北省：漫水小学123   广东省：信宜市第六中学   江西省：江西省赣州十中   广东省：信宜市丁堡中学   湖北省：东流司小学   河北省：北戴河新区潮河小学   湖北省：来凤县绿水镇初级中学   贵州省：后寨苗族乡初级中学   广西省：百色市右江区龙川中学   云南省：鲁甸帝国大学   　　　　思源实验中学   海南省：思源高级中学   安徽省：太和县洪山小学   云南省：云南玉溪中卫小学   河南省：淮阳县城关镇回民中学   河南省：河南省淮阳县城关镇回   江苏省：如东县袁庄镇先民小学   山东省：郓城高级中学   江苏省：王王天坛地区   甘肃省：甘肃省民勤县东坝镇完   广东省：信宜市信宜中学   四川省：绵竹实验学校   吉林省：蛟河市前进乡九年制学   河南省：内乡实验高中   浙江省：温州市实验小学   湖北省：武汉市光谷第六小学   广东省：广州第17中学   山西省：乡宁县第一中学   四川省：绿盛实验学校   湖南省：龙凤教育中心   广东省：广州市第21中学   　　　　鹤峰国家重点职业中学   北京省：首都经济贸易大学   陕西省：陕西省铜川市耀州中学   湖北省：来凤县绿水中心小学   　　　　来凤县实验小学1   湖北省：来凤接龙中学   北京省：北京市第四中学   广东省：外国语学校   广西省：西化学校西化   天津省：华南技术学校   安徽省：庐江县郭河镇福元小学   湖南省：朱子山学校   重庆省：晏家实验小学校   上海省：职业中心学小   湖北省：武汉市新洲区汪集街程   江苏省：南京市营防中学   河北省：成安县第一中学   新疆省：焉耆县第二中学   广西省：广西桂东卫校 浙江省：浙江台州椒江振华中学   上海省：上海市山阳中学   山东省：山东中医药大学   湖北省：湖北省来凤县三胡小学   湖北省：华宝中心小学   河南省：洛阳市第四十中   　　　　兴港镇杨屋小学   广西省：兴港镇赤江小学   　　　　白豹镇楼坊坪中心小学   陕西省：吴起县白豹镇楼坊坪中   湖北省：绿水镇初级中学   贵州省：黔西南树德学校   贵州省：织金后寨中学   四川省：恩阳登科学校   　　　　忠县马灌镇小学校   重庆省：忠县马灌镇高洞小学校   安徽省：涡阳九中教育集团   湖北省：来凤县实验小学   湖北省：来凤县接龙中学   湖北省：旧司镇新坪小学   贵州省：平坝县红湖学校   浙江省：桐庐县横村初级中学   湖北省：漫水鱼塘小学   湖北省：大河镇观音小学   北京省：华北职业学校   湖北省：恩施旅游学校   云南省：龙陵县第二中学   湖北省：蕲春县实验小学   河南省：灵宝市第三小学   湖北省：红坪中心学校   浙江省：绍兴县中国轻纺城小学   甘肃省：广河县新民滩小学   浙江省：桐乡市城北小学   　　　　鲁甸县职业培训站   广东省：邓发纪念中学   　　　　华中职业学校   广东省：深圳市博伦职业技术学   广东省：深圳市南头中学   云南省：云南省宣威市得禄中学   湖北省：恩施市第三高级中学   河北省：高碑店三中   福建省：长乐湖南中学   贵州省：纳雍县百兴中学   湖北省：湖北省宣恩县椒园中学   　　　　咸丰县高乐山民族中学   浙江省：绍兴市袍江小学   广东省：珠海市第一中学   广东省：乐昌高级技术学校   云南省：昭通市昭阳第一中学   海南省：琼海市文市中学   河北省：辛集市世纪中学   贵州省：从江县斗里乡潘里小学   河南省：辉县市上八里镇中心学   广东省：惠州市二中   湖北省：湖北省天门市实验小学   新疆省：新疆且末县阔什萨特玛   　　　　鲁甸县职中   湖北省：宜昌市夷陵中学   湖北省：湖北省秭归县文化中学   广东省：广东信宜文垌小学   海南省：海南省农垦直属第一小   广东省：信宜市钱排镇竹垌小学   浙江省：嘉兴平湖全塘中学   广东省：广东省罗思中学   湖南省：桑植县第一中学   重庆省：重庆工业技师学院   江西省：兴国县樟木乡肖南小学   湖北省：麂子渡小学   湖北省：浠水兰溪中学   湖北省：大冶市第二实验小学   河南省：宜阳县韩城镇东关小学   山东省：官桥镇中心小学   云南省：鲁甸县水磨中学   浙江省：绍兴县柯岩中学   广东省：广东省上峰小学   重庆省：高占小学校   安徽省：安庆市舒州逸夫小学   湖北省：漫水乡小学   江西省：汇源爱心学校   　　　　贵州省织金县后寨中学   广东省：信宜市第九小学   湖北省：房县七河中学   湖南省：株洲县古岳峰镇金台小   内蒙古省：察右中旗民族学校   湖南省：吉首市排吼学校   　　　　涡阳花沟中心学校   广东省：罗定市大甲小学   安徽省：涡阳第二中学   贵州省：黄平县旧州镇中心小学   安徽省：打鼓山中学   江苏省：syrdzx   广西省：岑溪市海杰小学   　　　　大河镇大红希望小学   广东省：广东省信宜第三小学   福建省：建宁县里心中心小学   陕西省：渭城第一初级中学   黑龙江省：嫩江县第二中学   湖北省：栗溪实验学校   江苏省：建湖县第一中学   福建省：惠安岩峰中学   湖南省：常德市五中   江西省：瑞金市四中   甘肃省：朱王堡小学   江西省：谭畈中小学   　　　　衢州市东港学校初中   广东省：侨德花园小学   　　　　张家口七中   浙江省：慈溪育才中学   江苏省：沭阳如东中学   浙江省：衢州市东港学校小学部   安徽省：芜湖工商学校   河南省：安阳市滑县老庙中学 广东省：深圳水东小学   湖南省：株洲市十六中   安徽省：太湖县职教中心   浙江省：天台县赤城中学   浙江省：湖州第二小学   浙江省：新星第一完小   江西省：江西省乐丰中学   天津省：东方石油基地学校   江西省：江西省会昌县西江中学   黑龙江省：五常市私立万宝中学校   湖北省：戴氏教育培训学校   浙江省：陈屿古顺小学   贵州省：大方县鼎新乡水塘小学   黑龙江省：东北农业大学   　　　　河北衡水故城郑口中学   河北省：河北郑口中学   河北省：献县第三中学   海南省：海南城西中学   广东省：陈佛庇纪念学校   广东省：惠来县第二中学   陕西省：五台乡初级中学   陕西省：三原县龙桥中学   浙江省：平阳县水头镇第二小学   甘肃省：酒泉市西大街小学   内蒙古省：突泉中等职业技术学校   江苏省：泰兴市宁界小学   湖北省：鹤峰综合高中   湖北省：湖北鹤立高中   江苏省：宿豫张家港实验小学   黑龙江省：亚林一中学   山西省：运城向阳学校   河南省：现代双语实验学校   湖北省：来凤县大河中学   湖北省：来凤春晖学校   湖北省：百福司中学   湖北省：来凤教研室   云南省：景洪市五中   福建省：莆田渠桥第二中学   广西省：桂林明缘中学   河南省：新乡市开达学校   福建省：福州市第一中学   四川省：完全小学校   重庆省：重庆市杨家坪中学测试   贵州省：荔波中等职业技术学校   浙江省：温州职业技术学院学生   云南省：云南经贸外事职业学院   江苏省：南京理工大学   湖南省：龙山县皇仓中学   江西省：九江市湖口县付垄乡夏   云南省：云龙县民族职业高级中   浙江省：黄岩金贝学校   湖北省：漫水乡明德小学   广东省：陆丰市定壮广信学校   北京省：北京师范附小   湖北省：湖北监利县红城中学   贵州省：兴义十一中   甘肃省：会宁光华学校   福建省：晋江市金井镇围江学校   吉林省：扶余县陶赖昭镇第二中   河南省：虞城县明德小学   湖南省：长沙职业技术学院   湖北省：孝感曙光补习学校   湖北省：赤壁市蒲圻高中   湖北省：武汉市钢城第四中学   湖北省：恩施市第二中学   湖北省：湖北省咸宁鄂南高中   湖北省：湖北省襄阳市第二中学   湖北省：湖北咸丰一中   湖北省：孝感市启环寄宿学校   吉林省：延吉市中央小学   贵州省：黄冈实验学校   江西省：江西会昌实验学校   广东省：狮山镇招大学校   上海省：上海市易思教育培训中   湖北省：湖北省第二中学   湖北省：来凤县接龙中学   山东省：九户镇初级中学   宁夏省：固原市原州区黄铎堡镇   贵州省：贵州省贵阳市贵州大学   湖北省：湖北省钟祥市长寿一中   湖北省：武汉市情智学校   云南省：宣威市第九中学   北京省：学习一下cangua   　　　　黑龙江省第二技师学院   广东省：广东实验中学南海学校   吉林省：辽源市第五中学   江苏省：金坛市第三中学   湖北省：浠水县英才学校   湖北省：湖北省浠水县兰溪中学   山东省：平度市田庄小学   内蒙古省：包头三十三中   北京省：顺义区第一中学   云南省：云南弥勒庆来学校   江苏省：芦墟民工子弟学校   北京省：顺义第二中学   湖北省：仙桃市仙源学校   　　　　江苏南京22中   　　　　湖南省衡阳市南岳区实   安徽省：合肥市楼口小学   山东省：第22中学   山东省：临沂经济技术开发区第   福建省：泉州现代中学   四川省：四川省大竹中学   湖北省：湖北孝感一中   陕西省：宝塔区第四中学   云南省：鲁甸县陨石朱提文化传   　　　　瑞金市武阳中学1   陕西省：榆林市第七中学   北京省：定福庄三小   青海省：青海省平安县平安一中   浙江省：温州十四中   黑龙江省：哈尔滨江南职业技术学 云南省：景谷县第一中学   　　　　咸丰小村民族初级中学   江苏省：如东实验学校   河北省：河北定州二中   湖南省：耒阳市第三中   四川省：四川省江安中学校   贵州省：牛路口小学   新疆省：和静县高级中学   山西省：洪洞县第三中学   山西省：灵石县两渡中学   湖北省：大冶市还地桥镇金献小   河北省：西合营中学   贵州省：大方县马场镇老塘小学   重庆省：鱼池小学校   贵州省：贵州省安顺市凤凰小学   贵州省：九仓镇仁和小学   湖北省：咸丰杨洞初级中学   　　　　兴国县鼎龙中心小学   安徽省：宿松县阳光中学   湖北省：武穴市花桥小学   陕西省：眉县横渠中心小学   云南省：董干镇回龙小学   湖北省：楼台九年制学校   广东省：信宜市茶山小学   山东省：沾化富国三中   河北省：河北安新中学   广东省：封开县开明中学   湖北省：湖北浠水中学   湖北省：高乐山镇民族中学   云南省：镇雄县花山中学   云南省：楚雄紫溪中学   湖南省：低庄镇中心小学   甘肃省：建新路小学   浙江省：衢州东港小学   广东省：封开县南丰中学   四川省：南江县南江镇第二小学   福建省：福安市上白石   广西省：广西省宜州市德胜中学   安徽省：平岗中心学校   湖北省：利川市忠路镇初级中学   湖南省：桑植县澧源中学   广东省：广东省信宜市第六小学   广东省：广州卓越学校   浙江省：桐乡市第八中学   河北省：唐山长宁高中   广东省：happy小学   浙江省：湖州新兴小学   云南省：云南省鲁甸县茨院中学   云南省：云南省鲁甸二中   湖北省：漫水明德小学   四川省：武胜县万隆镇小学   浙江省：台州市黄岩区红太阳学   天津省：天津蓟县一小   江西省：鄱阳职教中心   福建省：福建省永泰四中   江苏省：兴化市戴泽初级中学   河南省：邓州城区五初中   安徽省：税镇中心学校   重庆省：沙坪坝区新发小学   重庆省：重庆市安达高中   黑龙江省：黑龙江安达高中   广东省：肇庆市端城小学   河北省：河北衡水市武强县实验   江西省：江西省西山学校   贵州省：贵州省织金县后寨苗族   四川省：金堂县淮口中学校   黑龙江省：黑龙江第二技师学院   浙江省：湖州第一小学   浙江省：湖州市新市小学   浙江省：衢州市东港学校   河北省：河北藁城市第九中学   河南省：郑州创新科技中等专业   安徽省：安徽省阜南县朱寨职高   云南省：玉溪市元江第二小学   河北省：七树庄学校   甘肃省：瓜州县广至藏族乡小学   湖南省：湖南通道县第一中学   辽宁省：喀左县十二德堡中学   湖北省：湖北省郧县二中   湖北省：湖北枣阳二中   上海省：基地附中第三中学   新疆省：特克斯县初级中学   云南省：云南省鲁甸县龙树中学   湖北省：宜昌金海学校   上海省：上海新曙光教育   西藏省：安多县中学   重庆省：重庆大学城第一小学校   河南省：河南理工大学   湖北省：公安县车胤中学   湖北省：利川市第五中学   陕西省：西安市育才中学   湖北省：九畹溪中学   上海省：上海第一中学   广东省：信宜市旺沙第一小学   河南省：董家河绿之风希望小学   湖南省：新晃县第一中学   甘肃省：甘肃省肃北县中学   山西省：山西省沁源中学   湖南省：祁东县白地市镇中学   广东省：广东清远连南民族高级   甘肃省：庄浪县通化乡中心小学   湖南省：张家界市国光实验学校   湖北省：咸丰县白水小学   湖北省：咸丰县白水坝小学   云南省：沧源城区小学   福建省：漳州市育才学校   湖北省：巴东神农溪高中   湖北省：应城市西河中学   重庆省：重庆市巫溪县尖山小学   湖北省：张港初级中学   广东省：汕头市阳光学校   新疆省：新疆县第中学 湖南省：湖南道县一中   　　　　无锡杨明小学   广东省：X私立学校   山东省：临淄区稷下街道中心小   上海省：奉贤南桥镇八校   四川省：内江东高技工学校   内蒙古省：内蒙古第十八中   　　　　东光县第一中学   广东省：深圳携创技工学校   湖南省：娄底华达学校   重庆省：重庆梁平中学   河北省：石家庄信息工程职业学   湖北省：长潭中心小学   湖北省：来凤县中等职业技术学   安徽省：安徽省蚌埠工艺美术学   河北省：永年县第六中学   宁夏省：宁夏青铜峡铝业学校   贵州省：贵州财经学院   山东省：jingying   湖北省：来凤第一中学   北京省：北京市政管理学校   云南省：鲁甸县第二中学   浙江省：永嘉县职业中学   河南省：洛阳市金榜教育中心   福建省：南安市成功中学   湖南省：汉寿龙池实验中学   广东省：台山市卫生职业技术学   江西省：上饶清林学校   广东省：台山市学业中学   　　　　呼市38中学   广东省：广东省翁源龙仙中学   湖北省：湖北省应城一中   江西省：江西省宁冈中学   甘肃省：天祝藏族自治县第一中   湖北省：云梦县道桥镇初级中学   陕西省：横山县第二中学   湖北省：湖北省恩施市龙凤初中   广东省：深圳市宝安区爱孚实验   山东省：山东省莱芜市凤城高中   山东省：山东省齐河县黄河中学   云南省：建水县第四中学   江苏省：无锡市育英实验小学   江西省：江西省信丰县虎山中学   四川省：三台县建平镇初级中学   山东省：邹城市第二中学   北京省：尚丽外国语学校中学部   广东省：普宁二中实验学校   江苏省：无锡信息学院   四川省：都江堰市石羊中学   广东省：深圳市南山区百旺学校   湖北省：来凤县第二中学   湖北省：上飞小学   江苏省：扬州数独学校   山东省：北陶中学   安徽省：东升高中   　　　　钟祥市实验中学   湖北省：旧口高中   广东省：广州市花都区英翔教育   重庆省：重庆杨家坪中学   广东省：惠州市外国语学校   湖北省：湖北创新学校   山东省：淄博淄川般阳中学   江苏省：响水县双语实验学校   湖北省：湖北省郧西县羊尾中学   湖南省：湖南省龙山县石牌镇中   贵州省：惠水县雅水中学   浙江省：衢江区职业中专   　　　　通城城关中学   山西省：古交二中   广东省：乐从中学   贵州省：贵阳市乌当区头堡小学   江西省：利村中学   湖南省：周南中学   湖南省：湖南澧县二中   贵州省：织金县后寨中学   山西省：000   　　　　赤壁市实验中学   广西省：秀全中学   广西省：柳州市四十七中   湖北省：枣阳市白水高级中学   湖北省：湖北省孝感市孝南区肖   内蒙古省：呼和浩特市第十八中学   内蒙古省：东方中学   　　　　金堂县五凤镇九年制学   　　　　呼和浩特市18中   北京省：教院附中   广东省：城郊中学   江苏省：海门市三厂中学   江苏省：石庄中学   黑龙江省：哈32中   广东省：广州市番禺区华南碧桂   福建省：福建西山学校   江苏省：滨海县振东乡板桥小学   山西省：南京   江西省：鼎龙中心小学   江西省：江西省吉安县登龙中心   湖北省：湖北巴东段德昌中学   北京省：康邦中学   湖北省：来凤县第一中学   安徽省：明信希望中学   广西省：天峨县向阳中学   安徽省：凤台县刘集乡山口小学   山西省：晋绥中学   广西省：资源大湾完小   内蒙古省：内蒙古呼和浩特市第十   广西省：大湾完小   重庆省：秀山新星中学   广东省：信宜市旺沙中心小学   广东省：广东信宜凤岗小学   湖南省：荆坪学校   安徽省：怀远县茆塘初级中学   山东省：新泰市天宝镇东峪联小   广东省：池洞镇大坡小学   广东省：电白县观珠中学   湖北省：旧司中学   湖北省：来凤县旧司中学   福建省：福建莆田连井中学   河北省：希望小学   安徽省：安徽霍邱周集中学   四川省：中江县通济中心学校   新疆省：库尔勒28团梨华中学   安徽省：太和县税镇中心学校   湖北省：兰溪中学   江苏省：东台市建筑工程学校   安徽省：太和县洪山镇中心学校   湖北省：大家看法   贵州省：道坪中学   云南省：富源爱心希望学校   湖北省：恩施市舞阳办事处猫儿   山东省：京华中学   　　　　仪陇实验二小   湖北省：湖北安陆第二高级中学   江苏省：镇江市恒顺实验小学   广东省：四会市苏东霖中学   广东省：东莞市光明学校   湖北省：湖北省公安县斑竹当镇   江苏省：江苏省泰州市海陵区苏   贵州省：市坪乡粗石完小   广东省：罗罅小学   广东省：普宁市大坝镇大坝小学   　　　　信宜市大成北梭小学   福建省：晋江市内坑镇甘棠小学   江西省：江西上饶县石狮学校   新疆省：梨华中学   山东省：山东省博兴县城东中学   江西省：弋阳县701学校   山东省：曲阜市书院街道办事处   福建省：福建省晋江市英林中学   福建省：仙游县度尾剑山小学   安徽省：安徽雷光中学   湖北省：旧司民族小学   江苏省：宿迁市实验学校   陕西省：五台中学   　　　　优捷（厦门）高中学校   四川省：四川省仁寿县北斗镇初   重庆省：重庆18中   云南省：澜沧一中   江苏省：泰兴市泰兴镇北城初中   海南省：冲坡中学   福建省：莲花小学   河北省：临漳县第四中学   四川省：三台一中   河北省：河北省吴桥县何庄学区   新疆省：新疆二中   福建省：福鼎一中   重庆省：铁桥中学   重庆省：晏家中学   河北省：郑章中学   福建省：仙游县度尾中学   河北省：石家庄市第三十二中学   福建省：尤溪县埔头小学   四川省：青神县西龙镇观金学校   浙江省：百步中学   内蒙古省：清河中学   重庆省：重庆市巴南区鱼洞第五   贵州省：洛邦中学   北京省：鲁甸茨院中学   江苏省：江苏省连云港市东港小   四川省：青神县汉阳镇学校   四川省：四川省遂宁市解放小学   河北省：河北邯郸市峰峰矿区   广东省：番禺区沙湾镇华阳初级   天津省：大黄堡乡朝阳里小学   湖北省：来凤春晖学校初中部   四川省：四川省电子商务学校   贵州省：都匀洛邦中学   　　　　南京市金陵中学   安徽省：肥东一中   云南省：高新一中   贵州省：贵州省册亨县冗渡中学   贵州省：冗渡中学   江西省：长征   四川省：天府中学   新疆省：新源县高级中学   山西省：山西洞儿沟建华小学   北京省：清华附中   甘肃省：西北师范大学实验中学   云南省：楚雄市西舍路中学   河北省：沽源县职中   河北省：沽源县职业技术教育中   山东省：青岛29中   北京省：喜洋洋小学   上海省：崇明合兴中学   湖南省：烽火中学   福建省：admin   四川省：后海中学   四川省：成都理工大学   　　　　11   北京省：实验中学test   云南省：河南职业技术学院   湖北省：职教中心   湖北省：湖北省大冶市第一中学   陕西省：彬县中学   浙江省：慈溪中学   甘肃省：甘肃环县环城初中 建省：明强中学   湖北省：一中   湖北省：涧池中学   天津省：千里堤   河南省：孟州市第一个高级中学   福建省：福州一中   黑龙江省：哈尔滨教育   广东省：荔湾体校 贵州省：盐仓一小   上海省：上海明星学校   江西省：上高敖阳小学   广东省：信宜市旺沙中心小学幼   河南省：河南伊川槐庄学校   湖北省：来凤县大河镇初级中学   湖北省：武汉第5中学   湖北省：武汉寄宿亚纶高中   湖北省：武汉市第1特中   湖北省：武汉居仁学校   湖北省：来凤县第一中学   四川省：实验初中   湖北省：随州市第一中学   山东省：历城双语   广东省：台山一中   湖北省：利川市第四高级中学   山东省：青岛人民路小学   广东省：东莞电大   湖北省：来凤县高级中学   山西省：太原十七中   广东省：来高   云南省：鲁甸职中培训办   四川省：绵阳东辰国际高中   贵州省：金阳新区第二试验学校   江西省：横市镇中心小学   北京省：学生王国   河南省：河南省新乡市北街小学   广东省：汕头金山中学   浙江省：浙江一中   湖北省：湖北省英山县第一中学   宁夏省：市十四中   四川省：成都七小   贵州省：排调中学   贵州省：贵州省织金县后寨中学   云南省：得禄中学   广东省：大埔县虎山中学   陕西省：西铁三中   四川省：华兴中学   四川省：高台中学   山东省：历城区华山镇还乡店小   湖南省：湘潭教育学院   广东省：教育小学   浙江省：衢州学院   河北省：石家庄实验小学   河北省：河北容城中学   广西省：桂平市中沙二中   北京省：dddd   河南省：偃师市府店镇西口孜小   甘肃省：西洞   江西省：二中   　　　　旧司乡黄土小学   山东省：康成中学   四川省：观金学校   江西省：兴国县鼎龙乡中心小学   四川省：青神县西龙初级中学   四川省：青神县河坝子小学   　　　　山东省蒙阴县第二中学   广东省：中垌第二小学   贵州省：燎原镇中心学校   江西省：兴国鼎龙中心小学   贵州省：桐梓县燎原镇中心学校   四川省：荣丁镇中学校   云南省：昭阳区太平中学   贵州省：后寨初级中学   贵州省：后寨中学   湖北省：建始县龙坪中学   四川省：沐川中学校   浙江省：龙沙乡辅导中心学校   山东省：洪绪镇苗庄小学   浙江省：瑞安市塘下四小   江西省：向阳中心小学   河南省：许昌区实验小学   江西省：庄口中心小学   山东省：龙口市实验小学   　　　　广西昭平二小   四川省：三桥中心校   广东省：北界中学   广东省：汕头市潮阳南侨中学   辽宁省：新兴小学   湖南省：宁乡巷子口中学   江苏省：江苏省赣榆县海头中心   湖北省：兰   江苏省：沭阳神舟学校   河南省：安阳县三中   湖北省：郧西县第一中学   辽宁省：铁岭市第七初级中学   湖北省：盛康三中   浙江省：青田县船寮镇初级中学   宁夏省：青铜峡第三中学   四川省：江三中   山东省：夏庄小学   山东省：山东临沂第五中学   浙江省：浙江省杭州市桐庐县江   山东省：韩庄二中   海南省：琼海市大路中学   安徽省：太和县洪山中心学校   山东省：山东郯城县美澳学校   湖北省：忠路初中   江西省：敖阳小学   河北省：河北冀州中学   湖南省：油市小学   广东省：恒大附小   吉林省：长春市第二实验中学   浙江省：缙云县丹址小学   湖北省：湖北省浠水县创业学校   湖北省：黄石市中山小学   河南省：郑州98中   湖南省：邵东职业中专   湖北省：大河镇   江西省：永丰县实验学校   江西省：鼎龙乡中心小学   河北省：肃宁县尚村中学 江苏省：陆慕   云南省：鲁甸县乐红中学   甘肃省：园子中学   云南省：鲁甸第二中学   　　　　茨院中学   四川省：宣汉县南桥初级中学   四川省：宣汉县南桥中学   广西省：广西平果县第二中学   山东省：光明路小学   重庆省：奉节县甲高镇中心小学   云南省：鲁甸县文屏镇中学   广东省：广东省佛山市元甲学校   　　　　万载职业技术学校   广东省：gdyz   四川省：泸州老窖天府中学   四川省：城堰中学   　　　　新疆新源县第三中学   广东省：广东省实验中学   山东省：邹城市中学   辽宁省：大连十二中学   北京省：小雷职业中学   江西省：全南县第二中学   四川省：成都市五十七实验学校   安徽省：蒙城四中   黑龙江省：哈尔滨高中   甘肃省：清水县第三中学   陕西省：白河县职教中心   江西省：江西宜春三中   云南省：宣威市宝山一中   北京省：某某某中学   浙江省：sfyz   福建省：福安七中   江苏省：南蒋小学   福建省：长乐一中   黑龙江省：华威中学   湖北省：恩施市第一中学   贵州省：贵阳市花溪区燕楼中学   海南省：东营小学   广东省：测试使用   云南省：鲁甸县茨院中学   广东省：广东中学   湖北省：测试学校学校学校   福建省：福建省尤溪县第四中学   河南省：尉氏高中   湖北省：鹤峰县职教中心   云南省：宣德中学   安徽省：亳州一中   福建省：福州三中金山校区   云南省：鲁甸县职业技术高级中   新疆省：胡萝卜学校   山东省：彩石镇大龙小学   浙江省：惠民小学   广西省：高安乡高台小学   新疆省：新疆新源县第二中学   广东省：和平县阳明镇中洞小学   江西省：安远镇岗中心小学   福建省：上白石中心小学   江苏省：高邮市龙虬镇中心小学   江西省：于都天润实验学校   云南省：鲁甸县第一中学   云南省：云南省鲁甸县第二中学   云南省：鲁甸县桃源中学   湖南省：安仁二中   四川省：四川省仁寿县华兴中学   山东省：LC实验学校   河北省：曲阳县第二中学   湖南省：龙溪小学   浙江省：周浦中学   江西省：新余小学   陕西省：宝鸡市龙泉中学   陕西省：宝鸡市宝平路中学   北京省：虎峪中学   广东省：广东信宜一中   四川省：绵阳五中   山西省：阳城锦华学校   福建省：厦门实小   山西省：山西省阳泉市荫营中学   广东省：ytyty   四川省：洪雅县第一小学校   湖北省：观城坡高中   浙江省：上林中学   江西省：陶瓷学院高中部   北京省：北京长得中学   湖南省：邵阳市高级技工学校   广东省：广东实验中学   江苏省：联合中心小学   内蒙古省：农大附中   湖南省：禾梨坳乡学校   湖南省：冷水溪小学   浙江省：萧山区党山镇中心小学   山东省：东营市胜利河口第二小   山西省：太原市第二实验中学   湖南省：凤凰县禾库九年制学校   黑龙江省：124中学   贵州省：凯里市青曼小学   　　　　test   上海省：asdfsfa   湖南省：罗岩中学   贵州省：金小   贵州省：扁担山中学   山东省：莱芜市综合高中   山西省：山西省保德县南河沟中   陕西省：长武县灵凤小学   广东省：博雅小学1   广东省：广州市天河区博雅小学   广东省：海丰县公平镇中心小学   四川省：旺苍县白水镇中心小学   贵州省：绥阳县青杠塘镇辽远小   福建省：福建省福   重庆省：重庆长寿双龙中学   山东省：shuangyuxu   安徽省：安徽梓里中学 广东省：太平中心校   山西省：介休张兰二中孙村学校   江苏省：joke   　　　　南宁市三美学校   四川省：滥坝乡中心校   　　　　四川省资中县高楼中学   福建省：武平县湘村小学   　　　　999999   湖北省：鹤峰县实验小学   北京省：定福庄中学   湖南省：芷江县水宽中学   安徽省：新丰小学   江苏省：南芹小学   山东省：柳埠镇中心中学   河南省：商丘市一高   湖北省：南河中学八年级   湖北省：大红希望小学   湖北省：来凤县实验中学   福建省：惠安苍湖学校   湖北省：南河中学   湖北省：黄冈市育英学校   内蒙古省：清水和县第一中学   江苏省：神州大学校   山东省：平邑县郑城镇中学   江苏省：神舟学校   湖北省：蕲春县实验中学   山东省：山东省桓台第一中学   青海省：河北小学   浙江省：义亭中学   山东省：大名路小学   浙江省：武义县职业技术学校   山东省：历城双语实验学校   山东省：临淄区第四中学   内蒙古省：毓灵私立小学   山西省：山西省介休市张兰二中   河南省：汝阳二高   云南省：云南省大理市下关二中   吉林省：长春市希望高中   河北省：河北石家庄市第十五中   内蒙古省：海勃湾第六小学   海南省：海南陵水县民族中学   北京省：北京胡同小学   　　　　恩城中学   河南省：五亩乡第一初级中学   河南省：白马镇春蕾中学   山东省：双语-jn   山东省：双语学校   山东省：柳埠一中   安徽省：安徽省蚌埠第二中学   四川省：乐山市振兴中等职业学   安徽省：安庆电子职业技术学校   山东省：山东省滕州市实验小学   河南省：济源市北街小学   浙江省：杭州新华小学   新疆省：石河子第五中学   四川省：四川省中江县广福中学   广东省：东莞市厚街小学   广东省：河源市源城外国语学校   江苏省：南京市财经学校   　　　　ff   福建省：漳州八中   吉林省：扶余县第四中学   江西省：安源区第三学校   河北省：秦皇岛市第五中学   福建省：仙游县枫亭溪北小学   山东省：潍坊十三中   江西省：龙溪县第一中学   甘肃省：甘肃陇南市宕昌县沙湾   上海省：同济大学沪西学院   浙江省：白峰中学   　　　　测试学校   江西省：山前中心小学   湖南省：洪江芙蓉中学   广东省：新村小学   广东省：博雅小学   江苏省：常州武进卜弋小学   广西省：广西容县灵山镇   湖北省：湖北省麻城市祠堂铺中   江苏省：常州市武进区卜弋小学   北京省：天水农业学校   安徽省：安徽歙县杞梓里中心学   陕西省：陕西省榆林中学   湖南省：新店坪中学   辽宁省：宽甸一中   山东省：泰安市董白塔小学   　　　　吉林大学   吉林省：德惠一中   湖北省：巴东县第三高级中学   广东省：中山市小榄镇蓝田小学   山东省：平度艺术中学   河南省：濮阳市实验中学   河北省：邢台英华中学   江西省：yiongfong二   广西省：五通中学   山东省：山东省东明县城关二中   湖南省：湖南省芷江侗族自治县   河南省：春光高中   江苏省：江苏省仪征中学   河南省：安阳二中   湖北省：钟祥南湖中学   湖北省：鹤峰县中等职业技术学   重庆省：重庆市梁平中学   广东省：中国小学   四川省：泸州市第二中学校   湖北省：茶店小学   广东省：教育城小学   四川省：洪雅一小   广东省：广州市荔湾区芳华初级   河南省：濮阳市油田十九中   湖北省：来凤县漫水民族中学   四川省：四川省泸州市第二中学   江西省：江西省永丰县第二中学   广东省：广州市晓园中学   湖北省：来凤一中\n#2 该系统通杀GetshellSA注射可列网站目录，原始路径\n\n列完物理路径直接可写shell\n\n\n\n查学籍、改分、学生信息、教师信息、学校系统全部有了   修复方案：  整体加固，厂商别忘记评rank！！！！先评再修复。   版权声明：转载请注明来源 黑暗游侠@乌云\n ", "wybug_reply": "漏洞回应  厂商回应： 危害等级：高 漏洞Rank：10  确认时间：2014-11-03 17:54 厂商回复：   最新状态： 暂无  ", "replys": "漏洞评价：\n评论\n  \n\n\n", "wybug_level_fromcorp": "高", "wybug_rank_fromcorp": 10, "Ranks": null}