{"id": 78148, "wybug_id": "wooyun-2015-0161065", "wybug_title": "赫尔墨斯系统有限公司从管理员账户到财务部总监账户沦陷（众多信息泄露）", "wybug_corp": "赫尔墨斯系统有限公司", "wybug_author": "路人甲", "wybug_date": "2015-12-14 20:44", "wybug_open_date": "2016-01-28 17:10", "wybug_type": "敏感信息泄露", "wybug_level": "高", "wybug_rank_0": "10", "wybug_status": "已交由第三方合作机构(cncert国家互联网应急中心)处理", "wybug_from": "http://www.wooyun.org", "wybug_tags": ["敏感信息泄露", "错误信息未屏蔽"], "wybug_detail": "漏洞详情 披露状态：   \t\t\t\t\t\t\t\t\t2015-12-14：\t细节已通知厂商并且等待厂商处理中\t\t\t\t\t\t\t\t\t2015-12-18：\t厂商已经确认，细节仅向厂商公开\t\t\t\t\t\t\t\t\t2015-12-28：\t细节向核心白帽子及相关领域专家公开\t\t\t\t\t\t\t\t\t2016-01-07：\t细节向普通白帽子公开\t\t\t\t\t\t\t\t\t2016-01-17：\t细节向实习白帽子公开\t\t\t\t\t\t\t\t\t2016-01-28：\t细节向公众公开  简要描述：     成都赫尔墨斯科技有限公司是由技术专家团队和投资专业人士共同设立的高科技企业。公司技术团队拥有十余年航空工程开发和服务经验，汇集了航空工程、仿真技术、云计算等多个领域的高新技术人员；并拥有CAAC（中国民航局）和FAA（美国联邦航空局）职业飞行员，确保航空领域的产品符合国际标准。现阶段主要运营两大业务板块：航空深度定制系统业务与Live Earth 3D视觉云业务。为中航工业集团、蓝光发展等上市企业提供技术服务。      航空深度定制系统业务      综合航空电子系统产品：可为老机型改造、（固定翼、旋翼）通航飞机、LSA（轻型运动飞机）提供先进的全套综合航电系统，并符合FAA、CAAC目视飞行（VFR）及仪表飞行规则（IFR），可完成飞行规划及导航；满足精密进近和非精密进近要求、民用级陆空通话需求等；      航空导航数据库产品：公司作为美国波音公司旗下JEPPESEN公司的中国区域战略合作伙伴，可为中国用户提供融合全球认证及国内自主开发的航空导航数据服务，以确保飞行安全；      航空电子仿真测试产品：包括自主开发的实时仿真计算机系统、DDS通讯协议、仿真虚拟仪表、气动数据包、视景系统等；      试飞适航服务：公司在美国拥有固定的试飞基地及FAA适航专家队伍，可提供全套满足中、美局方要求的改装、试飞服务，满足国内外的适航取证、托管、航权申请、飞行员调配、FBO、试飞展示等综合需求，确保客户的产品更加完善并与国际航空标准接轨；      无人机控制系统：提供包括飞行平台、数据链和地面指挥控制站的综合一体化解决方案，并在指挥系统中引入了云计算技术，全面提高系统的容灾能力、信息处理能力及信息交互能力。同时，与法国Schneider（施耐德）公司签订战略合作协议，成为其航空业务板块的战略合作伙伴，采用Schneider的移动方舱，可为无人机控制系统提供更卓越的整体解决方案；      飞机模拟器：可提供训练用和工程研发用两大类飞行模拟器，广泛用于各类训练和科学实验。      “Live Earth” 3D视觉云业务      Live Earth 3D视觉云平台是赫尔墨斯自主研发，依托“3D即时渲染”引擎，融合了云计算技术，创新出的基于大数据和神经网络多场耦合的全新PAAS平台。它能为各类客户端（IOS、安卓、WIN）提供强大的“3D即时渲染”服务，但并不消耗这些设备本身的GPU资源，这为未来的AR、VR可穿戴设备的普及，提供了先决条件。公司成功研发出中国第一套“3D离屏渲染”云系统，为华西医大再生中心的3D生物打印提供强大IT支撑，公司也因此系统的成功应用被《互联网周刊》评选为中国互联网“渲染云”领域的第16位。      未来Live Earth将发展成一个可为在线购物、产品展示、游戏、社交等应用提供“所见即所得”卓越体验的3D云平台。              赫尔墨斯秉承“立志高远，技术成就梦想”的企业宗旨，在我们专长的领域不断为客户、员工、投资者、社会创造价值的同时，力求推动人类科技进步！ 详细说明：  \n\n**.**.**.**/seeyon/main.do?method=main管理员账户admin 123456\n\n\n\n\n\n\n\n财务部总监fei.liu 123456\n\n\n\n   漏洞证明：  同上   修复方案：  修复   版权声明：转载请注明来源 路人甲@乌云\n ", "wybug_reply": "漏洞回应  厂商回应： 危害等级：中 漏洞Rank：8  确认时间：2015-12-18 16:33 厂商回复： CNVD确认所述情况，已由CNVD通过网站管理方公开联系渠道向其邮件通报，由其后续提供解决方案。 最新状态： 暂无  ", "replys": "漏洞评价：\n评价\n  \n\n\n", "wybug_level_fromcorp": "中", "wybug_rank_fromcorp": 8, "Ranks": null}