{"id": 68068, "wybug_id": "wooyun-2015-0141791", "wybug_title": "2014年重庆互联网大会网后台弱口令泄漏全国企业高管信息", "wybug_corp": "cncert国家互联网应急中心", "wybug_author": "我不是大神", "wybug_date": "2015-09-19 21:10", "wybug_open_date": "2015-11-05 17:02", "wybug_type": "基础设施弱口令", "wybug_level": "高", "wybug_rank_0": "20", "wybug_status": "已交由第三方合作机构(cncert国家互联网应急中心)处理", "wybug_from": "http://www.wooyun.org", "wybug_tags": ["弱口令"], "wybug_detail": "漏洞详情 披露状态：   \t\t\t\t\t\t\t\t\t2015-09-19：\t细节已通知厂商并且等待厂商处理中\t\t\t\t\t\t\t\t\t2015-09-21：\tcncert国家互联网应急中心暂未能联系到相关单位，细节仅向通报机构公开\t\t\t\t\t\t\t\t\t2015-10-01：\t细节向核心白帽子及相关领域专家公开\t\t\t\t\t\t\t\t\t2015-10-11：\t细节向普通白帽子公开\t\t\t\t\t\t\t\t\t2015-10-21：\t细节向实习白帽子公开\t\t\t\t\t\t\t\t\t2015-11-05：\t细节向公众公开  简要描述： 2014年重庆互联网大会网的后台为弱口令，泄漏全国企业高管信息，涉及阿里巴巴，新浪网，百度，搜狐，盛大网络，爱奇艺,搜狗，西部数码，360，猪八戒网数千家企业高管电话号码，邮箱，QQ。 详细说明：  \n网站后台地址：http://**.**.**.**/Admin/Public/login.html\n\n帐号：admin 密码admin\n详细涉及的企业有：重庆赛克赛斯科技有限公司分众传媒重庆分公司重庆亨特斯猎头公司（摔迷之家网站站长）奉节生活网重庆老年信息网江苏蟹蟹团大闸蟹有限公司酷汇网成都银码商贸有限公司重庆百卓网络科技有限公司360巫山信息网重庆肯迪科技有限公司重庆哥鹏科技有限公司新疆买买提大叔科持有限公司重庆婚庆网重庆新之业网络发展有限公司十八梯社区重庆掌龙科技有限公司重庆汇度电子商务有限公司重庆七鱼科技有限公司重庆艾普网络重庆爱奇网络科技有限公司重庆迈配信息技术有限公司魅力重庆论坛重庆珉影影视传媒重庆正大软件职业技术学院重庆溜网信息技术有限公司重庆麦络科技有限公司重庆淘邦电子商务有限公司重庆卓腾科技有限公司重庆尚群科技有限公司重庆美尔投资有限公司微营佳重庆立可印科技有限公司四川省艾普网络重庆深联电子信息有限公司重庆必看科技有限公司重庆微典互联网技术有限责任公司重庆国利通信有限公司贝金京网络重庆炎培网络科技有限公司中国建筑英才网重庆龙在科技有限公司重庆宇泽文化传播有限公司重庆市忠县忠州新闻网重庆壹心壹学校茶竹永川网重庆知首科技有限公司重庆网信文化传播有限公司重庆猪八戒网络有限公司渝中区互联网创新发展促进会重庆协作网络科技有限公司重庆雷驰广告传媒有限公司重庆网之源信息技术开发有限公司渝北论坛镇江市广源网络科技有限公司北京智推网络技术有限公司重庆正大集团四川中森绿卡商务服务有限公司上海智推广告传媒有限公司重庆市罗云科技有限公司香港纵横国际传媒集团大学生重庆君领中外企业家俱乐部重庆萨拓科技有限公司四川商通实业有限公司重庆分公司西部数码重庆叁壹伍捌信息技术有限公司健康安全网国药控股重庆有限公司苏州新科兰德科技有限公司/**.**.**.**重庆伯克利科技有限公司重庆本逸生物科技有限公司重庆门马通信重庆软晨科技有限公司话语科技重庆日日月月科技重庆丁甲科技有限公司永川美食网聚缘传媒有限公司重庆和济医药有限公司中国幼儿园网重庆谷恩科技有限公司重庆正大传媒掌宝科技秀山县秀山在线酷易搜云南迪米盒子科技有限公司渝中区互联网产业创新发展促进会酉阳在线重庆柯众文化传播有限公司秀山在线重庆好借好还贷款信息咨询有限公司名在线重庆惠普完美在线绵阳环泰科技有限公司三台在线云阳在线重庆资讯网重庆舰创科技正大英文巴士网宜宾装饰网重庆讯酷科技广州道尚网络科技有限公司四川和易网络科技有限公司呱呱视频重庆圣勋广告传媒有限公司重庆伯客科技有限公司洛阳恒泰网络科技有限公司重庆楷亚投资有限公司嗨淘网络科技有限公司娄雷网络科技有限公司重庆慧学科技有限公司28推重庆贷款网重庆话语科技有限公司重庆博毓科技有限公司大师傅a重庆纵贯线信息技术有限公司中国金融人才网重庆古意科技有限公司十九楼网络股份有限公司珠海宣传易网络科技有限公司宣传易传媒阿古重庆酒樽电子商务有限公司重庆巨蟹数码影像有限公司重庆安拓科技有限公司易充网重庆站广告联盟重庆微算盘网络技术有限责任公司重庆微算盘网络技术有限公司微算盘重庆维普资讯有限公司三峡买卖网重庆维普资讯重庆普佰电子商务有限公司重庆电信职业学院重庆永达科技宜宾市报网互动网络科技有限公司脉动网重庆随点网络营销策划公司重庆博沃科技发展有限公司巴渝人家搜狐杭州九赢互联广告技术有限公司重庆鑫蜀科技有限公司重庆奇摩科技有限公司成都聚联互动信息技术有限公司四川睿网广告传媒有限公司猪八戒网重庆爱得思青少年素质成长平台上海商亨网络科技有限公司重庆新楼盘网云日集团重庆途隆网络科技有限公司重庆朴真农业科技发展有限公司重庆盈田投资顾问有限公司完美鲜花网驴友空间自助旅游网重庆有名堂装饰设计工程有限公司重庆网润科技有限公司重庆摇钱树科技有限公司易宝支付有限公司重庆象帝科技有限公司重庆首佳网络科技有限公司重庆中商科技有限公司重庆正能量信息技术有限公司重庆卓飞科技有限公司马鞍山百助网络科技有限公司爱得思青少年成长教育平台重庆正沃文化传播有限公司重庆狐赛科技有限公司重庆车之美广告传媒有限公司重庆岚彬众拓科技有限公司重庆昂码信息技术有限公司重庆新媒农信科技有限公司重庆长寿100网络信息科技有限公司重庆妙手回春信息技术有限公岚彬众拓科技有限公司重庆云端摄影重庆万瑞商贸有限公司重庆康白度家居有限公司阿里巴巴公司波普传媒重庆鸿巨网络科技有限公司重庆炫网科技有限公司重庆利迪现代水技术设备有限公司重庆仁爱医院重庆南群网络科技有限公司涪陵学生网重庆飞驰游艇设备有限公司重庆市力量投资咨询有限公司重庆路德工程科技有限公司重庆少安科技发展有限公司千里马旅游网重庆南群科技有限公司重庆友旭科技有限公司重庆碧贵缘信息技术服务中心奇火锅集团重庆市懒人科技有限公司重庆学冠网络科技有限公司重庆奇人盛世北京文化传播有限公司广州讯动网络科技有限公司重庆竞志科技有限公司58同城重庆分公司猪八戒重庆黑纹科技有限公司重庆动传科技有限公司北京神州泰岳软件股份有限公司重庆爱尔眼科医院重庆普瑞眼科医院汉森信息名医在线重庆婚礼梦工厂重庆通宽信息技术有线公司好吃狗网重庆北流科技有限责任公司重庆智邦工程机械集团有限公司鲜蛋网重庆麦维信息技术有限公司重庆康翔实业有限公司重庆玥磐科技有限公司重庆搜罗文化传播有限公司重庆装网科技重庆领道科技有限公司重庆爱尔麦格眼科医院浙江土拨鼠网络科技有限公司重庆分公司重庆居汇网络有限公司重庆维佳元创网络科技连锁有限公司重庆电信成都依诺信息技术有限公司海波推拿医院重庆联云信息技术有限公司中国青海凯鑫矿业有限公司铭智华通科技（北京）有限公司北美找丢论坛重庆蝶变科技有限公司重庆微客巴巴信息技术有限公司巫溪网河南浩诚网络科技有限公司淮安浪强网络科技有限公司新鸥鹏集团·云教育公司站长（邓欣朋友，网名：无风）私人定制重庆上安科技发展有限公司深圳迅雷网络科技有限公司瑞星洛阳市鑫宏实业有限公司洛阳鑫宏实业有限公司重庆雷瑶电子商务服务部重庆鸟网文化艺术工作室重庆易搜网络信息技术有限公司上海艾琛网络技术有限公司重庆百度湖北巨浪网络技术公司重庆伴友科技有限公司重庆紫驰科技有限公司重庆丽友软件科技有限公司深圳市快汇宝信息技术有限公司陕西三生堂健康产业发展有限公司重庆凤水传媒有限责任公司重庆蝶盟科技有限公司重庆易宠科技有限公司重庆冠驰科技有限公司重庆袖善电子商务有限公司上海安畅网络科技股份有限公司上海艾琛网络技术有限公司重庆分公司UCloud云计算56返利网福建中邦网络成都萍聚信息技术有限公司长安集团新浪网重庆智造科技深圳市飞娱网路科技有限公司广东微时代电子商务有限公司美通云动（北京）科技有限公司重庆兆洛科技有限公司115导航网阿里巴巴竞技世界（北京）网络技术有限公司北京迪聪网络科技有限公司重庆智策科技有限公司上海优刻得重庆宏文文化传播有限公司济宁网（百姓文化传媒）重庆亿商信息技术有限公司重庆蝶传说摄影有限公司重庆易购体育器材有限公司重庆海润节能技术股份有限公司重庆工业服务港投资管理有限公司重庆萤火虫科技发展有限公司上海环球经济城发展有限公司南京五经泰文化传媒有限公司百度公司重庆环美动漫设计有限公司重庆腾众广告传媒有限公司成都呼啸网络西南大学新闻传媒学院江西中至集团重庆李子坝梁山鸡餐饮管理公司世纪龙信息网络有限责任公司当乐网云南锦绣山河电子商务有限公司黑马联盟北京神州头马文化传播有限公司重庆邦健科技上海大摩科技SEO技术网重庆爱思维尔文化传播有限公司重庆市蝶志信息技术有限公司海南创新梦想网络科技有限公司重庆周周拍网络科技有限公司昆山优迅网络科技有限公司北京奇创时代科技有限公司重庆大旗投资有限公司天津生态城国家动漫园重庆永传文化唐门游戏昭文科技（北京）有限公司芝麻开门科技有限公司重庆科道乐信息技术有限公司还没注册徐州飞飞网络科技有限公司重庆六九户外运动有限公司四川省芝麻开门科技有限公司重庆博翔电脑科技有限公司重庆市满信科技有限公司重庆网纳科技有限公司重庆孺子牛化妆品有限公司天津生态城投资运营管理公司重庆看雅乐信息技术有限公司汇仕（天津）文化传播有限公司天津生态城产业运行管理有限公司天津生态城运行管理有限公司重庆易穿得科技有限公司西南大学重庆琮元科技有限公司爱武山网重庆佛影峡旅游开发有限公司重庆唯品印刷啦科技有限公司重庆热维科技有限责任公司热维科技有限公司重庆热维科技有限公司重庆厚华科技重庆果动科技有限公司广州市高强网络科技有限公司重庆佛影峡旅游公司重庆佛影峡重庆九艺网络科技有限公司搞笑图中国洗联重庆林木森科技工业有限公司上海37玩网络科技有限公司重庆波塞顿科技有限公司爱情智慧软件重庆金夫人实业有限公司重庆叁壹零网络营销有限公司特米洛科技刘兴刚重庆思路名扬科技有限公司重庆网润科技重庆爱贝动漫制作室重庆德克特科技有限公司重庆掌龙科技重庆创软科技有限公司河南齐泰电子科技有限公司重庆我城网络科技有限公司搜同传媒有限公司南昌淘宝网络科技有限公司重庆长讯互动科技有限公司电工论坛重庆木刀网络科技有限公司上海合璧创想网络科技有限公司南昌市益友天成网络科技有限公司重庆叁壹零网络营销策划有限公司晓想彼岸网知蓝网重庆正大华日有限公司易极付科技有限公司重庆楼市通信息科技有限公司重庆旺轩商贸有限公司天津生态城国家动漫园投资贸促中心北京拉手网络技术有限公司重庆分公司重庆牧奈进出口贸易有限公司梁平县零贰叁传媒有限公司重庆艾思谱电子商务有限公司北京暴风科技股份有限公司长沙趣找科技有限公司微赢互动重庆奇摩科技爱奇艺盛大网络重庆百卓重庆瞳色科技有限公司重庆飞跃网络科技重庆木羽科技有限公司重庆康洲科贸有限公司重庆木刀网络科技有限责任公司K友汇重庆同城掌上搜网络科技重庆泽瑞房地产开发有限公司成都万象合亿文化传播有限公司重庆菜帮电子商务有限责任公司重庆傲华世游科技有限公司重庆信息港重庆嘉动广告重庆爱优果重庆金山科技集团惠州市云搜索网络技术有限公司太原众惠领域有限公司重庆市江北区投融资促进会华渝电气深圳市福中达投资控股有限公司重庆热酷网络技术有限公司数睿科技（深圳）有限公司山东省枣庄市天行信息技术有限公司上海鸿升数码科技有限公司四川大学翠河餐饮重庆真善美医药有限公司成都市万森科技有限公司联创亚信亚信联创深圳市博瑞得科技有限公司重庆蓝雨点科技有限公司万森科技有限责任公司重庆优路科技有限公司中物院计算所新浪重庆重庆市普硕软件开发中心夜重庆·酒吧网重庆商务学院28推公司华为重庆中测公司至远工作室重庆青叶网络科技有限公司万森科技重庆天熙科技有限公司重庆天熙科技乐乐英语竞技世界重庆华爱医院果动科技重庆晚报重庆万康盛鼎广告发展有限公司重庆圣西传媒重庆潍柴重庆掌脉科技有渝中报社合川友好医院重庆一心一客餐饮有限公司重庆外婆心企业管理咨询有限公司重庆首创餐饮管理有限公司（首创餐饮集团）重庆点优多网络科技有限公司重庆社交招聘网点优多嘉盛通和互联网金融公司协信地产运营总监重庆心之桥科技有限公司点优多网络科技有线公司为你钟情Leslie主题吧chongqing ankexin上海长维集团重庆老游科技有限公司湖北搜易网络科技有限公司湖北搜易科技网络公司搜易有限公司重庆市环球互联网产业园重庆掌触科技有限公司重庆掌触科技广州昊动网络科技有限公司张家港金鼎传媒有限公司杭州巴豆网络技术有限公司重庆执道健康咨询有限公司明石（中国）教育搜狐视频佳音医院河南快通网站建设重庆市创投起点创业咨询服务有限责任公司隆力奇上海杰图软件技术有限公司重庆易民生活电子商务有限公司重庆真伊（韩国）医疗美容医院重庆点易科技有限公司（涪陵在线）重庆点易科技有限公司叠拓信息技术（北京）有限公司成都分公司重庆悦道健康产业股份有限公司重庆富创信息技术有限公司重庆朴花网络科技有限公司深思文化四川睿网广告传媒有限公司重庆分公司重庆巴渝车网明易网络科技重庆信天云数字传播鸿蝶广告公司为你钟情主题吧重庆婆子妈餐饮文化有限公司重庆佳音医院趣游科技集团有限公司重庆市擎天博元科技有限公司雅福餐饮集团重庆九艺网络有限公司网宿科技成都分公司重庆点金文化发展有限公司深圳市金环天朗信息技术服务有限公司百度苏州三藏网络科技有限公司大仲恺社区味莱客餐饮管理有限公司十堰捷网传媒重庆盆景科技有限公司中国健康安全网517旅游网重庆热维科技海铭科技重庆全智网络科技有限公司莱德广告杭州巨盘科技有限公司易民生活电子商务有限公司重庆少安科技发展公司重庆即刻网络科技有限公司十堰捷网重庆美滋美企业管理咨询有限公司重庆市中冉信息产业有限公司重庆联众商务三网合一联众商务美的中央空调重庆动漫网重庆爱尔眼科爱尔眼科北京开诚互动重庆莱酷科技有限公司成都鱼游天下信息技术有限公司Tiger&Stream Game重庆海王仪表俊逸电商工作室木の尚重庆正大软件学院重庆隆讯科技有限公司重庆芮齐贸易有限公司D2D重庆沃友文化传播有限公司重庆巴丹网络科技有限责任公司重庆迅比科技有限责任公司软通动力信息技术有限公司重庆品高广告传媒有限公司重庆昂码信息科技有限公司软通动力衡磊科技有限公司37游戏微景通泸州市万森广告有限公司重庆市高校导航网络科技有限公司重庆微推互动科技微推科技有限公司铜雀台韩国整形美容医院重庆天博瑞娇科技有限公司起点创业营重庆派信广告有限公司重庆掌脉科技有限公司重庆宏点科技发展有限公司南方药业上海今点软件公司重庆宏点科技睿品视方咨询有限公司114啦联盟上海二三四五网络科技股份有限公司天格科技（杭州）有限公司重庆新锦图信息技术有限公司重庆齐汇科技有限公司中国经济王四川频道例举涉及人员：ID\t姓名\t性别\t公司\t职务\t电话\t邮箱\tQQ25\t杨义均\t0\t重庆赛克赛斯科技有限公司\t商务经理\t18996340888\t276114331@**.**.**.**\t026\t冯劲\t0\t分众传媒重庆分公司\t销售总监\t13508331060\t\t027\t冯劲\t0\t分众传媒重庆分公司\t销售总监\t13508331060\t89981407@**.**.**.**\t028\t杜鹏伟\t0\t重庆亨特斯猎头公司（摔迷之家网站站长）\t网络营销总监\\个人网站站长\t13368243243\t7004258@**.**.**.**\t700425829\t陈登俊\t0\t奉节生活网\t站长\t18696637833\t275375110@**.**.**.**\t27537511030\t向田\t0\t重庆老年信息网\t创始人\t18623101125\tweb@**.**.**.**\t031\t韩宝红\t0\t江苏蟹蟹团大闸蟹有限公司\t总经理\t13041800000\tmail@**.**.**.**\t032\t李鹏\t0\t酷汇网\t站长\t13047311117\t408000\t34201648733\t沈金华\t0\t成都银码商贸有限公司\tCEO\t13882222733\t96150@**.**.**.**\t9615034\t蔡春\t0\t重庆百卓网络科技有限公司\t总经理\t15213405223\t8190294@qq.COM\t819029435\t郭吉军\t0\t360\t总监\t13883388788\tcq6@**.**.**.**\t10065688836\t陈辉\t0\t巫山信息网\t站长\t15084476000\tChenhui57851163@**.**.**.**\t27344500738\t徐家斌\t0\t重庆肯迪科技有限公司\t总经理\t13883832002\t1478433＠**.**.**.**\t147843340\t王子鹏\t0\t重庆哥鹏科技有限公司\tCEO\t18696820828\tw@**.**.**.**\t041\t买买提大叔\t0\t新疆买买提大叔科持有限公司\t经理\t18623112188\t348047334@**.**.**.**\t34804733442\t颜剑\t0\t重庆婚庆网\t经理\t13883895133\tyanjiann@**.**.**.**\t1924094343\t程新业\t0\t重庆新之业网络发展有限公司\t总经理\t15123459666\twzxy@**.**.**.**\t1287620544\t黄鑫\t0\t十八梯社区\t站长\t18375902081\t1018758971@**.**.**.**\t101875897145\t王志鹏\t0\t重庆掌龙科技有限公司\t系统集成工程师\t18983667879\t1191127700@**.**.**.**\t0共千余条。好多头条人物啊。。。。。。。。。。。。。。   漏洞证明：  \n\n\n\n\n\n   修复方案：  更改密码，加强密码安全意识。   版权声明：转载请注明来源 我不是大神@乌云\n ", "wybug_reply": "漏洞回应  厂商回应： 危害等级：中 漏洞Rank：10  确认时间：2015-09-21 17:01 厂商回复： CNVD确认所述情况,已经转由CNCERT下发给重庆分中心,由其后续协调网站管理单位处置. 最新状态： 暂无  ", "replys": "漏洞评价：\n评论\n  \n\n\n", "wybug_level_fromcorp": "中", "wybug_rank_fromcorp": 10, "Ranks": null}