{"id": 11330, "wybug_id": "wooyun-2013-025309", "wybug_title": "北京邮电大学sql导致所有师生信息泄露-有三围哦", "wybug_corp": "北京邮电大学", "wybug_author": "淡漠天空", "wybug_date": "2013-06-07 11:30", "wybug_open_date": "2013-07-22 11:31", "wybug_type": "SQL注射漏洞", "wybug_level": "中", "wybug_rank_0": "15", "wybug_status": "未联系到厂商或者厂商积极忽略", "wybug_from": "http://www.wooyun.org", "wybug_tags": ["注射技巧"], "wybug_detail": "漏洞详情 披露状态：   \t\t\t\t\t\t\t\t\t2013-06-07：\t积极联系厂商并且等待厂商认领中，细节不对外公开\t\t\t\t\t\t\t\t\t2013-07-22：\t厂商已经主动忽略漏洞，细节向公众公开  简要描述： 之前群暴的   没人交我来吧扯个淡   http://zone.wooyun.org/content/4146   欢迎大牛围观   今天银行卡丢了  导致大姨夫   大牛们回帖见谅 详细说明：  http://www.byr.edu.cn/shownews.php?id=884   涉及sns社区  bbs论坛  北邮人主页   北邮学生信息管理系统。。。   漏洞证明：  \n\n\n\n   修复方案：  过滤   版权声明：转载请注明来源 淡漠天空@乌云\n ", "wybug_reply": "漏洞回应  厂商回应： 未能联系到厂商或者厂商积极拒绝  ", "replys": "漏洞评价：\n评论\n     2013-06-07 15:47 |    \t\t牛博恩 \t\t\t( 路人 |\t\t\t        Rank:21 漏洞数:3        | Oh god my savior)\t\t \n  快快把妹子三围交出来    \n     2013-06-08 17:27 |    \t\tMaster \t\t\t( 路人 |\t\t\t        Rank:29 漏洞数:10        )\t\t \n  有意思。。。。。果真是白帽子    \n     2013-07-22 12:46 |    \t\t纠结师 \t\t\t( 实习白帽子  |\t\t\t        Rank:53 漏洞数:12        | 传说中的废材)\t\t \n  这是什么注入工具- -     \n     2013-07-22 15:59 |    \t\tAnonymous.Antisec \t\t\t( 实习白帽子  |\t\t\t        Rank:48 漏洞数:8        | We are anonymous.)\t\t \n  不是说学校的不审核通过么？这种个人信息泄露的直接公布出来，我只能呵呵了。    \n     2013-07-22 16:16 |    \t\t淡漠天空  \t\t\t( 实习白帽子  |\t\t\t        Rank:1113 漏洞数:142        | M:出售GOV  STATE NSA CIA NASA DHS Symant...)\t\t \n  @Anonymous.Antisec 呵呵就呵呵吧    北邮那群自以为是的东西   活该    \n     2013-07-22 23:58 |    \t\tAnonymous.Antisec \t\t\t( 实习白帽子  |\t\t\t        Rank:48 漏洞数:8        | We are anonymous.)\t\t \n  法规名称 个人数据保护法  公(发)布时间 2010年05月26日  最新修正时间 2010年05月26日 上稿时间 2010年07月07日 第 一 章 总则 第 1 条 为规范个人数据之搜集、处理及利用，以避免人格权受侵害，并促进个人数据之合理利用，特制定本法。 第 2 条 本法用词，定义如下：一、个人资料：指自然人之姓名、出生年月日、国民身分证统一编号、护照号码、特征、指纹、婚姻、家庭、教育、职业、病历、医疗、基因、性生活、健康检查、犯罪前科、联络方式、财务情况、社会活动及其它得以直接或间接方式识别该个人之数据。二、个人数据文件：指依系统建立而得以自动化机器或其它非自动化方式检索、整理之个人数据之集合。三、搜集：指以任何方式取得个人数据。四、处理：指为建立或利用个人数据文件所为数据之记录、输入、储存、编辑、更正、复制、检索、删除、输出、连结或内部传送。五、利用：指将搜集之个人数据为处理以外之使用。六、国际传输：指将个人数据作跨国（境）之处理或利用。七、公务机关：指依法行使公权力之中央或地方机关或行政法人。八、非公务机关：指前款以外之自然人、法人或其它团体。九、当事人：指个人资料之本人。 第 3 条 当事人就其个人资料依本法规定行使之下列权利，不得预先抛弃或以特约限制之：一、查询或请求阅览。二、请求制给复制本。三、请求补充或更正。四、请求停止搜集、处理或利用。五、请求删除。 第 4 条 受公务机关或非公务机关委托搜集、处理或利用个人数据者，于本法适用范围内，视同委托机关。 第 5 条 个人数据之搜集、处理或利用，应尊重当事人之权益，依诚实及信用方法为之，不得逾越特定目的之必要范围，并应与搜集之目的具有正当合理之关联。 第 6 条 有关医疗、基因、性生活、健康检查及犯罪前科之个人数据，不得搜集、处理或利用。但有下列情形之一者，不在此限：一、法律明文规定。二、公务机关执行法定职务或非公务机关履行法定义务所必要，且有适当安全维护措施。三、当事人自行公开或其它已合法公开之个人数据。四、公务机关或学术研究机构基于医疗、卫生或犯罪预防之目的，为统计或学术研究而有必要，且经一定程序所为搜集、处理或利用之个人数据。前项第四款个人资料搜集、处理或利用之范围、程序及其它应遵行事项之办法，由中央目的事业主管机关会同法务部定之。 第 7 条 第十五条第二款及第十九条第五款所称书面同意，指当事人经搜集者告知本法所定应告知事项后，所为允许之书面意思表示。第十六条第七款、第二十条第一项第六款所称书面同意，指当事人经搜集者明确告知特定目的外之其它利用目的、范围及同意与否对其权益之影响后，单独所为之书面意思表示。 第 8 条 公务机关或非公务机关依第十五条或第十九条规定向当事人搜集个人资料时，应明确告知当事人下列事项：一、公务机关或非公务机关名称。二、搜集之目的。三、个人数据之类别。四、个人数据利用之期间、地区、对象及方式。五、当事人依第三条规定得行使之权利及方式。六、当事人得自由选择提供个人数据时，不提供将对其权益之影响。有下列情形之一者，得免为前项之告知：一、依法律规定得免告知。二、个人资料之搜集系公务机关执行法定职务或非公务机关履行法定义务所必要。三、告知将妨害公务机关执行法定职务。四、告知将妨害第三人之重大利益。五、当事人明知应告知之内容。 第 9 条 公务机关或非公务机关依第十五条或第十九条规定搜集非由当事人提供之个人资料，应于处理或利用前，向当事人告知个人数据来源及前条第一项第一款至第五款所列事项。有下列情形之一者，得免为前项之告知：一、有前条第二项所列各款情形之一。二、当事人自行公开或其它已合法公开之个人数据。三、不能向当事人或其法定代理人为告知。四、基于公共利益为统计或学术研究之目的而有必要，且该资料须经提供者处理后或搜集者依其揭露方式，无从识别特定当事人者为限。五、大众传播业者基于新闻报导之公益目的而搜集个人资料。第一项之告知，得于首次对当事人为利用时并同为之。 第 10 条 公务机关或非公务机关应依当事人之请求，就其搜集之个人资料，答复查询、提供阅览或制给复制本。但有下列情形之一者，不在此限：一、妨害国家安全、外交及军事机密、整体经济利益或其它国家重大利益。二、妨害公务机关执行法定职务。三、妨害该搜集机关或第三人之重大利益。 第 11 条 公务机关或非公务机关应维护个人资料之正确，并应主动或依当事人之请求更正或补充之。个人数据正确性有争议者，应主动或依当事人之请求停止处理或利用。但因执行职务或业务所必须并注明其争议或经当事人书面同意者，不在此限。个人资料搜集之特定目的消失或期限届满时，应主动或依当事人之请求，删除、停止处理或利用该个人数据。但因执行职务或业务所必须或经当事人书面同意者，不在此限。违反本法规定搜集、处理或利用个人数据者，应主动或依当事人之请求，删除、停止搜集、处理或利用该个人数据。因可归责于公务机关或非公务机关之事由，未为更正或补充之个人资料，应于更正或补充后，通知曾提供利用之对象。 第 12 条 公务机关或非公务机关违反本法规定，致个人资料被窃取、泄漏、窜改或其它侵害者，应查明后以适当方式通知当事人。 第 13 条 公务机关或非公务机关受理当事人依第十条规定之请求，应于十五日内，为准驳之决定；必要时，得予延长，延长之期间不得逾十五日，并应将其原因以书面通知请求人。公务机关或非公务机关受理当事人依第十一条规定之请求，应于三十日内，为准驳之决定；必要时，得予延长，延长之期间不得逾三十日，并应将其原因以书面通知请求人。 第 14 条 查询或请求阅览个人数据或制给复制本者，公务机关或非公务机关得酌收必要成本费用。    第 二 章 公务机关对个人数据之搜集、处理及利用 第 15 条 公务机关对个人数据之搜集或处理，除第六条第一项所规定数据外，应有特定目的，并符合下列情形之一者：一、执行法定职务必要范围内。二、经当事人书面同意。三、对当事人权益无侵害。 第 16 条 公务机关对个人数据之利用，除第六条第一项所规定数据外，应于执行法定职务必要范围内为之，并与搜集之特定目的相符。但有下列情形之一者，得为特定目的外之利用：一、法律明文规定。二、为维护国家安全或增进公共利益。三、为免除当事人之生命、身体、自由或财产上之危险。四、为防止他人权益之重大危害。五、公务机关或学术研究机构基于公共利益为统计或学术研究而有必要，且资料经过提供者处理后或搜集者依其揭露方式无从识别特定之当事人。六、有利于当事人权益。七、经当事人书面同意。 第 17 条 公务机关应将下列事项公开于计算机网站，或以其它适当方式供公众查阅；其有变更者，亦同：一、个人数据文件名称。二、保有机关名称及联络方式。三、个人数据文件保有之依据及特定目的。四、个人数据之类别。 第 18 条 公务机关保有个人数据文件者，应指定专人办理安全维护事项，防止个人数据被窃取、窜改、毁损、灭失或泄漏。    第 三 章 非公务机关对个人数据之搜集、处理及利用 第 19 条 非公务机关对个人数据之搜集或处理，除第六条第一项所规定数据外，应有特定目的，并符合下列情形之一者：一、法律明文规定。二、与当事人有契约或类似契约之关系。三、当事人自行公开或其它已合法公开之个人数据。四、学术研究机构基于公共利益为统计或学术研究而有必要，且资料经过提供者处理后或搜集者依其揭露方式无从识别特定之当事人。五、经当事人书面同意。六、与公共利益有关。七、个人资料取自于一般可得之来源。但当事人对该数据之禁止处理或利用，显有更值得保护之重大利益者，不在此限。搜集或处理者知悉或经当事人通知依前项第七款但书规定禁止对该数据之处理或利用时，应主动或依当事人之请求，删除、停止处理或利用该个人数据。 第 20 条 非公务机关对个人数据之利用，除第六条第一项所规定资料外，应于搜集之特定目的必要范围内为之。但有下列情形之一者，得为特定目的外之利用：一、法律明文规定。二、为增进公共利益。三、为免除当事人之生命、身体、自由或财产上之危险。四、为防止他人权益之重大危害。五、公务机关或学术研究机构基于公共利益为统计或学术研究而有必要，且资料经过提供者处理后或搜集者依其揭露方式无从识别特定之当事人。六、经当事人书面同意。非公务机关依前项规定利用个人资料营销者，当事人表示拒绝接受营销时，应即停止利用其个人数据营销。非公务机关于首次营销时，应提供当事人表示拒绝接受营销之方式，并支付所需费用。 第 21 条 非公务机关为国际传输个人资料，而有下列情形之一者，中央目的事业主管机关得限制之：一、涉及国家重大利益。二、国际条约或协议有特别规定。三、接受国对于个人数据之保护未有完善之法规，致有损当事人权益之虞。四、以迂回方法向第三国（地区）传输个人数据规避本法。 第 22 条 中央目的事业主管机关或直辖市、县（市）政府为执行数据文件安全维护、业务终止数据处理方法、国际传输限制或其它例行性业务检查而认有必要或有违反本法规定之虞时，得派员携带执行职务证明文件，进入检查，并得命相关人员为必要之说明、配合措施或提供相关证明资料。中央目的事业主管机关或直辖市、县（市）政府为前项检查时，对于得没入或可为证据之个人数据或其档案，得扣留或复制之。对于应扣留或复制之物，得要求其所有人、持有人或保管人提出或交付；无正当理由拒绝提出、交付或抗拒扣留或复制者，得采取对该非公务机关权益损害最少之方法强制为之。中央目的事业主管机关或直辖市、县（市）政府为第一项检查时，得率同信息、电信或法律等专业人员共同为之。对于第一项及第二项之进入、检查或处分，非公务机关及其相关人员不得规避、妨碍或拒绝。参与检查之人员，因检查而知悉他人资料者，负保密义务。 第 23 条 对于前条第二项扣留物或复制物，应加封缄或其它标识，并为适当之处置；其不便搬运或保管者，得命人看守或交由所有人或其它适当之人保管。扣留物或复制物已无留存之必要，或决定不予处罚或未为没入之裁处者，应发还之。但应没入或为调查他案应留存者，不在此限。 第 24 条 非公务机关、物之所有人、持有人、保管人或利害关系人对前二条之要求、强制、扣留或复制行为不服者，得向中央目的事业主管机关或直辖市、县（市）政府声明异议。前项声明异议，中央目的事业主管机关或直辖市、县（市）政府认为有理由者，应立即停止或变更其行为；认为无理由者，得继续执行。经该声明异议之人请求时，应将声明异议之理由制作纪录交付之。对于中央目的事业主管机关或直辖市、县（市）政府前项决定不服者，仅得于对该案件之实体决定声明不服时一并声明之。但第一项之人依法不得对该案件之实体决定声明不服时，得单独对第一项之行为径行提起行政诉讼。 第 25 条 非公务机关有违反本法规定之情事者，中央目的事业主管机关或直辖市、县（市）政府除依本法规定裁处罚锾外，并得为下列处分：一、禁止搜集、处理或利用个人数据。二、命令删除经处理之个人数据文件。三、没入或命销毁违法搜集之个人资料。四、公布非公务机关之违法情形，及其姓名或名称与负责人。中央目的事业主管机关或直辖市、县（市）政府为前项处分时，应于防制违反本法规定情事之必要范围内，采取对该非公务机关权益损害最少之方法为之。 第 26 条 中央目的事业主管机关或直辖市、县（市）政府依第二十二条规定检查后，未发现有违反本法规定之情事者，经该非公务机关同意后，得公布检查结果。 第 27 条 非公务机关保有个人数据文件者，应实行适当之安全措施，防止个人数据被窃取、窜改、毁损、灭失或泄漏。中央目的事业主管机关得指定非公务机关订定个人数据文件安全维护计划或业务终止后个人数据处理方法。前项计划及处理方法之标准等相关事项之办法，由中央目的事业主管机关定之。    第 四 章 损害赔偿及团体诉讼 第 28 条 公务机关违反本法规定，致个人资料遭不法搜集、处理、利用或其它侵害当事人权利者，负损害赔偿责任。但损害因天灾、事变或其它不可抗力所致者，不在此限。被害人虽非财产上之损害，亦得请求赔偿相当之金额；其名誉被侵害者，并得请求为回复名誉之适当处分。依前二项情形，如被害人不易或不能证明其实际损害额时，得请求法院依侵害情节，以每人每一事件新台币五百元以上二万元以下计算。对于同一原因事实造成多数当事人权利受侵害之事件，经当事人请求损害赔偿者，其合计最高总额以新台币二亿元为限。但因该原因事实所涉利益超过新台币二亿元者，以该所涉利益为限。同一原因事实造成之损害总额逾前项金额时，被害人所受赔偿金额，不受第三项所定每人每一事件最低赔偿金额新台币五百元之限制。第二项请求权，不得让与或继承。但以金额赔偿之请求权已依契约承诺或已起诉者，不在此限。 第 29 条 非公务机关违反本法规定，致个人资料遭不法搜集、处理、利用或其它侵害当事人权利者，负损害赔偿责任。但能证明其无故意或过失者，不在此限。依前项规定请求赔偿者，适用前条第二项至第六项规定。 第 30 条 损害赔偿请求权，自请求权人知有损害及赔偿义务人时起，因二年间不行使而消灭；自损害发生时起，逾五年者，亦同。 第 31 条 损害赔偿，除依本法规定外，公务机关适用国家赔偿法之规定，非公务机关适用民法之规定。 第 32 条 依本章规定提起诉讼之财团法人或公益社团法人，应符合下列要件：一、财团法人之登记财产总额达新台币一千万元或社团法人之社员人数达一百人。二、保护个人数据事项于其章程所定目的范围内。三、许可设立三年以上。 第 33 条 依本法规定对于公务机关提起损害赔偿诉讼者，专属该机关所在地之地方法院管辖。对于非公务机关提起者，专属其主事务所、主营业所或住所地之地方法院管辖。前项非公务机关为自然人，而其在中华民国现无住所或住所不明者，以其在中华民国之居所，视为其住所；无居所或居所不明者，以其在中华民国最后之住所，视为其住所；无最后住所者，专属中央政府所在地之地方法院管辖。第一项非公务机关为自然人以外之法人或其它团体，而其在中华民国现无主事务所、主营业所或主事务所、主营业所不明者，专属中央政府所在地之地方法院管辖。 第 34 条 对于同一原因事实造成多数当事人权利受侵害之事件，财团法人或公益社团法人经受有损害之当事人二十人以上以书面授与诉讼实施权者，得以自己之名义，提起损害赔偿诉讼。当事人得于言词辩论终结前以书面撤回诉讼实施权之授与，并通知法院。前项诉讼，法院得依声请或依职权公告晓示其它因同一原因事实受有损害之当事人，得于一定期间内向前项起诉之财团法人或公益社团法人授与诉讼实施权，由该财团法人或公益社团法人于第一审言词辩论终结前，扩张应受判决事项之声明。其它因同一原因事实受有损害之当事人未依前项规定授与诉讼实施权者，亦得于法院公告晓示之一定期间内起诉，由法院并案审理。其它因同一原因事实受有损害之当事人，亦得声请法院为前项之公告。前二项公告，应揭示于法院公告处、信息网络及其它适当处所；法院认为必要时，并得命登载于公报或新闻纸，或用其它方法公告之，其费用由国库垫付。依第一项规定提起诉讼之财团法人或公益社团法人，其标的价额超过新台币六十万元者，超过部分暂免征裁判费。 第 35 条 当事人依前条第一项规定撤回诉讼实施权之授与者，该部分诉讼程序当然停止，该当事人应即声明承受诉讼，法院亦得依职权命该当事人承受诉讼。财团法人或公益社团法人依前条规定起诉后，因部分当事人撤回诉讼实施权之授与，致其余部分不足二十人者，仍得就其余部分继续进行诉讼。 第 36 条 各当事人于第三十四条第一项及第二项之损害赔偿请求权，其时效应分别计算。 第 37 条 财团法人或公益社团法人就当事人授与诉讼实施权之事件，有为一切诉讼行为之权。但当事人得限制其为舍弃、撤回或和解。前项当事人中一人所为之限制，其效力不及于其它当事人。第一项之限制，应于第三十四条第一项之文书内表明，或以书状提出于法院。 第 38 条 当事人对于第三十四条诉讼之判决不服者，得于财团法人或公益社团法人上诉期间届满前，撤回诉讼实施权之授与，依法提起上诉。财团法人或公益社团法人于收受判决书正本后，应即将其结果通知当事人，并应于七日内将是否提起上诉之意旨以书面通知当事人。 第 39 条 财团法人或公益社团法人应将第三十四条诉讼结果所得之赔偿，扣除诉讼必要费用后，分别交付授与诉讼实施权之当事人。提起第三十四条第一项诉讼之财团法人或公益社团法人，均不得请求报酬。 第 40 条 依本章规定提起诉讼之财团法人或公益社团法人，应委任律师代理诉讼。    第 五 章 罚则 第 41 条 违反第六条第一项、第十五条、第十六条、第十九条、第二十条第一项规定，或中央目的事业主管机关依第二十一条限制国际传输之命令或处分，足生损害于他人者，处二年以下有期徒刑、拘役或科或并科新台币二十万元以下罚金。意图营利犯前项之罪者，处五年以下有期徒刑，得并科新台币一百万元以下罚金。 第 42 条 意图为自己或第三人不法之利益或损害他人之利益，而对于个人数据文件为非法变更、删除或以其它非法方法，致妨害个人数据文件之正确而足生损害于他人者，处五年以下有期徒刑、拘役或科或并科新台币一百万元以下罚金。 第 43 条 中华民国人民在中华民国领域外对中华民国人民犯前二条之罪者，亦适用之。 第 44 条 公务员假借职务上之权力、机会或方法，犯本章之罪者，加重其刑至二分之一。 第 45 条 本章之罪，须告诉乃论。但犯第四十一条第二项之罪者，或对公务机关犯第四十二条之罪者，不在此限。 第 46 条 犯本章之罪，其它法律有较重处罚规定者，从其规定。 第 47 条 非公务机关有下列情事之一者，由中央目的事业主管机关或直辖市、县（市）政府处新台币五万元以上五十万元以下罚锾，并令限期改正，届期未改正者，按次处罚之：一、违反第六条第一项规定。二、违反第十九条规定。三、违反第二十条第一项规定。四、违反中央目的事业主管机关依第二十一条规定限制国际传输之命令或处分。 第 48 条 非公务机关有下列情事之一者，由中央目的事业主管机关或直辖市、县（市）政府限期改正，届期未改正者，按次处新台币二万元以上二十万元以下罚锾：一、违反第八条或第九条规定。二、违反第十条、第十一条、第十二条或第十三条规定。三、违反第二十条第二项或第三项规定。四、违反第二十七条第一项或未依第二项订定个人数据文件安全维护计划或业务终止后个人数据处理方法。 第 49 条 非公务机关无正当理由违反第二十二条第四项规定者，由中央目的事业主管机关或直辖市、县（市）政府处新台币二万元以上二十万元以下罚锾。 第 50 条 非公务机关之代表人、管理人或其它有代表权人，因该非公务机关依前三条规定受罚锾处罚时，除能证明已尽防止义务者外，应并受同一额度罚锾之处罚。    第 六 章 附则 第 51 条 有下列情形之一者，不适用本法规定：一、自然人为单纯个人或家庭活动之目的，而搜集、处理或利用个人数据。二、于公开场所或公开活动中所搜集、处理或利用之未与其它个人数据结合之影音数据。公务机关及非公务机关，在中华民国领域外对中华民国人民个人数据搜集、处理或利用者，亦适用本法。 第 52 条 第二十二条至第二十六条规定由中央目的事业主管机关或直辖市、县（市）政府执行之权限，得委任所属机关、委托其它机关或公益团体办理；其成员因执行委任或委托事务所知悉之信息，负保密义务。前项之公益团体，不得依第三十四条第一项规定接受当事人授与诉讼实施权，以自己之名义提起损害赔偿诉讼。 第 53 条 本法所定特定目的及个人数据类别，由法务部会同中央目的事业主管机关指定之。 第 54 条 本法修正施行前非由当事人提供之个人资料，依第九条规定应于处理或利用前向当事人为告知者，应自本法修正施行之日起一年内完成告知，逾期未告知而处理或利用者，以违反第九条规定论处。 第 55 条 本法施行细则，由法务部定之。 第 56 条 本法施行日期，由行政院定之。现行条文第十九条至第二十二条及第四十三条之删除，自公布尔日施行。前项公布尔日于现行条文第四十三条第二项指定之事业、团体或个人应于指定之日起六个月内办理登记或许可之期间内者，该指定之事业、团体或个人得申请终止办理，目的事业主管机关于终止办理时，应退还已缴规费。已办理完成者，亦得申请退费。前项退费，应自缴费义务人缴纳之日起，至目的事业主管机关终止办理之日止，按退费额，依缴费之日邮政储金之一年期定期存款利率，按日加计利息，一并退还。已办理完成者，其退费，应自缴费义务人缴纳之日起，至目的事业主管机关核准申请之日止，亦同。    \n     2013-07-26 16:52 |    \t\tGrayTrack \t\t\t( 实习白帽子  |\t\t\t        Rank:75 漏洞数:14        | 灰色轨迹)\t\t \n  @纠结师 这是法克的椰树喔    \n     2013-07-26 17:35 |    \t\t纠结师 \t\t\t( 实习白帽子  |\t\t\t        Rank:53 漏洞数:12        | 传说中的废材)\t\t \n  @GrayTrack  居然如此叼差  我还是要赶紧要个帐号去法克参观啦..    \n     2013-07-26 17:39 |    \t\t淡漠天空  \t\t\t( 实习白帽子  |\t\t\t        Rank:1113 漏洞数:142        | M:出售GOV  STATE NSA CIA NASA DHS Symant...)\t\t \n  @纠结师 WebCruiser 你要我给你  有局限性    \n     2013-07-26 18:39 |    \t\t纠结师 \t\t\t( 实习白帽子  |\t\t\t        Rank:53 漏洞数:12        | 传说中的废材)\t\t \n  @淡漠天空  什么情况..    \n     2013-07-31 14:55 |    \t\tjhdxr \t\t\t( 路人 |\t\t\t        Rank:3 漏洞数:2        | 这家伙很懒，所以。。。)\t\t \n  呵呵，这就是所谓的白帽子    \n     2013-07-31 16:50 |    \t\t淡漠天空  \t\t\t( 实习白帽子  |\t\t\t        Rank:1113 漏洞数:142        | M:出售GOV  STATE NSA CIA NASA DHS Symant...)\t\t \n  @jhdxr 比你好  垃圾北邮  怎么了  不服来辩？   不是国家安全摇篮么  笑话    \n     2013-07-31 17:58 |    \t\tjhdxr \t\t\t( 路人 |\t\t\t        Rank:3 漏洞数:2        | 这家伙很懒，所以。。。)\t\t \n  @淡漠天空 我不是北邮的。在我看来相比北邮，你名字后面的白帽子三个字才是更大的笑话    \n     2013-07-31 18:47 |    \t\t淡漠天空  \t\t\t( 实习白帽子  |\t\t\t        Rank:1113 漏洞数:142        | M:出售GOV  STATE NSA CIA NASA DHS Symant...)\t\t \n  @jhdxr 你更是个笑话  可笑的东西    不服继续辩      \n     2013-07-31 21:33 |    \t\tjhdxr \t\t\t( 路人 |\t\t\t        Rank:3 漏洞数:2        | 这家伙很懒，所以。。。)\t\t \n  @淡漠天空 呵呵，刷rank、入侵学校，这种渣子（是的，我人身攻击了，没错，想封号请便）的行为就是白帽子应该做的？    \n     2013-07-31 21:56 |    \t\t淡漠天空  \t\t\t( 实习白帽子  |\t\t\t        Rank:1113 漏洞数:142        | M:出售GOV  STATE NSA CIA NASA DHS Symant...)\t\t \n  @jhdxr 你就是废物  我说的  呵呵 笑死了  有能力在说话  渣渣sb一样   不服你来打我啊  懒得理你       \n     2013-07-31 21:59 |    \t\t淡漠天空  \t\t\t( 实习白帽子  |\t\t\t        Rank:1113 漏洞数:142        | M:出售GOV  STATE NSA CIA NASA DHS Symant...)\t\t \n  @jhdxr 我人身攻击了 快告我去  坐等渣渣    \n     2013-07-31 23:24 |    \t\t纠结师 \t\t\t( 实习白帽子  |\t\t\t        Rank:53 漏洞数:12        | 传说中的废材)\t\t \n  不参加你们的口水战  不过 白帽子就不能渗透测试的么?    \n  \n\n\n", "wybug_level_fromcorp": "无影响厂商忽略", "wybug_rank_fromcorp": 0, "Ranks": null}